Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x186f (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 37 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x33148): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0xab5dc): ../Core/Src/main.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0xa25d5): C:/Users/Daniel/Desktop/FG9322/IDE - Interior Digital Entertainment/IDE_FBL/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 27 (DW_TAG_enumeration_type)
    <2b>   DW_AT_encoding    : 5	(signed)
    <2c>   DW_AT_byte_size   : 1
    <2c>   DW_AT_type        : <0x24d>
    <30>   DW_AT_decl_file   : 4
    <31>   DW_AT_decl_line   : 66
    <32>   DW_AT_decl_column : 1
    <32>   DW_AT_sibling     : <0x24d>
 <2><36>: Abbrev Number: 20 (DW_TAG_enumerator)
    <37>   DW_AT_name        : (indirect string, offset: 0x1cc21): NonMaskableInt_IRQn
    <3b>   DW_AT_const_value : -14
 <2><3c>: Abbrev Number: 20 (DW_TAG_enumerator)

    <233>   DW_AT_const_value : 76
 <2><234>: Abbrev Number: 1 (DW_TAG_enumerator)
    <235>   DW_AT_name        : (indirect string, offset: 0x4ed88): OTG_HS_IRQn
    <239>   DW_AT_const_value : 77
 <2><23a>: Abbrev Number: 1 (DW_TAG_enumerator)
    <23b>   DW_AT_name        : (indirect string, offset: 0xb44c0): DCMI_IRQn
    <23f>   DW_AT_const_value : 78
 <2><240>: Abbrev Number: 1 (DW_TAG_enumerator)
    <241>   DW_AT_name        : (indirect string, offset: 0xad30f): RNG_IRQn
    <245>   DW_AT_const_value : 80
 <2><246>: Abbrev Number: 1 (DW_TAG_enumerator)
    <247>   DW_AT_name        : (indirect string, offset: 0x3ea0d): FPU_IRQn
    <24b>   DW_AT_const_value : 81
 <2><24c>: Abbrev Number: 0
 <1><24d>: Abbrev Number: 15 (DW_TAG_base_type)
    <24e>   DW_AT_byte_size   : 1
    <24f>   DW_AT_encoding    : 6	(signed char)
    <250>   DW_AT_name        : (indirect string, offset: 0x6079e): signed char
 <1><254>: Abbrev Number: 4 (DW_TAG_typedef)
    <255>   DW_AT_name        : (indirect string, offset: 0xa7fc8): IRQn_Type
    <259>   DW_AT_decl_file   : 4
    <25a>   DW_AT_decl_line   : 158
    <25b>   DW_AT_decl_column : 3
    <25c>   DW_AT_type        : <0x2a>
 <1><260>: Abbrev Number: 4 (DW_TAG_typedef)
    <261>   DW_AT_name        : (indirect string, offset: 0x387b5): __uint8_t
    <265>   DW_AT_decl_file   : 5
    <266>   DW_AT_decl_line   : 43
    <267>   DW_AT_decl_column : 24
    <268>   DW_AT_type        : <0x26c>
 <1><26c>: Abbrev Number: 15 (DW_TAG_base_type)
    <26d>   DW_AT_byte_size   : 1
    <26e>   DW_AT_encoding    : 8	(unsigned char)
    <26f>   DW_AT_name        : (indirect string, offset: 0xb9a19): unsigned char
 <1><273>: Abbrev Number: 15 (DW_TAG_base_type)
    <274>   DW_AT_byte_size   : 2
    <275>   DW_AT_encoding    : 5	(signed)
    <276>   DW_AT_name        : (indirect string, offset: 0x8ee5c): short int
 <1><27a>: Abbrev Number: 4 (DW_TAG_typedef)
    <27b>   DW_AT_name        : (indirect string, offset: 0x9c943): __uint16_t
    <27f>   DW_AT_decl_file   : 5
    <280>   DW_AT_decl_line   : 57
    <281>   DW_AT_decl_column : 25
    <282>   DW_AT_type        : <0x286>
 <1><286>: Abbrev Number: 15 (DW_TAG_base_type)
    <287>   DW_AT_byte_size   : 2
    <288>   DW_AT_encoding    : 7	(unsigned)
    <289>   DW_AT_name        : (indirect string, offset: 0xb82c1): short unsigned int
 <1><28d>: Abbrev Number: 15 (DW_TAG_base_type)
    <28e>   DW_AT_byte_size   : 4
    <28f>   DW_AT_encoding    : 5	(signed)
    <290>   DW_AT_name        : (indirect string, offset: 0x1001d): long int
 <1><294>: Abbrev Number: 4 (DW_TAG_typedef)
    <295>   DW_AT_name        : (indirect string, offset: 0x7a423): __uint32_t
    <299>   DW_AT_decl_file   : 5
    <29a>   DW_AT_decl_line   : 79
    <29b>   DW_AT_decl_column : 25
    <29c>   DW_AT_type        : <0x2a0>
 <1><2a0>: Abbrev Number: 15 (DW_TAG_base_type)
    <2a1>   DW_AT_byte_size   : 4
    <2a2>   DW_AT_encoding    : 7	(unsigned)
    <2a3>   DW_AT_name        : (indirect string, offset: 0x49bed): long unsigned int
 <1><2a7>: Abbrev Number: 15 (DW_TAG_base_type)
    <2a8>   DW_AT_byte_size   : 8
    <2a9>   DW_AT_encoding    : 5	(signed)
    <2aa>   DW_AT_name        : (indirect string, offset: 0x57ad3): long long int
 <1><2ae>: Abbrev Number: 4 (DW_TAG_typedef)
    <2af>   DW_AT_name        : (indirect string, offset: 0x589b8): __uint64_t
    <2b3>   DW_AT_decl_file   : 5
    <2b4>   DW_AT_decl_line   : 105
    <2b5>   DW_AT_decl_column : 25
    <2b6>   DW_AT_type        : <0x2ba>
 <1><2ba>: Abbrev Number: 15 (DW_TAG_base_type)
    <2bb>   DW_AT_byte_size   : 8
    <2bc>   DW_AT_encoding    : 7	(unsigned)
    <2bd>   DW_AT_name        : (indirect string, offset: 0x28c33): long long unsigned int
 <1><2c1>: Abbrev Number: 38 (DW_TAG_base_type)
    <2c2>   DW_AT_byte_size   : 4
    <2c3>   DW_AT_encoding    : 5	(signed)
    <2c4>   DW_AT_name        : int
 <1><2c8>: Abbrev Number: 15 (DW_TAG_base_type)
    <2c9>   DW_AT_byte_size   : 4
    <2ca>   DW_AT_encoding    : 7	(unsigned)
    <2cb>   DW_AT_name        : (indirect string, offset: 0xf6e9): unsigned int
 <1><2cf>: Abbrev Number: 4 (DW_TAG_typedef)
    <2d0>   DW_AT_name        : (indirect string, offset: 0x387b7): uint8_t
    <2d4>   DW_AT_decl_file   : 6
    <2d5>   DW_AT_decl_line   : 24
    <2d6>   DW_AT_decl_column : 19
    <2d7>   DW_AT_type        : <0x260>
 <1><2db>: Abbrev Number: 21 (DW_TAG_volatile_type)
    <2dc>   DW_AT_type        : <0x2cf>
 <1><2e0>: Abbrev Number: 22 (DW_TAG_const_type)
    <2e1>   DW_AT_type        : <0x2cf>
 <1><2e5>: Abbrev Number: 4 (DW_TAG_typedef)
    <2e6>   DW_AT_name        : (indirect string, offset: 0x9c945): uint16_t
    <2ea>   DW_AT_decl_file   : 6
    <2eb>   DW_AT_decl_line   : 36
    <2ec>   DW_AT_decl_column : 20
    <2ed>   DW_AT_type        : <0x27a>
 <1><2f1>: Abbrev Number: 4 (DW_TAG_typedef)
    <2f2>   DW_AT_name        : (indirect string, offset: 0x7a425): uint32_t
    <2f6>   DW_AT_decl_file   : 6
    <2f7>   DW_AT_decl_line   : 48
    <2f8>   DW_AT_decl_column : 20
    <2f9>   DW_AT_type        : <0x294>
 <1><2fd>: Abbrev Number: 21 (DW_TAG_volatile_type)
    <2fe>   DW_AT_type        : <0x2f1>
 <1><302>: Abbrev Number: 22 (DW_TAG_const_type)
    <303>   DW_AT_type        : <0x2fd>
 <1><307>: Abbrev Number: 4 (DW_TAG_typedef)
    <308>   DW_AT_name        : (indirect string, offset: 0x589ba): uint64_t
    <30c>   DW_AT_decl_file   : 6
    <30d>   DW_AT_decl_line   : 60
    <30e>   DW_AT_decl_column : 20
    <30f>   DW_AT_type        : <0x2ae>
 <1><313>: Abbrev Number: 28 (DW_TAG_structure_type)
    <314>   DW_AT_byte_size   : 140
    <315>   DW_AT_decl_file   : 2
    <316>   DW_AT_decl_line   : 445
    <318>   DW_AT_decl_column : 9
    <318>   DW_AT_sibling     : <0x443>
 <2><31c>: Abbrev Number: 3 (DW_TAG_member)
    <31d>   DW_AT_name        : (indirect string, offset: 0x3f459): CPUID
    <321>   DW_AT_decl_file   : 2
    <322>   DW_AT_decl_line   : 447
    <324>   DW_AT_decl_column : 18
    <325>   DW_AT_type        : <0x302>
    <329>   DW_AT_data_member_location: 0
 <2><32a>: Abbrev Number: 3 (DW_TAG_member)
    <32b>   DW_AT_name        : (indirect string, offset: 0x3e7ff): ICSR
    <32f>   DW_AT_decl_file   : 2
    <330>   DW_AT_decl_line   : 448
    <332>   DW_AT_decl_column : 18
    <333>   DW_AT_type        : <0x2fd>
    <337>   DW_AT_data_member_location: 4
 <2><338>: Abbrev Number: 3 (DW_TAG_member)
    <339>   DW_AT_name        : (indirect string, offset: 0x64d0): VTOR
    <33d>   DW_AT_decl_file   : 2
    <33e>   DW_AT_decl_line   : 449
    <340>   DW_AT_decl_column : 18
    <341>   DW_AT_type        : <0x2fd>
    <345>   DW_AT_data_member_location: 8
 <2><346>: Abbrev Number: 3 (DW_TAG_member)
    <347>   DW_AT_name        : (indirect string, offset: 0x1a252): AIRCR
    <34b>   DW_AT_decl_file   : 2
    <34c>   DW_AT_decl_line   : 450
    <34e>   DW_AT_decl_column : 18
    <34f>   DW_AT_type        : <0x2fd>
    <353>   DW_AT_data_member_location: 12
 <2><354>: Abbrev Number: 8 (DW_TAG_member)
    <355>   DW_AT_name        : SCR
    <359>   DW_AT_decl_file   : 2
    <35a>   DW_AT_decl_line   : 451
    <35c>   DW_AT_decl_column : 18
    <35d>   DW_AT_type        : <0x2fd>
    <361>   DW_AT_data_member_location: 16
 <2><362>: Abbrev Number: 8 (DW_TAG_member)
    <363>   DW_AT_name        : CCR
    <367>   DW_AT_decl_file   : 2
    <368>   DW_AT_decl_line   : 452
    <36a>   DW_AT_decl_column : 18
    <36b>   DW_AT_type        : <0x2fd>
    <36f>   DW_AT_data_member_location: 20
 <2><370>: Abbrev Number: 8 (DW_TAG_member)
    <371>   DW_AT_name        : SHP
    <375>   DW_AT_decl_file   : 2
    <376>   DW_AT_decl_line   : 453
    <378>   DW_AT_decl_column : 18
    <379>   DW_AT_type        : <0x453>
    <37d>   DW_AT_data_member_location: 24
 <2><37e>: Abbrev Number: 3 (DW_TAG_member)
    <37f>   DW_AT_name        : (indirect string, offset: 0x6684a): SHCSR
    <383>   DW_AT_decl_file   : 2
    <384>   DW_AT_decl_line   : 454
    <386>   DW_AT_decl_column : 18
    <387>   DW_AT_type        : <0x2fd>
    <38b>   DW_AT_data_member_location: 36
 <2><38c>: Abbrev Number: 3 (DW_TAG_member)
    <38d>   DW_AT_name        : (indirect string, offset: 0x2f3fb): CFSR
    <391>   DW_AT_decl_file   : 2
    <392>   DW_AT_decl_line   : 455
    <394>   DW_AT_decl_column : 18
    <395>   DW_AT_type        : <0x2fd>
    <399>   DW_AT_data_member_location: 40
 <2><39a>: Abbrev Number: 3 (DW_TAG_member)
    <39b>   DW_AT_name        : (indirect string, offset: 0x69ded): HFSR
    <39f>   DW_AT_decl_file   : 2
    <3a0>   DW_AT_decl_line   : 456
    <3a2>   DW_AT_decl_column : 18
    <3a3>   DW_AT_type        : <0x2fd>
    <3a7>   DW_AT_data_member_location: 44
 <2><3a8>: Abbrev Number: 3 (DW_TAG_member)
    <3a9>   DW_AT_name        : (indirect string, offset: 0x9c2c9): DFSR
    <3ad>   DW_AT_decl_file   : 2
    <3ae>   DW_AT_decl_line   : 457
    <3b0>   DW_AT_decl_column : 18
    <3b1>   DW_AT_type        : <0x2fd>
    <3b5>   DW_AT_data_member_location: 48
 <2><3b6>: Abbrev Number: 3 (DW_TAG_member)
    <3b7>   DW_AT_name        : (indirect string, offset: 0xae838): MMFAR
    <3bb>   DW_AT_decl_file   : 2
    <3bc>   DW_AT_decl_line   : 458
    <3be>   DW_AT_decl_column : 18
    <3bf>   DW_AT_type        : <0x2fd>
    <3c3>   DW_AT_data_member_location: 52
 <2><3c4>: Abbrev Number: 3 (DW_TAG_member)
    <3c5>   DW_AT_name        : (indirect string, offset: 0x4ec09): BFAR
    <3c9>   DW_AT_decl_file   : 2
    <3ca>   DW_AT_decl_line   : 459
    <3cc>   DW_AT_decl_column : 18
    <3cd>   DW_AT_type        : <0x2fd>
    <3d1>   DW_AT_data_member_location: 56
 <2><3d2>: Abbrev Number: 3 (DW_TAG_member)
    <3d3>   DW_AT_name        : (indirect string, offset: 0xbf850): AFSR
    <3d7>   DW_AT_decl_file   : 2
    <3d8>   DW_AT_decl_line   : 460
    <3da>   DW_AT_decl_column : 18
    <3db>   DW_AT_type        : <0x2fd>
    <3df>   DW_AT_data_member_location: 60
 <2><3e0>: Abbrev Number: 8 (DW_TAG_member)
    <3e1>   DW_AT_name        : PFR
    <3e5>   DW_AT_decl_file   : 2
    <3e6>   DW_AT_decl_line   : 461
    <3e8>   DW_AT_decl_column : 18
    <3e9>   DW_AT_type        : <0x46d>
    <3ed>   DW_AT_data_member_location: 64
 <2><3ee>: Abbrev Number: 8 (DW_TAG_member)
    <3ef>   DW_AT_name        : DFR
    <3f3>   DW_AT_decl_file   : 2
    <3f4>   DW_AT_decl_line   : 462
    <3f6>   DW_AT_decl_column : 18
    <3f7>   DW_AT_type        : <0x302>
    <3fb>   DW_AT_data_member_location: 72
 <2><3fc>: Abbrev Number: 8 (DW_TAG_member)
    <3fd>   DW_AT_name        : ADR
    <401>   DW_AT_decl_file   : 2
    <402>   DW_AT_decl_line   : 463
    <404>   DW_AT_decl_column : 18
    <405>   DW_AT_type        : <0x302>
    <409>   DW_AT_data_member_location: 76
 <2><40a>: Abbrev Number: 3 (DW_TAG_member)
    <40b>   DW_AT_name        : (indirect string, offset: 0x4d601): MMFR
    <40f>   DW_AT_decl_file   : 2
    <410>   DW_AT_decl_line   : 464
    <412>   DW_AT_decl_column : 18
    <413>   DW_AT_type        : <0x487>
    <417>   DW_AT_data_member_location: 80
 <2><418>: Abbrev Number: 3 (DW_TAG_member)
    <419>   DW_AT_name        : (indirect string, offset: 0x5bf70): ISAR
    <41d>   DW_AT_decl_file   : 2
    <41e>   DW_AT_decl_line   : 465
    <420>   DW_AT_decl_column : 18
    <421>   DW_AT_type        : <0x4a1>
    <425>   DW_AT_data_member_location: 96
 <2><426>: Abbrev Number: 3 (DW_TAG_member)
    <427>   DW_AT_name        : (indirect string, offset: 0xb565f): RESERVED0
    <42b>   DW_AT_decl_file   : 2
    <42c>   DW_AT_decl_line   : 466
    <42e>   DW_AT_decl_column : 18
    <42f>   DW_AT_type        : <0x4a6>
    <433>   DW_AT_data_member_location: 116
 <2><434>: Abbrev Number: 3 (DW_TAG_member)
    <435>   DW_AT_name        : (indirect string, offset: 0x4e8d0): CPACR
    <439>   DW_AT_decl_file   : 2
    <43a>   DW_AT_decl_line   : 467
    <43c>   DW_AT_decl_column : 18
    <43d>   DW_AT_type        : <0x2fd>
    <441>   DW_AT_data_member_location: 136
 <2><442>: Abbrev Number: 0
 <1><443>: Abbrev Number: 9 (DW_TAG_array_type)
    <444>   DW_AT_type        : <0x2db>
    <448>   DW_AT_sibling     : <0x453>
 <2><44c>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <44d>   DW_AT_type        : <0x2c8>
    <451>   DW_AT_upper_bound : 11
 <2><452>: Abbrev Number: 0
 <1><453>: Abbrev Number: 21 (DW_TAG_volatile_type)
    <454>   DW_AT_type        : <0x443>
 <1><458>: Abbrev Number: 9 (DW_TAG_array_type)
    <459>   DW_AT_type        : <0x302>
    <45d>   DW_AT_sibling     : <0x468>
 <2><461>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <462>   DW_AT_type        : <0x2c8>
    <466>   DW_AT_upper_bound : 1
 <2><467>: Abbrev Number: 0
 <1><468>: Abbrev Number: 22 (DW_TAG_const_type)
    <469>   DW_AT_type        : <0x458>
 <1><46d>: Abbrev Number: 21 (DW_TAG_volatile_type)
    <46e>   DW_AT_type        : <0x468>
 <1><472>: Abbrev Number: 9 (DW_TAG_array_type)
    <473>   DW_AT_type        : <0x302>
    <477>   DW_AT_sibling     : <0x482>
 <2><47b>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <47c>   DW_AT_type        : <0x2c8>
    <480>   DW_AT_upper_bound : 3
 <2><481>: Abbrev Number: 0
 <1><482>: Abbrev Number: 22 (DW_TAG_const_type)
    <483>   DW_AT_type        : <0x472>
 <1><487>: Abbrev Number: 21 (DW_TAG_volatile_type)
    <488>   DW_AT_type        : <0x482>
 <1><48c>: Abbrev Number: 9 (DW_TAG_array_type)
    <48d>   DW_AT_type        : <0x302>
    <491>   DW_AT_sibling     : <0x49c>
 <2><495>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <496>   DW_AT_type        : <0x2c8>
    <49a>   DW_AT_upper_bound : 4
 <2><49b>: Abbrev Number: 0
 <1><49c>: Abbrev Number: 22 (DW_TAG_const_type)
    <49d>   DW_AT_type        : <0x48c>
 <1><4a1>: Abbrev Number: 21 (DW_TAG_volatile_type)
    <4a2>   DW_AT_type        : <0x49c>
 <1><4a6>: Abbrev Number: 9 (DW_TAG_array_type)
    <4a7>   DW_AT_type        : <0x2f1>
    <4ab>   DW_AT_sibling     : <0x4b6>
 <2><4af>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <4b0>   DW_AT_type        : <0x2c8>
    <4b4>   DW_AT_upper_bound : 4
 <2><4b5>: Abbrev Number: 0
 <1><4b6>: Abbrev Number: 25 (DW_TAG_typedef)
    <4b7>   DW_AT_name        : (indirect string, offset: 0x8d4cf): SCB_Type
    <4bb>   DW_AT_decl_file   : 2
    <4bc>   DW_AT_decl_line   : 468
    <4be>   DW_AT_decl_column : 3
    <4bf>   DW_AT_type        : <0x313>
 <1><4c3>: Abbrev Number: 9 (DW_TAG_array_type)
    <4c4>   DW_AT_type        : <0x2f1>
    <4c8>   DW_AT_sibling     : <0x4d3>
 <2><4cc>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <4cd>   DW_AT_type        : <0x2c8>
    <4d1>   DW_AT_upper_bound : 1
 <2><4d2>: Abbrev Number: 0
 <1><4d3>: Abbrev Number: 9 (DW_TAG_array_type)
    <4d4>   DW_AT_type        : <0x2f1>
    <4d8>   DW_AT_sibling     : <0x4e3>
 <2><4dc>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <4dd>   DW_AT_type        : <0x2c8>
    <4e1>   DW_AT_upper_bound : 7
 <2><4e2>: Abbrev Number: 0
 <1><4e3>: Abbrev Number: 13 (DW_TAG_structure_type)
    <4e4>   DW_AT_byte_size   : 16
    <4e5>   DW_AT_decl_file   : 4
    <4e6>   DW_AT_decl_line   : 215
    <4e7>   DW_AT_decl_column : 9
    <4e7>   DW_AT_sibling     : <0x520>
 <2><4eb>: Abbrev Number: 11 (DW_TAG_member)
    <4ec>   DW_AT_name        : TIR
    <4f0>   DW_AT_decl_file   : 4
    <4f1>   DW_AT_decl_line   : 217
    <4f2>   DW_AT_decl_column : 17
    <4f3>   DW_AT_type        : <0x2fd>
    <4f7>   DW_AT_data_member_location: 0
 <2><4f8>: Abbrev Number: 2 (DW_TAG_member)
    <4f9>   DW_AT_name        : (indirect string, offset: 0x5d30b): TDTR
    <4fd>   DW_AT_decl_file   : 4
    <4fe>   DW_AT_decl_line   : 218
    <4ff>   DW_AT_decl_column : 17
    <500>   DW_AT_type        : <0x2fd>
    <504>   DW_AT_data_member_location: 4
 <2><505>: Abbrev Number: 2 (DW_TAG_member)
    <506>   DW_AT_name        : (indirect string, offset: 0x59e2b): TDLR
    <50a>   DW_AT_decl_file   : 4
    <50b>   DW_AT_decl_line   : 219
    <50c>   DW_AT_decl_column : 17
    <50d>   DW_AT_type        : <0x2fd>
    <511>   DW_AT_data_member_location: 8
 <2><512>: Abbrev Number: 2 (DW_TAG_member)
    <513>   DW_AT_name        : (indirect string, offset: 0x58136): TDHR
    <517>   DW_AT_decl_file   : 4
    <518>   DW_AT_decl_line   : 220
    <519>   DW_AT_decl_column : 17
    <51a>   DW_AT_type        : <0x2fd>
    <51e>   DW_AT_data_member_location: 12
 <2><51f>: Abbrev Number: 0
 <1><520>: Abbrev Number: 4 (DW_TAG_typedef)
    <521>   DW_AT_name        : (indirect string, offset: 0x72d3c): CAN_TxMailBox_TypeDef
    <525>   DW_AT_decl_file   : 4
    <526>   DW_AT_decl_line   : 221
    <527>   DW_AT_decl_column : 3
    <528>   DW_AT_type        : <0x4e3>
 <1><52c>: Abbrev Number: 13 (DW_TAG_structure_type)
    <52d>   DW_AT_byte_size   : 16
    <52e>   DW_AT_decl_file   : 4
    <52f>   DW_AT_decl_line   : 227
    <530>   DW_AT_decl_column : 9
    <530>   DW_AT_sibling     : <0x569>
 <2><534>: Abbrev Number: 11 (DW_TAG_member)
    <535>   DW_AT_name        : RIR
    <539>   DW_AT_decl_file   : 4
    <53a>   DW_AT_decl_line   : 229
    <53b>   DW_AT_decl_column : 17
    <53c>   DW_AT_type        : <0x2fd>
    <540>   DW_AT_data_member_location: 0
 <2><541>: Abbrev Number: 2 (DW_TAG_member)
    <542>   DW_AT_name        : (indirect string, offset: 0x15a4d): RDTR
    <546>   DW_AT_decl_file   : 4
    <547>   DW_AT_decl_line   : 230
    <548>   DW_AT_decl_column : 17
    <549>   DW_AT_type        : <0x2fd>
    <54d>   DW_AT_data_member_location: 4
 <2><54e>: Abbrev Number: 2 (DW_TAG_member)
    <54f>   DW_AT_name        : (indirect string, offset: 0x12c9f): RDLR
    <553>   DW_AT_decl_file   : 4
    <554>   DW_AT_decl_line   : 231
    <555>   DW_AT_decl_column : 17
    <556>   DW_AT_type        : <0x2fd>
    <55a>   DW_AT_data_member_location: 8
 <2><55b>: Abbrev Number: 2 (DW_TAG_member)
    <55c>   DW_AT_name        : (indirect string, offset: 0x11249): RDHR
    <560>   DW_AT_decl_file   : 4
    <561>   DW_AT_decl_line   : 232
    <562>   DW_AT_decl_column : 17
    <563>   DW_AT_type        : <0x2fd>
    <567>   DW_AT_data_member_location: 12
 <2><568>: Abbrev Number: 0
 <1><569>: Abbrev Number: 4 (DW_TAG_typedef)
    <56a>   DW_AT_name        : (indirect string, offset: 0x29c8f): CAN_FIFOMailBox_TypeDef
    <56e>   DW_AT_decl_file   : 4
    <56f>   DW_AT_decl_line   : 233
    <570>   DW_AT_decl_column : 3
    <571>   DW_AT_type        : <0x52c>
 <1><575>: Abbrev Number: 13 (DW_TAG_structure_type)
    <576>   DW_AT_byte_size   : 8
    <577>   DW_AT_decl_file   : 4
    <578>   DW_AT_decl_line   : 239
    <579>   DW_AT_decl_column : 9
    <579>   DW_AT_sibling     : <0x598>
 <2><57d>: Abbrev Number: 11 (DW_TAG_member)
    <57e>   DW_AT_name        : FR1
    <582>   DW_AT_decl_file   : 4
    <583>   DW_AT_decl_line   : 241
    <584>   DW_AT_decl_column : 17
    <585>   DW_AT_type        : <0x2fd>
    <589>   DW_AT_data_member_location: 0
 <2><58a>: Abbrev Number: 11 (DW_TAG_member)
    <58b>   DW_AT_name        : FR2
    <58f>   DW_AT_decl_file   : 4
    <590>   DW_AT_decl_line   : 242
    <591>   DW_AT_decl_column : 17
    <592>   DW_AT_type        : <0x2fd>
    <596>   DW_AT_data_member_location: 4
 <2><597>: Abbrev Number: 0
 <1><598>: Abbrev Number: 4 (DW_TAG_typedef)
    <599>   DW_AT_name        : (indirect string, offset: 0x960a4): CAN_FilterRegister_TypeDef
    <59d>   DW_AT_decl_file   : 4
    <59e>   DW_AT_decl_line   : 243
    <59f>   DW_AT_decl_column : 3
    <5a0>   DW_AT_type        : <0x575>
 <1><5a4>: Abbrev Number: 39 (DW_TAG_structure_type)
    <5a5>   DW_AT_byte_size   : 800
    <5a7>   DW_AT_decl_file   : 4
    <5a8>   DW_AT_decl_line   : 249
    <5a9>   DW_AT_decl_column : 9
    <5aa>   DW_AT_sibling     : <0x6d3>
 <2><5ae>: Abbrev Number: 11 (DW_TAG_member)
    <5af>   DW_AT_name        : MCR
    <5b3>   DW_AT_decl_file   : 4
    <5b4>   DW_AT_decl_line   : 251
    <5b5>   DW_AT_decl_column : 30
    <5b6>   DW_AT_type        : <0x2fd>
    <5ba>   DW_AT_data_member_location: 0
 <2><5bb>: Abbrev Number: 11 (DW_TAG_member)
    <5bc>   DW_AT_name        : MSR
    <5c0>   DW_AT_decl_file   : 4
    <5c1>   DW_AT_decl_line   : 252
    <5c2>   DW_AT_decl_column : 30
    <5c3>   DW_AT_type        : <0x2fd>
    <5c7>   DW_AT_data_member_location: 4
 <2><5c8>: Abbrev Number: 11 (DW_TAG_member)
    <5c9>   DW_AT_name        : TSR
    <5cd>   DW_AT_decl_file   : 4
    <5ce>   DW_AT_decl_line   : 253
    <5cf>   DW_AT_decl_column : 30
    <5d0>   DW_AT_type        : <0x2fd>
    <5d4>   DW_AT_data_member_location: 8
 <2><5d5>: Abbrev Number: 2 (DW_TAG_member)
    <5d6>   DW_AT_name        : (indirect string, offset: 0x3d793): RF0R
    <5da>   DW_AT_decl_file   : 4
    <5db>   DW_AT_decl_line   : 254
    <5dc>   DW_AT_decl_column : 30
    <5dd>   DW_AT_type        : <0x2fd>
    <5e1>   DW_AT_data_member_location: 12
 <2><5e2>: Abbrev Number: 2 (DW_TAG_member)
    <5e3>   DW_AT_name        : (indirect string, offset: 0x3dd49): RF1R
    <5e7>   DW_AT_decl_file   : 4
    <5e8>   DW_AT_decl_line   : 255
    <5e9>   DW_AT_decl_column : 30
    <5ea>   DW_AT_type        : <0x2fd>
    <5ee>   DW_AT_data_member_location: 16
 <2><5ef>: Abbrev Number: 8 (DW_TAG_member)
    <5f0>   DW_AT_name        : IER
    <5f4>   DW_AT_decl_file   : 4
    <5f5>   DW_AT_decl_line   : 256
    <5f7>   DW_AT_decl_column : 30
    <5f8>   DW_AT_type        : <0x2fd>
    <5fc>   DW_AT_data_member_location: 20
 <2><5fd>: Abbrev Number: 8 (DW_TAG_member)
    <5fe>   DW_AT_name        : ESR
    <602>   DW_AT_decl_file   : 4
    <603>   DW_AT_decl_line   : 257
    <605>   DW_AT_decl_column : 30
    <606>   DW_AT_type        : <0x2fd>
    <60a>   DW_AT_data_member_location: 24
 <2><60b>: Abbrev Number: 8 (DW_TAG_member)
    <60c>   DW_AT_name        : BTR
    <610>   DW_AT_decl_file   : 4
    <611>   DW_AT_decl_line   : 258
    <613>   DW_AT_decl_column : 30
    <614>   DW_AT_type        : <0x2fd>
    <618>   DW_AT_data_member_location: 28
 <2><619>: Abbrev Number: 3 (DW_TAG_member)
    <61a>   DW_AT_name        : (indirect string, offset: 0xb565f): RESERVED0
    <61e>   DW_AT_decl_file   : 4
    <61f>   DW_AT_decl_line   : 259
    <621>   DW_AT_decl_column : 30
    <622>   DW_AT_type        : <0x6d3>
    <626>   DW_AT_data_member_location: 32
 <2><627>: Abbrev Number: 14 (DW_TAG_member)
    <628>   DW_AT_name        : (indirect string, offset: 0x45965): sTxMailBox
    <62c>   DW_AT_decl_file   : 4
    <62c>   DW_AT_decl_line   : 260
    <62e>   DW_AT_decl_column : 30
    <62e>   DW_AT_type        : <0x6e3>
    <632>   DW_AT_data_member_location: 384
 <2><634>: Abbrev Number: 14 (DW_TAG_member)
    <635>   DW_AT_name        : (indirect string, offset: 0x2a0fc): sFIFOMailBox
    <639>   DW_AT_decl_file   : 4
    <639>   DW_AT_decl_line   : 261
    <63b>   DW_AT_decl_column : 30
    <63b>   DW_AT_type        : <0x6f3>
    <63f>   DW_AT_data_member_location: 432
 <2><641>: Abbrev Number: 14 (DW_TAG_member)
    <642>   DW_AT_name        : (indirect string, offset: 0xb5669): RESERVED1
    <646>   DW_AT_decl_file   : 4
    <646>   DW_AT_decl_line   : 262
    <648>   DW_AT_decl_column : 30
    <648>   DW_AT_type        : <0x703>
    <64c>   DW_AT_data_member_location: 464
 <2><64e>: Abbrev Number: 40 (DW_TAG_member)
    <64f>   DW_AT_name        : FMR
    <653>   DW_AT_decl_file   : 4
    <654>   DW_AT_decl_line   : 263
    <656>   DW_AT_decl_column : 30
    <657>   DW_AT_type        : <0x2fd>
    <65b>   DW_AT_data_member_location: 512
 <2><65d>: Abbrev Number: 14 (DW_TAG_member)
    <65e>   DW_AT_name        : (indirect string, offset: 0xd7ff): FM1R
    <662>   DW_AT_decl_file   : 4
    <662>   DW_AT_decl_line   : 264
    <664>   DW_AT_decl_column : 30
    <664>   DW_AT_type        : <0x2fd>
    <668>   DW_AT_data_member_location: 516
 <2><66a>: Abbrev Number: 14 (DW_TAG_member)
    <66b>   DW_AT_name        : (indirect string, offset: 0xb5673): RESERVED2
    <66f>   DW_AT_decl_file   : 4
    <66f>   DW_AT_decl_line   : 265
    <671>   DW_AT_decl_column : 30
    <671>   DW_AT_type        : <0x2f1>
    <675>   DW_AT_data_member_location: 520
 <2><677>: Abbrev Number: 14 (DW_TAG_member)
    <678>   DW_AT_name        : (indirect string, offset: 0xac54f): FS1R
    <67c>   DW_AT_decl_file   : 4
    <67c>   DW_AT_decl_line   : 266
    <67e>   DW_AT_decl_column : 30
    <67e>   DW_AT_type        : <0x2fd>
    <682>   DW_AT_data_member_location: 524
 <2><684>: Abbrev Number: 14 (DW_TAG_member)
    <685>   DW_AT_name        : (indirect string, offset: 0xb567d): RESERVED3
    <689>   DW_AT_decl_file   : 4
    <689>   DW_AT_decl_line   : 267
    <68b>   DW_AT_decl_column : 30
    <68b>   DW_AT_type        : <0x2f1>
    <68f>   DW_AT_data_member_location: 528
 <2><691>: Abbrev Number: 14 (DW_TAG_member)
    <692>   DW_AT_name        : (indirect string, offset: 0x7e503): FFA1R
    <696>   DW_AT_decl_file   : 4
    <696>   DW_AT_decl_line   : 268
    <698>   DW_AT_decl_column : 30
    <698>   DW_AT_type        : <0x2fd>
    <69c>   DW_AT_data_member_location: 532
 <2><69e>: Abbrev Number: 14 (DW_TAG_member)
    <69f>   DW_AT_name        : (indirect string, offset: 0xb5687): RESERVED4
    <6a3>   DW_AT_decl_file   : 4
    <6a3>   DW_AT_decl_line   : 269
    <6a5>   DW_AT_decl_column : 30
    <6a5>   DW_AT_type        : <0x2f1>
    <6a9>   DW_AT_data_member_location: 536
 <2><6ab>: Abbrev Number: 14 (DW_TAG_member)
    <6ac>   DW_AT_name        : (indirect string, offset: 0x7e504): FA1R
    <6b0>   DW_AT_decl_file   : 4
    <6b0>   DW_AT_decl_line   : 270
    <6b2>   DW_AT_decl_column : 30
    <6b2>   DW_AT_type        : <0x2fd>
    <6b6>   DW_AT_data_member_location: 540
 <2><6b8>: Abbrev Number: 14 (DW_TAG_member)
    <6b9>   DW_AT_name        : (indirect string, offset: 0xb5691): RESERVED5
    <6bd>   DW_AT_decl_file   : 4
    <6bd>   DW_AT_decl_line   : 271
    <6bf>   DW_AT_decl_column : 30
    <6bf>   DW_AT_type        : <0x4d3>
    <6c3>   DW_AT_data_member_location: 544
 <2><6c5>: Abbrev Number: 14 (DW_TAG_member)
    <6c6>   DW_AT_name        : (indirect string, offset: 0x70419): sFilterRegister
    <6ca>   DW_AT_decl_file   : 4
    <6ca>   DW_AT_decl_line   : 272
    <6cc>   DW_AT_decl_column : 30
    <6cc>   DW_AT_type        : <0x713>
    <6d0>   DW_AT_data_member_location: 576
 <2><6d2>: Abbrev Number: 0
 <1><6d3>: Abbrev Number: 9 (DW_TAG_array_type)
    <6d4>   DW_AT_type        : <0x2f1>
    <6d8>   DW_AT_sibling     : <0x6e3>
 <2><6dc>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <6dd>   DW_AT_type        : <0x2c8>
    <6e1>   DW_AT_upper_bound : 87
 <2><6e2>: Abbrev Number: 0
 <1><6e3>: Abbrev Number: 9 (DW_TAG_array_type)
    <6e4>   DW_AT_type        : <0x520>
    <6e8>   DW_AT_sibling     : <0x6f3>
 <2><6ec>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <6ed>   DW_AT_type        : <0x2c8>
    <6f1>   DW_AT_upper_bound : 2
 <2><6f2>: Abbrev Number: 0
 <1><6f3>: Abbrev Number: 9 (DW_TAG_array_type)
    <6f4>   DW_AT_type        : <0x569>
    <6f8>   DW_AT_sibling     : <0x703>
 <2><6fc>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <6fd>   DW_AT_type        : <0x2c8>
    <701>   DW_AT_upper_bound : 1
 <2><702>: Abbrev Number: 0
 <1><703>: Abbrev Number: 9 (DW_TAG_array_type)
    <704>   DW_AT_type        : <0x2f1>
    <708>   DW_AT_sibling     : <0x713>
 <2><70c>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <70d>   DW_AT_type        : <0x2c8>
    <711>   DW_AT_upper_bound : 11
 <2><712>: Abbrev Number: 0
 <1><713>: Abbrev Number: 9 (DW_TAG_array_type)
    <714>   DW_AT_type        : <0x598>
    <718>   DW_AT_sibling     : <0x723>
 <2><71c>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <71d>   DW_AT_type        : <0x2c8>
    <721>   DW_AT_upper_bound : 27
 <2><722>: Abbrev Number: 0
 <1><723>: Abbrev Number: 25 (DW_TAG_typedef)
    <724>   DW_AT_name        : (indirect string, offset: 0xab87c): CAN_TypeDef
    <728>   DW_AT_decl_file   : 4
    <729>   DW_AT_decl_line   : 273
    <72b>   DW_AT_decl_column : 3
    <72c>   DW_AT_type        : <0x5a4>
 <1><730>: Abbrev Number: 28 (DW_TAG_structure_type)
    <731>   DW_AT_byte_size   : 40
    <732>   DW_AT_decl_file   : 4
    <733>   DW_AT_decl_line   : 526
    <735>   DW_AT_decl_column : 9
    <735>   DW_AT_sibling     : <0x7b8>
 <2><739>: Abbrev Number: 3 (DW_TAG_member)
    <73a>   DW_AT_name        : (indirect string, offset: 0x7cbee): MODER
    <73e>   DW_AT_decl_file   : 4
    <73f>   DW_AT_decl_line   : 528
    <741>   DW_AT_decl_column : 17
    <742>   DW_AT_type        : <0x2fd>
    <746>   DW_AT_data_member_location: 0
 <2><747>: Abbrev Number: 3 (DW_TAG_member)
    <748>   DW_AT_name        : (indirect string, offset: 0x9488a): OTYPER
    <74c>   DW_AT_decl_file   : 4
    <74d>   DW_AT_decl_line   : 529
    <74f>   DW_AT_decl_column : 17
    <750>   DW_AT_type        : <0x2fd>
    <754>   DW_AT_data_member_location: 4
 <2><755>: Abbrev Number: 3 (DW_TAG_member)
    <756>   DW_AT_name        : (indirect string, offset: 0xa71b7): OSPEEDR
    <75a>   DW_AT_decl_file   : 4
    <75b>   DW_AT_decl_line   : 530
    <75d>   DW_AT_decl_column : 17
    <75e>   DW_AT_type        : <0x2fd>
    <762>   DW_AT_data_member_location: 8
 <2><763>: Abbrev Number: 3 (DW_TAG_member)
    <764>   DW_AT_name        : (indirect string, offset: 0x6f38e): PUPDR
    <768>   DW_AT_decl_file   : 4
    <769>   DW_AT_decl_line   : 531
    <76b>   DW_AT_decl_column : 17
    <76c>   DW_AT_type        : <0x2fd>
    <770>   DW_AT_data_member_location: 12
 <2><771>: Abbrev Number: 8 (DW_TAG_member)
    <772>   DW_AT_name        : IDR
    <776>   DW_AT_decl_file   : 4
    <777>   DW_AT_decl_line   : 532
    <779>   DW_AT_decl_column : 17
    <77a>   DW_AT_type        : <0x2fd>
    <77e>   DW_AT_data_member_location: 16
 <2><77f>: Abbrev Number: 8 (DW_TAG_member)
    <780>   DW_AT_name        : ODR
    <784>   DW_AT_decl_file   : 4
    <785>   DW_AT_decl_line   : 533
    <787>   DW_AT_decl_column : 17
    <788>   DW_AT_type        : <0x2fd>
    <78c>   DW_AT_data_member_location: 20
 <2><78d>: Abbrev Number: 3 (DW_TAG_member)
    <78e>   DW_AT_name        : (indirect string, offset: 0x2bf7f): BSRR
    <792>   DW_AT_decl_file   : 4
    <793>   DW_AT_decl_line   : 534
    <795>   DW_AT_decl_column : 17
    <796>   DW_AT_type        : <0x2fd>
    <79a>   DW_AT_data_member_location: 24
 <2><79b>: Abbrev Number: 3 (DW_TAG_member)
    <79c>   DW_AT_name        : (indirect string, offset: 0xa4a8b): LCKR
    <7a0>   DW_AT_decl_file   : 4
    <7a1>   DW_AT_decl_line   : 535
    <7a3>   DW_AT_decl_column : 17
    <7a4>   DW_AT_type        : <0x2fd>
    <7a8>   DW_AT_data_member_location: 28
 <2><7a9>: Abbrev Number: 8 (DW_TAG_member)
    <7aa>   DW_AT_name        : AFR
    <7ae>   DW_AT_decl_file   : 4
    <7af>   DW_AT_decl_line   : 536
    <7b1>   DW_AT_decl_column : 17
    <7b2>   DW_AT_type        : <0x7c8>
    <7b6>   DW_AT_data_member_location: 32
 <2><7b7>: Abbrev Number: 0
 <1><7b8>: Abbrev Number: 9 (DW_TAG_array_type)
    <7b9>   DW_AT_type        : <0x2fd>
    <7bd>   DW_AT_sibling     : <0x7c8>
 <2><7c1>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <7c2>   DW_AT_type        : <0x2c8>
    <7c6>   DW_AT_upper_bound : 1
 <2><7c7>: Abbrev Number: 0
 <1><7c8>: Abbrev Number: 21 (DW_TAG_volatile_type)
    <7c9>   DW_AT_type        : <0x7b8>
 <1><7cd>: Abbrev Number: 25 (DW_TAG_typedef)
    <7ce>   DW_AT_name        : (indirect string, offset: 0xbab34): GPIO_TypeDef
    <7d2>   DW_AT_decl_file   : 4
    <7d3>   DW_AT_decl_line   : 537
    <7d5>   DW_AT_decl_column : 3
    <7d6>   DW_AT_type        : <0x730>
 <1><7da>: Abbrev Number: 28 (DW_TAG_structure_type)
    <7db>   DW_AT_byte_size   : 8
    <7dc>   DW_AT_decl_file   : 4
    <7dd>   DW_AT_decl_line   : 586
    <7df>   DW_AT_decl_column : 9
    <7df>   DW_AT_sibling     : <0x7ff>
 <2><7e3>: Abbrev Number: 8 (DW_TAG_member)
    <7e4>   DW_AT_name        : CR
    <7e7>   DW_AT_decl_file   : 4
    <7e8>   DW_AT_decl_line   : 588
    <7ea>   DW_AT_decl_column : 17
    <7eb>   DW_AT_type        : <0x2fd>
    <7ef>   DW_AT_data_member_location: 0
 <2><7f0>: Abbrev Number: 8 (DW_TAG_member)
    <7f1>   DW_AT_name        : CSR
    <7f5>   DW_AT_decl_file   : 4
    <7f6>   DW_AT_decl_line   : 589
    <7f8>   DW_AT_decl_column : 17
    <7f9>   DW_AT_type        : <0x2fd>
    <7fd>   DW_AT_data_member_location: 4
 <2><7fe>: Abbrev Number: 0
 <1><7ff>: Abbrev Number: 25 (DW_TAG_typedef)
    <800>   DW_AT_name        : (indirect string, offset: 0x8aa2f): PWR_TypeDef
    <804>   DW_AT_decl_file   : 4
    <805>   DW_AT_decl_line   : 590
    <807>   DW_AT_decl_column : 3
    <808>   DW_AT_type        : <0x7da>
 <1><80c>: Abbrev Number: 28 (DW_TAG_structure_type)
    <80d>   DW_AT_byte_size   : 136
    <80e>   DW_AT_decl_file   : 4
    <80f>   DW_AT_decl_line   : 596
    <811>   DW_AT_decl_column : 9
    <811>   DW_AT_sibling     : <0x9b9>
 <2><815>: Abbrev Number: 8 (DW_TAG_member)
    <816>   DW_AT_name        : CR
    <819>   DW_AT_decl_file   : 4
    <81a>   DW_AT_decl_line   : 598
    <81c>   DW_AT_decl_column : 17
    <81d>   DW_AT_type        : <0x2fd>
    <821>   DW_AT_data_member_location: 0
 <2><822>: Abbrev Number: 3 (DW_TAG_member)
    <823>   DW_AT_name        : (indirect string, offset: 0x86453): PLLCFGR
    <827>   DW_AT_decl_file   : 4
    <828>   DW_AT_decl_line   : 599
    <82a>   DW_AT_decl_column : 17
    <82b>   DW_AT_type        : <0x2fd>
    <82f>   DW_AT_data_member_location: 4
 <2><830>: Abbrev Number: 3 (DW_TAG_member)
    <831>   DW_AT_name        : (indirect string, offset: 0x86456): CFGR
    <835>   DW_AT_decl_file   : 4
    <836>   DW_AT_decl_line   : 600
    <838>   DW_AT_decl_column : 17
    <839>   DW_AT_type        : <0x2fd>
    <83d>   DW_AT_data_member_location: 8
 <2><83e>: Abbrev Number: 8 (DW_TAG_member)
    <83f>   DW_AT_name        : CIR
    <843>   DW_AT_decl_file   : 4
    <844>   DW_AT_decl_line   : 601
    <846>   DW_AT_decl_column : 17
    <847>   DW_AT_type        : <0x2fd>
    <84b>   DW_AT_data_member_location: 12
 <2><84c>: Abbrev Number: 3 (DW_TAG_member)
    <84d>   DW_AT_name        : (indirect string, offset: 0x98d95): AHB1RSTR
    <851>   DW_AT_decl_file   : 4
    <852>   DW_AT_decl_line   : 602
    <854>   DW_AT_decl_column : 17
    <855>   DW_AT_type        : <0x2fd>
    <859>   DW_AT_data_member_location: 16
 <2><85a>: Abbrev Number: 3 (DW_TAG_member)
    <85b>   DW_AT_name        : (indirect string, offset: 0x15ba0): AHB2RSTR
    <85f>   DW_AT_decl_file   : 4
    <860>   DW_AT_decl_line   : 603
    <862>   DW_AT_decl_column : 17
    <863>   DW_AT_type        : <0x2fd>
    <867>   DW_AT_data_member_location: 20
 <2><868>: Abbrev Number: 3 (DW_TAG_member)
    <869>   DW_AT_name        : (indirect string, offset: 0x3f95c): AHB3RSTR
    <86d>   DW_AT_decl_file   : 4
    <86e>   DW_AT_decl_line   : 604
    <870>   DW_AT_decl_column : 17
    <871>   DW_AT_type        : <0x2fd>
    <875>   DW_AT_data_member_location: 24
 <2><876>: Abbrev Number: 3 (DW_TAG_member)
    <877>   DW_AT_name        : (indirect string, offset: 0xb565f): RESERVED0
    <87b>   DW_AT_decl_file   : 4
    <87c>   DW_AT_decl_line   : 605
    <87e>   DW_AT_decl_column : 17
    <87f>   DW_AT_type        : <0x2f1>
    <883>   DW_AT_data_member_location: 28
 <2><884>: Abbrev Number: 3 (DW_TAG_member)
    <885>   DW_AT_name        : (indirect string, offset: 0x15728): APB1RSTR
    <889>   DW_AT_decl_file   : 4
    <88a>   DW_AT_decl_line   : 606
    <88c>   DW_AT_decl_column : 17
    <88d>   DW_AT_type        : <0x2fd>
    <891>   DW_AT_data_member_location: 32
 <2><892>: Abbrev Number: 3 (DW_TAG_member)
    <893>   DW_AT_name        : (indirect string, offset: 0x535ae): APB2RSTR
    <897>   DW_AT_decl_file   : 4
    <898>   DW_AT_decl_line   : 607
    <89a>   DW_AT_decl_column : 17
    <89b>   DW_AT_type        : <0x2fd>
    <89f>   DW_AT_data_member_location: 36
 <2><8a0>: Abbrev Number: 3 (DW_TAG_member)
    <8a1>   DW_AT_name        : (indirect string, offset: 0xb5669): RESERVED1
    <8a5>   DW_AT_decl_file   : 4
    <8a6>   DW_AT_decl_line   : 608
    <8a8>   DW_AT_decl_column : 17
    <8a9>   DW_AT_type        : <0x4c3>
    <8ad>   DW_AT_data_member_location: 40
 <2><8ae>: Abbrev Number: 3 (DW_TAG_member)
    <8af>   DW_AT_name        : (indirect string, offset: 0xf67e): AHB1ENR
    <8b3>   DW_AT_decl_file   : 4
    <8b4>   DW_AT_decl_line   : 609
    <8b6>   DW_AT_decl_column : 17
    <8b7>   DW_AT_type        : <0x2fd>
    <8bb>   DW_AT_data_member_location: 48
 <2><8bc>: Abbrev Number: 3 (DW_TAG_member)
    <8bd>   DW_AT_name        : (indirect string, offset: 0x33b92): AHB2ENR
    <8c1>   DW_AT_decl_file   : 4
    <8c2>   DW_AT_decl_line   : 610
    <8c4>   DW_AT_decl_column : 17
    <8c5>   DW_AT_type        : <0x2fd>
    <8c9>   DW_AT_data_member_location: 52
 <2><8ca>: Abbrev Number: 3 (DW_TAG_member)
    <8cb>   DW_AT_name        : (indirect string, offset: 0x56280): AHB3ENR
    <8cf>   DW_AT_decl_file   : 4
    <8d0>   DW_AT_decl_line   : 611
    <8d2>   DW_AT_decl_column : 17
    <8d3>   DW_AT_type        : <0x2fd>
    <8d7>   DW_AT_data_member_location: 56
 <2><8d8>: Abbrev Number: 3 (DW_TAG_member)
    <8d9>   DW_AT_name        : (indirect string, offset: 0xb5673): RESERVED2
    <8dd>   DW_AT_decl_file   : 4
    <8de>   DW_AT_decl_line   : 612
    <8e0>   DW_AT_decl_column : 17
    <8e1>   DW_AT_type        : <0x2f1>
    <8e5>   DW_AT_data_member_location: 60
 <2><8e6>: Abbrev Number: 3 (DW_TAG_member)
    <8e7>   DW_AT_name        : (indirect string, offset: 0x6e4a4): APB1ENR
    <8eb>   DW_AT_decl_file   : 4
    <8ec>   DW_AT_decl_line   : 613
    <8ee>   DW_AT_decl_column : 17
    <8ef>   DW_AT_type        : <0x2fd>
    <8f3>   DW_AT_data_member_location: 64
 <2><8f4>: Abbrev Number: 3 (DW_TAG_member)
    <8f5>   DW_AT_name        : (indirect string, offset: 0x16d44): APB2ENR
    <8f9>   DW_AT_decl_file   : 4
    <8fa>   DW_AT_decl_line   : 614
    <8fc>   DW_AT_decl_column : 17
    <8fd>   DW_AT_type        : <0x2fd>
    <901>   DW_AT_data_member_location: 68
 <2><902>: Abbrev Number: 3 (DW_TAG_member)
    <903>   DW_AT_name        : (indirect string, offset: 0xb567d): RESERVED3
    <907>   DW_AT_decl_file   : 4
    <908>   DW_AT_decl_line   : 615
    <90a>   DW_AT_decl_column : 17
    <90b>   DW_AT_type        : <0x4c3>
    <90f>   DW_AT_data_member_location: 72
 <2><910>: Abbrev Number: 3 (DW_TAG_member)
    <911>   DW_AT_name        : (indirect string, offset: 0x9c7f5): AHB1LPENR
    <915>   DW_AT_decl_file   : 4
    <916>   DW_AT_decl_line   : 616
    <918>   DW_AT_decl_column : 17
    <919>   DW_AT_type        : <0x2fd>
    <91d>   DW_AT_data_member_location: 80
 <2><91e>: Abbrev Number: 3 (DW_TAG_member)
    <91f>   DW_AT_name        : (indirect string, offset: 0x2bbd8): AHB2LPENR
    <923>   DW_AT_decl_file   : 4
    <924>   DW_AT_decl_line   : 617
    <926>   DW_AT_decl_column : 17
    <927>   DW_AT_type        : <0x2fd>
    <92b>   DW_AT_data_member_location: 84
 <2><92c>: Abbrev Number: 3 (DW_TAG_member)
    <92d>   DW_AT_name        : (indirect string, offset: 0x81a21): AHB3LPENR
    <931>   DW_AT_decl_file   : 4
    <932>   DW_AT_decl_line   : 618
    <934>   DW_AT_decl_column : 17
    <935>   DW_AT_type        : <0x2fd>
    <939>   DW_AT_data_member_location: 88
 <2><93a>: Abbrev Number: 3 (DW_TAG_member)
    <93b>   DW_AT_name        : (indirect string, offset: 0xb5687): RESERVED4
    <93f>   DW_AT_decl_file   : 4
    <940>   DW_AT_decl_line   : 619
    <942>   DW_AT_decl_column : 17
    <943>   DW_AT_type        : <0x2f1>
    <947>   DW_AT_data_member_location: 92
 <2><948>: Abbrev Number: 3 (DW_TAG_member)
    <949>   DW_AT_name        : (indirect string, offset: 0xa1224): APB1LPENR
    <94d>   DW_AT_decl_file   : 4
    <94e>   DW_AT_decl_line   : 620
    <950>   DW_AT_decl_column : 17
    <951>   DW_AT_type        : <0x2fd>
    <955>   DW_AT_data_member_location: 96
 <2><956>: Abbrev Number: 3 (DW_TAG_member)
    <957>   DW_AT_name        : (indirect string, offset: 0x316c7): APB2LPENR
    <95b>   DW_AT_decl_file   : 4
    <95c>   DW_AT_decl_line   : 621
    <95e>   DW_AT_decl_column : 17
    <95f>   DW_AT_type        : <0x2fd>
    <963>   DW_AT_data_member_location: 100
 <2><964>: Abbrev Number: 3 (DW_TAG_member)
    <965>   DW_AT_name        : (indirect string, offset: 0xb5691): RESERVED5
    <969>   DW_AT_decl_file   : 4
    <96a>   DW_AT_decl_line   : 622
    <96c>   DW_AT_decl_column : 17
    <96d>   DW_AT_type        : <0x4c3>
    <971>   DW_AT_data_member_location: 104
 <2><972>: Abbrev Number: 3 (DW_TAG_member)
    <973>   DW_AT_name        : (indirect string, offset: 0x1af81): BDCR
    <977>   DW_AT_decl_file   : 4
    <978>   DW_AT_decl_line   : 623
    <97a>   DW_AT_decl_column : 17
    <97b>   DW_AT_type        : <0x2fd>
    <97f>   DW_AT_data_member_location: 112
 <2><980>: Abbrev Number: 8 (DW_TAG_member)
    <981>   DW_AT_name        : CSR
    <985>   DW_AT_decl_file   : 4
    <986>   DW_AT_decl_line   : 624
    <988>   DW_AT_decl_column : 17
    <989>   DW_AT_type        : <0x2fd>
    <98d>   DW_AT_data_member_location: 116
 <2><98e>: Abbrev Number: 3 (DW_TAG_member)
    <98f>   DW_AT_name        : (indirect string, offset: 0x72aa8): RESERVED6
    <993>   DW_AT_decl_file   : 4
    <994>   DW_AT_decl_line   : 625
    <996>   DW_AT_decl_column : 17
    <997>   DW_AT_type        : <0x4c3>
    <99b>   DW_AT_data_member_location: 120
 <2><99c>: Abbrev Number: 3 (DW_TAG_member)
    <99d>   DW_AT_name        : (indirect string, offset: 0x660ff): SSCGR
    <9a1>   DW_AT_decl_file   : 4
    <9a2>   DW_AT_decl_line   : 626
    <9a4>   DW_AT_decl_column : 17
    <9a5>   DW_AT_type        : <0x2fd>
    <9a9>   DW_AT_data_member_location: 128
 <2><9aa>: Abbrev Number: 3 (DW_TAG_member)
    <9ab>   DW_AT_name        : (indirect string, offset: 0x403a0): PLLI2SCFGR
    <9af>   DW_AT_decl_file   : 4
    <9b0>   DW_AT_decl_line   : 627
    <9b2>   DW_AT_decl_column : 17
    <9b3>   DW_AT_type        : <0x2fd>
    <9b7>   DW_AT_data_member_location: 132
 <2><9b8>: Abbrev Number: 0
 <1><9b9>: Abbrev Number: 25 (DW_TAG_typedef)
    <9ba>   DW_AT_name        : (indirect string, offset: 0x59025): RCC_TypeDef
    <9be>   DW_AT_decl_file   : 4
    <9bf>   DW_AT_decl_line   : 628
    <9c1>   DW_AT_decl_column : 3
    <9c2>   DW_AT_type        : <0x80c>
 <1><9c6>: Abbrev Number: 27 (DW_TAG_enumeration_type)
    <9c7>   DW_AT_encoding    : 7	(unsigned)
    <9c8>   DW_AT_byte_size   : 1
    <9c8>   DW_AT_type        : <0x26c>
    <9cc>   DW_AT_decl_file   : 7
    <9cd>   DW_AT_decl_line   : 191
    <9ce>   DW_AT_decl_column : 1
    <9ce>   DW_AT_sibling     : <0x9df>
 <2><9d2>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9d3>   DW_AT_name        : (indirect string, offset: 0x5b169): DISABLE
    <9d7>   DW_AT_const_value : 0
 <2><9d8>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9d9>   DW_AT_name        : (indirect string, offset: 0x66e07): ENABLE
    <9dd>   DW_AT_const_value : 1
 <2><9de>: Abbrev Number: 0
 <1><9df>: Abbrev Number: 4 (DW_TAG_typedef)
    <9e0>   DW_AT_name        : (indirect string, offset: 0xbf606): FunctionalState
    <9e4>   DW_AT_decl_file   : 7
    <9e5>   DW_AT_decl_line   : 194
    <9e6>   DW_AT_decl_column : 3
    <9e7>   DW_AT_type        : <0x9c6>
 <1><9eb>: Abbrev Number: 15 (DW_TAG_base_type)
    <9ec>   DW_AT_byte_size   : 8
    <9ed>   DW_AT_encoding    : 4	(float)
    <9ee>   DW_AT_name        : (indirect string, offset: 0x11873): long double
 <1><9f2>: Abbrev Number: 27 (DW_TAG_enumeration_type)
    <9f3>   DW_AT_encoding    : 7	(unsigned)
    <9f4>   DW_AT_byte_size   : 1
    <9f4>   DW_AT_type        : <0x26c>
    <9f8>   DW_AT_decl_file   : 8
    <9f9>   DW_AT_decl_line   : 39
    <9fa>   DW_AT_decl_column : 1
    <9fa>   DW_AT_sibling     : <0xa17>
 <2><9fe>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9ff>   DW_AT_name        : (indirect string, offset: 0x412fb): HAL_OK
    <a03>   DW_AT_const_value : 0
 <2><a04>: Abbrev Number: 1 (DW_TAG_enumerator)
    <a05>   DW_AT_name        : (indirect string, offset: 0x781c8): HAL_ERROR
    <a09>   DW_AT_const_value : 1
 <2><a0a>: Abbrev Number: 1 (DW_TAG_enumerator)
    <a0b>   DW_AT_name        : (indirect string, offset: 0x223f8): HAL_BUSY
    <a0f>   DW_AT_const_value : 2
 <2><a10>: Abbrev Number: 1 (DW_TAG_enumerator)
    <a11>   DW_AT_name        : (indirect string, offset: 0x38e34): HAL_TIMEOUT
    <a15>   DW_AT_const_value : 3
 <2><a16>: Abbrev Number: 0
 <1><a17>: Abbrev Number: 4 (DW_TAG_typedef)
    <a18>   DW_AT_name        : (indirect string, offset: 0x2115): HAL_StatusTypeDef
    <a1c>   DW_AT_decl_file   : 8
    <a1d>   DW_AT_decl_line   : 44
    <a1e>   DW_AT_decl_column : 3
    <a1f>   DW_AT_type        : <0x9f2>
 <1><a23>: Abbrev Number: 13 (DW_TAG_structure_type)
    <a24>   DW_AT_byte_size   : 24
    <a25>   DW_AT_decl_file   : 9
    <a26>   DW_AT_decl_line   : 45
    <a27>   DW_AT_decl_column : 9
    <a27>   DW_AT_sibling     : <0xa7a>
 <2><a2b>: Abbrev Number: 2 (DW_TAG_member)
    <a2c>   DW_AT_name        : (indirect string, offset: 0x80997): PLLState
    <a30>   DW_AT_decl_file   : 9
    <a31>   DW_AT_decl_line   : 47
    <a32>   DW_AT_decl_column : 12
    <a33>   DW_AT_type        : <0x2f1>
    <a37>   DW_AT_data_member_location: 0
 <2><a38>: Abbrev Number: 2 (DW_TAG_member)
    <a39>   DW_AT_name        : (indirect string, offset: 0x8507c): PLLSource
    <a3d>   DW_AT_decl_file   : 9
    <a3e>   DW_AT_decl_line   : 50
    <a3f>   DW_AT_decl_column : 12
    <a40>   DW_AT_type        : <0x2f1>
    <a44>   DW_AT_data_member_location: 4
 <2><a45>: Abbrev Number: 2 (DW_TAG_member)
    <a46>   DW_AT_name        : (indirect string, offset: 0x9ef15): PLLM
    <a4a>   DW_AT_decl_file   : 9
    <a4b>   DW_AT_decl_line   : 53
    <a4c>   DW_AT_decl_column : 12
    <a4d>   DW_AT_type        : <0x2f1>
    <a51>   DW_AT_data_member_location: 8
 <2><a52>: Abbrev Number: 2 (DW_TAG_member)
    <a53>   DW_AT_name        : (indirect string, offset: 0x9ef1a): PLLN
    <a57>   DW_AT_decl_file   : 9
    <a58>   DW_AT_decl_line   : 56
    <a59>   DW_AT_decl_column : 12
    <a5a>   DW_AT_type        : <0x2f1>
    <a5e>   DW_AT_data_member_location: 12
 <2><a5f>: Abbrev Number: 2 (DW_TAG_member)
    <a60>   DW_AT_name        : (indirect string, offset: 0x9ef37): PLLP
    <a64>   DW_AT_decl_file   : 9
    <a65>   DW_AT_decl_line   : 60
    <a66>   DW_AT_decl_column : 12
    <a67>   DW_AT_type        : <0x2f1>
    <a6b>   DW_AT_data_member_location: 16
 <2><a6c>: Abbrev Number: 2 (DW_TAG_member)
    <a6d>   DW_AT_name        : (indirect string, offset: 0x47cd5): PLLQ
    <a71>   DW_AT_decl_file   : 9
    <a72>   DW_AT_decl_line   : 63
    <a73>   DW_AT_decl_column : 12
    <a74>   DW_AT_type        : <0x2f1>
    <a78>   DW_AT_data_member_location: 20
 <2><a79>: Abbrev Number: 0
 <1><a7a>: Abbrev Number: 4 (DW_TAG_typedef)
    <a7b>   DW_AT_name        : (indirect string, offset: 0x746d0): RCC_PLLInitTypeDef
    <a7f>   DW_AT_decl_file   : 9
    <a80>   DW_AT_decl_line   : 73
    <a81>   DW_AT_decl_column : 3
    <a82>   DW_AT_type        : <0xa23>
 <1><a86>: Abbrev Number: 13 (DW_TAG_structure_type)
    <a87>   DW_AT_byte_size   : 48
    <a88>   DW_AT_decl_file   : 10
    <a89>   DW_AT_decl_line   : 49
    <a8a>   DW_AT_decl_column : 9
    <a8a>   DW_AT_sibling     : <0xaea>
 <2><a8e>: Abbrev Number: 2 (DW_TAG_member)
    <a8f>   DW_AT_name        : (indirect string, offset: 0x9c254): OscillatorType
    <a93>   DW_AT_decl_file   : 10
    <a94>   DW_AT_decl_line   : 51
    <a95>   DW_AT_decl_column : 12
    <a96>   DW_AT_type        : <0x2f1>
    <a9a>   DW_AT_data_member_location: 0
 <2><a9b>: Abbrev Number: 2 (DW_TAG_member)
    <a9c>   DW_AT_name        : (indirect string, offset: 0x820b8): HSEState
    <aa0>   DW_AT_decl_file   : 10
    <aa1>   DW_AT_decl_line   : 54
    <aa2>   DW_AT_decl_column : 12
    <aa3>   DW_AT_type        : <0x2f1>
    <aa7>   DW_AT_data_member_location: 4
 <2><aa8>: Abbrev Number: 2 (DW_TAG_member)
    <aa9>   DW_AT_name        : (indirect string, offset: 0x78b20): LSEState
    <aad>   DW_AT_decl_file   : 10
    <aae>   DW_AT_decl_line   : 57
    <aaf>   DW_AT_decl_column : 12
    <ab0>   DW_AT_type        : <0x2f1>
    <ab4>   DW_AT_data_member_location: 8
 <2><ab5>: Abbrev Number: 2 (DW_TAG_member)
    <ab6>   DW_AT_name        : (indirect string, offset: 0x55a40): HSIState
    <aba>   DW_AT_decl_file   : 10
    <abb>   DW_AT_decl_line   : 60
    <abc>   DW_AT_decl_column : 12
    <abd>   DW_AT_type        : <0x2f1>
    <ac1>   DW_AT_data_member_location: 12
 <2><ac2>: Abbrev Number: 2 (DW_TAG_member)
    <ac3>   DW_AT_name        : (indirect string, offset: 0xa52d4): HSICalibrationValue
    <ac7>   DW_AT_decl_file   : 10
    <ac8>   DW_AT_decl_line   : 63
    <ac9>   DW_AT_decl_column : 12
    <aca>   DW_AT_type        : <0x2f1>
    <ace>   DW_AT_data_member_location: 16
 <2><acf>: Abbrev Number: 2 (DW_TAG_member)
    <ad0>   DW_AT_name        : (indirect string, offset: 0x43a7e): LSIState
    <ad4>   DW_AT_decl_file   : 10
    <ad5>   DW_AT_decl_line   : 66
    <ad6>   DW_AT_decl_column : 12
    <ad7>   DW_AT_type        : <0x2f1>
    <adb>   DW_AT_data_member_location: 20
 <2><adc>: Abbrev Number: 11 (DW_TAG_member)
    <add>   DW_AT_name        : PLL
    <ae1>   DW_AT_decl_file   : 10
    <ae2>   DW_AT_decl_line   : 69
    <ae3>   DW_AT_decl_column : 22
    <ae4>   DW_AT_type        : <0xa7a>
    <ae8>   DW_AT_data_member_location: 24
 <2><ae9>: Abbrev Number: 0
 <1><aea>: Abbrev Number: 4 (DW_TAG_typedef)
    <aeb>   DW_AT_name        : (indirect string, offset: 0x666ca): RCC_OscInitTypeDef
    <aef>   DW_AT_decl_file   : 10
    <af0>   DW_AT_decl_line   : 70
    <af1>   DW_AT_decl_column : 3
    <af2>   DW_AT_type        : <0xa86>
 <1><af6>: Abbrev Number: 13 (DW_TAG_structure_type)
    <af7>   DW_AT_byte_size   : 20
    <af8>   DW_AT_decl_file   : 10
    <af9>   DW_AT_decl_line   : 75
    <afa>   DW_AT_decl_column : 9
    <afa>   DW_AT_sibling     : <0xb40>
 <2><afe>: Abbrev Number: 2 (DW_TAG_member)
    <aff>   DW_AT_name        : (indirect string, offset: 0x3b64a): ClockType
    <b03>   DW_AT_decl_file   : 10
    <b04>   DW_AT_decl_line   : 77
    <b05>   DW_AT_decl_column : 12
    <b06>   DW_AT_type        : <0x2f1>
    <b0a>   DW_AT_data_member_location: 0
 <2><b0b>: Abbrev Number: 2 (DW_TAG_member)
    <b0c>   DW_AT_name        : (indirect string, offset: 0x7413b): SYSCLKSource
    <b10>   DW_AT_decl_file   : 10
    <b11>   DW_AT_decl_line   : 80
    <b12>   DW_AT_decl_column : 12
    <b13>   DW_AT_type        : <0x2f1>
    <b17>   DW_AT_data_member_location: 4
 <2><b18>: Abbrev Number: 2 (DW_TAG_member)
    <b19>   DW_AT_name        : (indirect string, offset: 0x9e95f): AHBCLKDivider
    <b1d>   DW_AT_decl_file   : 10
    <b1e>   DW_AT_decl_line   : 83
    <b1f>   DW_AT_decl_column : 12
    <b20>   DW_AT_type        : <0x2f1>
    <b24>   DW_AT_data_member_location: 8
 <2><b25>: Abbrev Number: 2 (DW_TAG_member)
    <b26>   DW_AT_name        : (indirect string, offset: 0x73fe): APB1CLKDivider
    <b2a>   DW_AT_decl_file   : 10
    <b2b>   DW_AT_decl_line   : 86
    <b2c>   DW_AT_decl_column : 12
    <b2d>   DW_AT_type        : <0x2f1>
    <b31>   DW_AT_data_member_location: 12
 <2><b32>: Abbrev Number: 2 (DW_TAG_member)
    <b33>   DW_AT_name        : (indirect string, offset: 0x58080): APB2CLKDivider
    <b37>   DW_AT_decl_file   : 10
    <b38>   DW_AT_decl_line   : 89
    <b39>   DW_AT_decl_column : 12
    <b3a>   DW_AT_type        : <0x2f1>
    <b3e>   DW_AT_data_member_location: 16
 <2><b3f>: Abbrev Number: 0
 <1><b40>: Abbrev Number: 4 (DW_TAG_typedef)
    <b41>   DW_AT_name        : (indirect string, offset: 0x86440): RCC_ClkInitTypeDef
    <b45>   DW_AT_decl_file   : 10
    <b46>   DW_AT_decl_line   : 92
    <b47>   DW_AT_decl_column : 3
    <b48>   DW_AT_type        : <0xaf6>
 <1><b4c>: Abbrev Number: 13 (DW_TAG_structure_type)
    <b4d>   DW_AT_byte_size   : 20
    <b4e>   DW_AT_decl_file   : 11
    <b4f>   DW_AT_decl_line   : 46
    <b50>   DW_AT_decl_column : 9
    <b50>   DW_AT_sibling     : <0xb96>
 <2><b54>: Abbrev Number: 11 (DW_TAG_member)
    <b55>   DW_AT_name        : Pin
    <b59>   DW_AT_decl_file   : 11
    <b5a>   DW_AT_decl_line   : 48
    <b5b>   DW_AT_decl_column : 12
    <b5c>   DW_AT_type        : <0x2f1>
    <b60>   DW_AT_data_member_location: 0
 <2><b61>: Abbrev Number: 2 (DW_TAG_member)
    <b62>   DW_AT_name        : (indirect string, offset: 0xc27de): Mode
    <b66>   DW_AT_decl_file   : 11
    <b67>   DW_AT_decl_line   : 51
    <b68>   DW_AT_decl_column : 12
    <b69>   DW_AT_type        : <0x2f1>
    <b6d>   DW_AT_data_member_location: 4
 <2><b6e>: Abbrev Number: 2 (DW_TAG_member)
    <b6f>   DW_AT_name        : (indirect string, offset: 0x6323e): Pull
    <b73>   DW_AT_decl_file   : 11
    <b74>   DW_AT_decl_line   : 54
    <b75>   DW_AT_decl_column : 12
    <b76>   DW_AT_type        : <0x2f1>
    <b7a>   DW_AT_data_member_location: 8
 <2><b7b>: Abbrev Number: 2 (DW_TAG_member)
    <b7c>   DW_AT_name        : (indirect string, offset: 0x70ee2): Speed
    <b80>   DW_AT_decl_file   : 11
    <b81>   DW_AT_decl_line   : 57
    <b82>   DW_AT_decl_column : 12
    <b83>   DW_AT_type        : <0x2f1>
    <b87>   DW_AT_data_member_location: 12
 <2><b88>: Abbrev Number: 2 (DW_TAG_member)
    <b89>   DW_AT_name        : (indirect string, offset: 0x58041): Alternate
    <b8d>   DW_AT_decl_file   : 11
    <b8e>   DW_AT_decl_line   : 60
    <b8f>   DW_AT_decl_column : 12
    <b90>   DW_AT_type        : <0x2f1>
    <b94>   DW_AT_data_member_location: 16
 <2><b95>: Abbrev Number: 0
 <1><b96>: Abbrev Number: 4 (DW_TAG_typedef)
    <b97>   DW_AT_name        : (indirect string, offset: 0x964a3): GPIO_InitTypeDef
    <b9b>   DW_AT_decl_file   : 11
    <b9c>   DW_AT_decl_line   : 62
    <b9d>   DW_AT_decl_column : 2
    <b9e>   DW_AT_type        : <0xb4c>
 <1><ba2>: Abbrev Number: 41 (DW_TAG_subroutine_type)
    <ba3>   DW_AT_prototyped  : 1
 <1><ba3>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <ba4>   DW_AT_byte_size   : 4
    <ba4>   DW_AT_type        : <0xba2>
 <1><ba8>: Abbrev Number: 27 (DW_TAG_enumeration_type)
    <ba9>   DW_AT_encoding    : 7	(unsigned)
    <baa>   DW_AT_byte_size   : 1
    <baa>   DW_AT_type        : <0x26c>
    <bae>   DW_AT_decl_file   : 12
    <baf>   DW_AT_decl_line   : 47
    <bb0>   DW_AT_decl_column : 1
    <bb0>   DW_AT_sibling     : <0xbd9>
 <2><bb4>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bb5>   DW_AT_name        : (indirect string, offset: 0x7e5d9): HAL_CAN_STATE_RESET
    <bb9>   DW_AT_const_value : 0
 <2><bba>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bbb>   DW_AT_name        : (indirect string, offset: 0xfebb): HAL_CAN_STATE_READY
    <bbf>   DW_AT_const_value : 1
 <2><bc0>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bc1>   DW_AT_name        : (indirect string, offset: 0x61922): HAL_CAN_STATE_LISTENING
    <bc5>   DW_AT_const_value : 2
 <2><bc6>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bc7>   DW_AT_name        : (indirect string, offset: 0xae554): HAL_CAN_STATE_SLEEP_PENDING
    <bcb>   DW_AT_const_value : 3
 <2><bcc>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bcd>   DW_AT_name        : (indirect string, offset: 0x8d60): HAL_CAN_STATE_SLEEP_ACTIVE
    <bd1>   DW_AT_const_value : 4
 <2><bd2>: Abbrev Number: 1 (DW_TAG_enumerator)
    <bd3>   DW_AT_name        : (indirect string, offset: 0x92c5d): HAL_CAN_STATE_ERROR
    <bd7>   DW_AT_const_value : 5
 <2><bd8>: Abbrev Number: 0
 <1><bd9>: Abbrev Number: 4 (DW_TAG_typedef)
    <bda>   DW_AT_name        : (indirect string, offset: 0x24f47): HAL_CAN_StateTypeDef
    <bde>   DW_AT_decl_file   : 12
    <bdf>   DW_AT_decl_line   : 55
    <be0>   DW_AT_decl_column : 3
    <be1>   DW_AT_type        : <0xba8>
 <1><be5>: Abbrev Number: 21 (DW_TAG_volatile_type)
    <be6>   DW_AT_type        : <0xbd9>
 <1><bea>: Abbrev Number: 13 (DW_TAG_structure_type)
    <beb>   DW_AT_byte_size   : 28
    <bec>   DW_AT_decl_file   : 12
    <bed>   DW_AT_decl_line   : 60
    <bee>   DW_AT_decl_column : 9
    <bee>   DW_AT_sibling     : <0xc82>
 <2><bf2>: Abbrev Number: 2 (DW_TAG_member)
    <bf3>   DW_AT_name        : (indirect string, offset: 0x1f2f4): Prescaler
    <bf7>   DW_AT_decl_file   : 12
    <bf8>   DW_AT_decl_line   : 62
    <bf9>   DW_AT_decl_column : 12
    <bfa>   DW_AT_type        : <0x2f1>
    <bfe>   DW_AT_data_member_location: 0
 <2><bff>: Abbrev Number: 2 (DW_TAG_member)
    <c00>   DW_AT_name        : (indirect string, offset: 0xc27de): Mode
    <c04>   DW_AT_decl_file   : 12
    <c05>   DW_AT_decl_line   : 65
    <c06>   DW_AT_decl_column : 12
    <c07>   DW_AT_type        : <0x2f1>
    <c0b>   DW_AT_data_member_location: 4
 <2><c0c>: Abbrev Number: 2 (DW_TAG_member)
    <c0d>   DW_AT_name        : (indirect string, offset: 0x19b01): SyncJumpWidth
    <c11>   DW_AT_decl_file   : 12
    <c12>   DW_AT_decl_line   : 68
    <c13>   DW_AT_decl_column : 12
    <c14>   DW_AT_type        : <0x2f1>
    <c18>   DW_AT_data_member_location: 8
 <2><c19>: Abbrev Number: 2 (DW_TAG_member)
    <c1a>   DW_AT_name        : (indirect string, offset: 0x54a24): TimeSeg1
    <c1e>   DW_AT_decl_file   : 12
    <c1f>   DW_AT_decl_line   : 72
    <c20>   DW_AT_decl_column : 12
    <c21>   DW_AT_type        : <0x2f1>
    <c25>   DW_AT_data_member_location: 12
 <2><c26>: Abbrev Number: 2 (DW_TAG_member)
    <c27>   DW_AT_name        : (indirect string, offset: 0x54a2d): TimeSeg2
    <c2b>   DW_AT_decl_file   : 12
    <c2c>   DW_AT_decl_line   : 75
    <c2d>   DW_AT_decl_column : 12
    <c2e>   DW_AT_type        : <0x2f1>
    <c32>   DW_AT_data_member_location: 16
 <2><c33>: Abbrev Number: 2 (DW_TAG_member)
    <c34>   DW_AT_name        : (indirect string, offset: 0xff6a): TimeTriggeredMode
    <c38>   DW_AT_decl_file   : 12
    <c39>   DW_AT_decl_line   : 78
    <c3a>   DW_AT_decl_column : 19
    <c3b>   DW_AT_type        : <0x9df>
    <c3f>   DW_AT_data_member_location: 20
 <2><c40>: Abbrev Number: 2 (DW_TAG_member)
    <c41>   DW_AT_name        : (indirect string, offset: 0x817bc): AutoBusOff
    <c45>   DW_AT_decl_file   : 12
    <c46>   DW_AT_decl_line   : 81
    <c47>   DW_AT_decl_column : 19
    <c48>   DW_AT_type        : <0x9df>
    <c4c>   DW_AT_data_member_location: 21
 <2><c4d>: Abbrev Number: 2 (DW_TAG_member)
    <c4e>   DW_AT_name        : (indirect string, offset: 0xbdd31): AutoWakeUp
    <c52>   DW_AT_decl_file   : 12
    <c53>   DW_AT_decl_line   : 84
    <c54>   DW_AT_decl_column : 19
    <c55>   DW_AT_type        : <0x9df>
    <c59>   DW_AT_data_member_location: 22
 <2><c5a>: Abbrev Number: 2 (DW_TAG_member)
    <c5b>   DW_AT_name        : (indirect string, offset: 0xbfd1a): AutoRetransmission
    <c5f>   DW_AT_decl_file   : 12
    <c60>   DW_AT_decl_line   : 87
    <c61>   DW_AT_decl_column : 19
    <c62>   DW_AT_type        : <0x9df>
    <c66>   DW_AT_data_member_location: 23
 <2><c67>: Abbrev Number: 2 (DW_TAG_member)
    <c68>   DW_AT_name        : (indirect string, offset: 0x406b4): ReceiveFifoLocked
    <c6c>   DW_AT_decl_file   : 12
    <c6d>   DW_AT_decl_line   : 90
    <c6e>   DW_AT_decl_column : 19
    <c6f>   DW_AT_type        : <0x9df>
    <c73>   DW_AT_data_member_location: 24
 <2><c74>: Abbrev Number: 2 (DW_TAG_member)
    <c75>   DW_AT_name        : (indirect string, offset: 0x90b08): TransmitFifoPriority
    <c79>   DW_AT_decl_file   : 12
    <c7a>   DW_AT_decl_line   : 93
    <c7b>   DW_AT_decl_column : 19
    <c7c>   DW_AT_type        : <0x9df>
    <c80>   DW_AT_data_member_location: 25
 <2><c81>: Abbrev Number: 0
 <1><c82>: Abbrev Number: 4 (DW_TAG_typedef)
    <c83>   DW_AT_name        : (indirect string, offset: 0x980ea): CAN_InitTypeDef
    <c87>   DW_AT_decl_file   : 12
    <c88>   DW_AT_decl_line   : 96
    <c89>   DW_AT_decl_column : 3
    <c8a>   DW_AT_type        : <0xbea>
 <1><c8e>: Abbrev Number: 13 (DW_TAG_structure_type)
    <c8f>   DW_AT_byte_size   : 40
    <c90>   DW_AT_decl_file   : 12
    <c91>   DW_AT_decl_line   : 101
    <c92>   DW_AT_decl_column : 9
    <c92>   DW_AT_sibling     : <0xd19>
 <2><c96>: Abbrev Number: 2 (DW_TAG_member)
    <c97>   DW_AT_name        : (indirect string, offset: 0x281c1): FilterIdHigh
    <c9b>   DW_AT_decl_file   : 12
    <c9c>   DW_AT_decl_line   : 103
    <c9d>   DW_AT_decl_column : 12
    <c9e>   DW_AT_type        : <0x2f1>
    <ca2>   DW_AT_data_member_location: 0
 <2><ca3>: Abbrev Number: 2 (DW_TAG_member)
    <ca4>   DW_AT_name        : (indirect string, offset: 0x941b0): FilterIdLow
    <ca8>   DW_AT_decl_file   : 12
    <ca9>   DW_AT_decl_line   : 108
    <caa>   DW_AT_decl_column : 12
    <cab>   DW_AT_type        : <0x2f1>
    <caf>   DW_AT_data_member_location: 4
 <2><cb0>: Abbrev Number: 2 (DW_TAG_member)
    <cb1>   DW_AT_name        : (indirect string, offset: 0x277a0): FilterMaskIdHigh
    <cb5>   DW_AT_decl_file   : 12
    <cb6>   DW_AT_decl_line   : 113
    <cb7>   DW_AT_decl_column : 12
    <cb8>   DW_AT_type        : <0x2f1>
    <cbc>   DW_AT_data_member_location: 8
 <2><cbd>: Abbrev Number: 2 (DW_TAG_member)
    <cbe>   DW_AT_name        : (indirect string, offset: 0xb4b35): FilterMaskIdLow
    <cc2>   DW_AT_decl_file   : 12
    <cc3>   DW_AT_decl_line   : 119
    <cc4>   DW_AT_decl_column : 12
    <cc5>   DW_AT_type        : <0x2f1>
    <cc9>   DW_AT_data_member_location: 12
 <2><cca>: Abbrev Number: 2 (DW_TAG_member)
    <ccb>   DW_AT_name        : (indirect string, offset: 0xb6544): FilterFIFOAssignment
    <ccf>   DW_AT_decl_file   : 12
    <cd0>   DW_AT_decl_line   : 125
    <cd1>   DW_AT_decl_column : 12
    <cd2>   DW_AT_type        : <0x2f1>
    <cd6>   DW_AT_data_member_location: 16
 <2><cd7>: Abbrev Number: 2 (DW_TAG_member)
    <cd8>   DW_AT_name        : (indirect string, offset: 0xb68f4): FilterBank
    <cdc>   DW_AT_decl_file   : 12
    <cdd>   DW_AT_decl_line   : 128
    <cde>   DW_AT_decl_column : 12
    <cdf>   DW_AT_type        : <0x2f1>
    <ce3>   DW_AT_data_member_location: 20
 <2><ce4>: Abbrev Number: 2 (DW_TAG_member)
    <ce5>   DW_AT_name        : (indirect string, offset: 0x4e540): FilterMode
    <ce9>   DW_AT_decl_file   : 12
    <cea>   DW_AT_decl_line   : 134
    <ceb>   DW_AT_decl_column : 12
    <cec>   DW_AT_type        : <0x2f1>
    <cf0>   DW_AT_data_member_location: 24
 <2><cf1>: Abbrev Number: 2 (DW_TAG_member)
    <cf2>   DW_AT_name        : (indirect string, offset: 0xb4790): FilterScale
    <cf6>   DW_AT_decl_file   : 12
    <cf7>   DW_AT_decl_line   : 137
    <cf8>   DW_AT_decl_column : 12
    <cf9>   DW_AT_type        : <0x2f1>
    <cfd>   DW_AT_data_member_location: 28
 <2><cfe>: Abbrev Number: 2 (DW_TAG_member)
    <cff>   DW_AT_name        : (indirect string, offset: 0x10c14): FilterActivation
    <d03>   DW_AT_decl_file   : 12
    <d04>   DW_AT_decl_line   : 140
    <d05>   DW_AT_decl_column : 12
    <d06>   DW_AT_type        : <0x2f1>
    <d0a>   DW_AT_data_member_location: 32
 <2><d0b>: Abbrev Number: 2 (DW_TAG_member)
    <d0c>   DW_AT_name        : (indirect string, offset: 0xb68ea): SlaveStartFilterBank
    <d10>   DW_AT_decl_file   : 12
    <d11>   DW_AT_decl_line   : 143
    <d12>   DW_AT_decl_column : 12
    <d13>   DW_AT_type        : <0x2f1>
    <d17>   DW_AT_data_member_location: 36
 <2><d18>: Abbrev Number: 0
 <1><d19>: Abbrev Number: 4 (DW_TAG_typedef)
    <d1a>   DW_AT_name        : (indirect string, offset: 0xb45c1): CAN_FilterTypeDef
    <d1e>   DW_AT_decl_file   : 12
    <d1f>   DW_AT_decl_line   : 150
    <d20>   DW_AT_decl_column : 3
    <d21>   DW_AT_type        : <0xc8e>
 <1><d25>: Abbrev Number: 22 (DW_TAG_const_type)
    <d26>   DW_AT_type        : <0xd19>
 <1><d2a>: Abbrev Number: 13 (DW_TAG_structure_type)
    <d2b>   DW_AT_byte_size   : 24
    <d2c>   DW_AT_decl_file   : 12
    <d2d>   DW_AT_decl_line   : 155
    <d2e>   DW_AT_decl_column : 9
    <d2e>   DW_AT_sibling     : <0xd81>
 <2><d32>: Abbrev Number: 2 (DW_TAG_member)
    <d33>   DW_AT_name        : (indirect string, offset: 0x1a739): StdId
    <d37>   DW_AT_decl_file   : 12
    <d38>   DW_AT_decl_line   : 157
    <d39>   DW_AT_decl_column : 12
    <d3a>   DW_AT_type        : <0x2f1>
    <d3e>   DW_AT_data_member_location: 0
 <2><d3f>: Abbrev Number: 2 (DW_TAG_member)
    <d40>   DW_AT_name        : (indirect string, offset: 0x6e199): ExtId
    <d44>   DW_AT_decl_file   : 12
    <d45>   DW_AT_decl_line   : 160
    <d46>   DW_AT_decl_column : 12
    <d47>   DW_AT_type        : <0x2f1>
    <d4b>   DW_AT_data_member_location: 4
 <2><d4c>: Abbrev Number: 11 (DW_TAG_member)
    <d4d>   DW_AT_name        : IDE
    <d51>   DW_AT_decl_file   : 12
    <d52>   DW_AT_decl_line   : 163
    <d53>   DW_AT_decl_column : 12
    <d54>   DW_AT_type        : <0x2f1>
    <d58>   DW_AT_data_member_location: 8
 <2><d59>: Abbrev Number: 11 (DW_TAG_member)
    <d5a>   DW_AT_name        : RTR
    <d5e>   DW_AT_decl_file   : 12
    <d5f>   DW_AT_decl_line   : 166
    <d60>   DW_AT_decl_column : 12
    <d61>   DW_AT_type        : <0x2f1>
    <d65>   DW_AT_data_member_location: 12
 <2><d66>: Abbrev Number: 11 (DW_TAG_member)
    <d67>   DW_AT_name        : DLC
    <d6b>   DW_AT_decl_file   : 12
    <d6c>   DW_AT_decl_line   : 169
    <d6d>   DW_AT_decl_column : 12
    <d6e>   DW_AT_type        : <0x2f1>
    <d72>   DW_AT_data_member_location: 16
 <2><d73>: Abbrev Number: 2 (DW_TAG_member)
    <d74>   DW_AT_name        : (indirect string, offset: 0x9fa0b): TransmitGlobalTime
    <d78>   DW_AT_decl_file   : 12
    <d79>   DW_AT_decl_line   : 172
    <d7a>   DW_AT_decl_column : 19
    <d7b>   DW_AT_type        : <0x9df>
    <d7f>   DW_AT_data_member_location: 20
 <2><d80>: Abbrev Number: 0
 <1><d81>: Abbrev Number: 4 (DW_TAG_typedef)
    <d82>   DW_AT_name        : (indirect string, offset: 0x2fb72): CAN_TxHeaderTypeDef
    <d86>   DW_AT_decl_file   : 12
    <d87>   DW_AT_decl_line   : 178
    <d88>   DW_AT_decl_column : 3
    <d89>   DW_AT_type        : <0xd2a>
 <1><d8d>: Abbrev Number: 22 (DW_TAG_const_type)
    <d8e>   DW_AT_type        : <0xd81>
 <1><d92>: Abbrev Number: 13 (DW_TAG_structure_type)
    <d93>   DW_AT_byte_size   : 28
    <d94>   DW_AT_decl_file   : 12
    <d95>   DW_AT_decl_line   : 183
    <d96>   DW_AT_decl_column : 9
    <d96>   DW_AT_sibling     : <0xdf6>
 <2><d9a>: Abbrev Number: 2 (DW_TAG_member)
    <d9b>   DW_AT_name        : (indirect string, offset: 0x1a739): StdId
    <d9f>   DW_AT_decl_file   : 12
    <da0>   DW_AT_decl_line   : 185
    <da1>   DW_AT_decl_column : 12
    <da2>   DW_AT_type        : <0x2f1>
    <da6>   DW_AT_data_member_location: 0
 <2><da7>: Abbrev Number: 2 (DW_TAG_member)
    <da8>   DW_AT_name        : (indirect string, offset: 0x6e199): ExtId
    <dac>   DW_AT_decl_file   : 12
    <dad>   DW_AT_decl_line   : 188
    <dae>   DW_AT_decl_column : 12
    <daf>   DW_AT_type        : <0x2f1>
    <db3>   DW_AT_data_member_location: 4
 <2><db4>: Abbrev Number: 11 (DW_TAG_member)
    <db5>   DW_AT_name        : IDE
    <db9>   DW_AT_decl_file   : 12
    <dba>   DW_AT_decl_line   : 191
    <dbb>   DW_AT_decl_column : 12
    <dbc>   DW_AT_type        : <0x2f1>
    <dc0>   DW_AT_data_member_location: 8
 <2><dc1>: Abbrev Number: 11 (DW_TAG_member)
    <dc2>   DW_AT_name        : RTR
    <dc6>   DW_AT_decl_file   : 12
    <dc7>   DW_AT_decl_line   : 194
    <dc8>   DW_AT_decl_column : 12
    <dc9>   DW_AT_type        : <0x2f1>
    <dcd>   DW_AT_data_member_location: 12
 <2><dce>: Abbrev Number: 11 (DW_TAG_member)
    <dcf>   DW_AT_name        : DLC
    <dd3>   DW_AT_decl_file   : 12
    <dd4>   DW_AT_decl_line   : 197
    <dd5>   DW_AT_decl_column : 12
    <dd6>   DW_AT_type        : <0x2f1>
    <dda>   DW_AT_data_member_location: 16
 <2><ddb>: Abbrev Number: 2 (DW_TAG_member)
    <ddc>   DW_AT_name        : (indirect string, offset: 0xc1a69): Timestamp
    <de0>   DW_AT_decl_file   : 12
    <de1>   DW_AT_decl_line   : 200
    <de2>   DW_AT_decl_column : 12
    <de3>   DW_AT_type        : <0x2f1>
    <de7>   DW_AT_data_member_location: 20
 <2><de8>: Abbrev Number: 2 (DW_TAG_member)
    <de9>   DW_AT_name        : (indirect string, offset: 0x1794c): FilterMatchIndex
    <ded>   DW_AT_decl_file   : 12
    <dee>   DW_AT_decl_line   : 204
    <def>   DW_AT_decl_column : 12
    <df0>   DW_AT_type        : <0x2f1>
    <df4>   DW_AT_data_member_location: 24
 <2><df5>: Abbrev Number: 0
 <1><df6>: Abbrev Number: 4 (DW_TAG_typedef)
    <df7>   DW_AT_name        : (indirect string, offset: 0x95b26): CAN_RxHeaderTypeDef
    <dfb>   DW_AT_decl_file   : 12
    <dfc>   DW_AT_decl_line   : 207
    <dfd>   DW_AT_decl_column : 3
    <dfe>   DW_AT_type        : <0xd92>
 <1><e02>: Abbrev Number: 13 (DW_TAG_structure_type)
    <e03>   DW_AT_byte_size   : 40
    <e04>   DW_AT_decl_file   : 12
    <e05>   DW_AT_decl_line   : 215
    <e06>   DW_AT_decl_column : 9
    <e06>   DW_AT_sibling     : <0xe3f>
 <2><e0a>: Abbrev Number: 2 (DW_TAG_member)
    <e0b>   DW_AT_name        : (indirect string, offset: 0xb9e27): Instance
    <e0f>   DW_AT_decl_file   : 12
    <e10>   DW_AT_decl_line   : 218
    <e11>   DW_AT_decl_column : 32
    <e12>   DW_AT_type        : <0xe3f>
    <e16>   DW_AT_data_member_location: 0
 <2><e17>: Abbrev Number: 2 (DW_TAG_member)
    <e18>   DW_AT_name        : (indirect string, offset: 0xc257b): Init
    <e1c>   DW_AT_decl_file   : 12
    <e1d>   DW_AT_decl_line   : 220
    <e1e>   DW_AT_decl_column : 31
    <e1f>   DW_AT_type        : <0xc82>
    <e23>   DW_AT_data_member_location: 4
 <2><e24>: Abbrev Number: 2 (DW_TAG_member)
    <e25>   DW_AT_name        : (indirect string, offset: 0x820bb): State
    <e29>   DW_AT_decl_file   : 12
    <e2a>   DW_AT_decl_line   : 222
    <e2b>   DW_AT_decl_column : 31
    <e2c>   DW_AT_type        : <0xbe5>
    <e30>   DW_AT_data_member_location: 32
 <2><e31>: Abbrev Number: 2 (DW_TAG_member)
    <e32>   DW_AT_name        : (indirect string, offset: 0xc21a6): ErrorCode
    <e36>   DW_AT_decl_file   : 12
    <e37>   DW_AT_decl_line   : 224
    <e38>   DW_AT_decl_column : 31
    <e39>   DW_AT_type        : <0x2fd>
    <e3d>   DW_AT_data_member_location: 36
 <2><e3e>: Abbrev Number: 0
 <1><e3f>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <e40>   DW_AT_byte_size   : 4
    <e40>   DW_AT_type        : <0x723>
 <1><e44>: Abbrev Number: 4 (DW_TAG_typedef)
    <e45>   DW_AT_name        : (indirect string, offset: 0x92b17): CAN_HandleTypeDef
    <e49>   DW_AT_decl_file   : 12
    <e4a>   DW_AT_decl_line   : 246
    <e4b>   DW_AT_decl_column : 3
    <e4c>   DW_AT_type        : <0xe02>
 <1><e50>: Abbrev Number: 13 (DW_TAG_structure_type)
    <e51>   DW_AT_byte_size   : 20
    <e52>   DW_AT_decl_file   : 13
    <e53>   DW_AT_decl_line   : 45
    <e54>   DW_AT_decl_column : 9
    <e54>   DW_AT_sibling     : <0xe9a>
 <2><e58>: Abbrev Number: 2 (DW_TAG_member)
    <e59>   DW_AT_name        : (indirect string, offset: 0x78cc6): TypeErase
    <e5d>   DW_AT_decl_file   : 13
    <e5e>   DW_AT_decl_line   : 47
    <e5f>   DW_AT_decl_column : 12
    <e60>   DW_AT_type        : <0x2f1>
    <e64>   DW_AT_data_member_location: 0
 <2><e65>: Abbrev Number: 2 (DW_TAG_member)
    <e66>   DW_AT_name        : (indirect string, offset: 0x7946e): Banks
    <e6a>   DW_AT_decl_file   : 13
    <e6b>   DW_AT_decl_line   : 50
    <e6c>   DW_AT_decl_column : 12
    <e6d>   DW_AT_type        : <0x2f1>
    <e71>   DW_AT_data_member_location: 4
 <2><e72>: Abbrev Number: 2 (DW_TAG_member)
    <e73>   DW_AT_name        : (indirect string, offset: 0xc2514): Sector
    <e77>   DW_AT_decl_file   : 13
    <e78>   DW_AT_decl_line   : 53
    <e79>   DW_AT_decl_column : 12
    <e7a>   DW_AT_type        : <0x2f1>
    <e7e>   DW_AT_data_member_location: 8
 <2><e7f>: Abbrev Number: 2 (DW_TAG_member)
    <e80>   DW_AT_name        : (indirect string, offset: 0x1d2f5): NbSectors
    <e84>   DW_AT_decl_file   : 13
    <e85>   DW_AT_decl_line   : 56
    <e86>   DW_AT_decl_column : 12
    <e87>   DW_AT_type        : <0x2f1>
    <e8b>   DW_AT_data_member_location: 12
 <2><e8c>: Abbrev Number: 2 (DW_TAG_member)
    <e8d>   DW_AT_name        : (indirect string, offset: 0x1ef2a): VoltageRange
    <e91>   DW_AT_decl_file   : 13
    <e92>   DW_AT_decl_line   : 59
    <e93>   DW_AT_decl_column : 12
    <e94>   DW_AT_type        : <0x2f1>
    <e98>   DW_AT_data_member_location: 16
 <2><e99>: Abbrev Number: 0
 <1><e9a>: Abbrev Number: 4 (DW_TAG_typedef)
    <e9b>   DW_AT_name        : (indirect string, offset: 0x65b9e): FLASH_EraseInitTypeDef
    <e9f>   DW_AT_decl_file   : 13
    <ea0>   DW_AT_decl_line   : 62
    <ea1>   DW_AT_decl_column : 3
    <ea2>   DW_AT_type        : <0xe50>
 <1><ea6>: Abbrev Number: 15 (DW_TAG_base_type)
    <ea7>   DW_AT_byte_size   : 1
    <ea8>   DW_AT_encoding    : 8	(unsigned char)
    <ea9>   DW_AT_name        : (indirect string, offset: 0x607a5): char
 <1><ead>: Abbrev Number: 4 (DW_TAG_typedef)
    <eae>   DW_AT_name        : (indirect string, offset: 0x4dbbb): uint8
    <eb2>   DW_AT_decl_file   : 1
    <eb3>   DW_AT_decl_line   : 30
    <eb4>   DW_AT_decl_column : 17
    <eb5>   DW_AT_type        : <0x2cf>
 <1><eb9>: Abbrev Number: 4 (DW_TAG_typedef)
    <eba>   DW_AT_name        : (indirect string, offset: 0xb42a1): uint16
    <ebe>   DW_AT_decl_file   : 1
    <ebf>   DW_AT_decl_line   : 31
    <ec0>   DW_AT_decl_column : 18
    <ec1>   DW_AT_type        : <0x2e5>
 <1><ec5>: Abbrev Number: 4 (DW_TAG_typedef)
    <ec6>   DW_AT_name        : (indirect string, offset: 0xb4df8): uint32
    <eca>   DW_AT_decl_file   : 1
    <ecb>   DW_AT_decl_line   : 32
    <ecc>   DW_AT_decl_column : 18
    <ecd>   DW_AT_type        : <0x2f1>
 <1><ed1>: Abbrev Number: 27 (DW_TAG_enumeration_type)
    <ed2>   DW_AT_encoding    : 7	(unsigned)
    <ed3>   DW_AT_byte_size   : 1
    <ed3>   DW_AT_type        : <0x26c>
    <ed7>   DW_AT_decl_file   : 1
    <ed8>   DW_AT_decl_line   : 34
    <ed9>   DW_AT_decl_column : 1
    <ed9>   DW_AT_sibling     : <0xf0e>
 <2><edd>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ede>   DW_AT_name        : (indirect string, offset: 0x83c2b): DEFAULT
    <ee2>   DW_AT_const_value : 0
 <2><ee3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ee4>   DW_AT_name        : (indirect string, offset: 0x80fbe): EXTENDED
    <ee8>   DW_AT_const_value : 1
 <2><ee9>: Abbrev Number: 1 (DW_TAG_enumerator)
    <eea>   DW_AT_name        : (indirect string, offset: 0x67488): PROGRAMMING
    <eee>   DW_AT_const_value : 2
 <2><eef>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ef0>   DW_AT_name        : (indirect string, offset: 0x14ada): CODING
    <ef4>   DW_AT_const_value : 3
 <2><ef5>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ef6>   DW_AT_name        : (indirect string, offset: 0xb4f5e): CALIBRATION
    <efa>   DW_AT_const_value : 4
 <2><efb>: Abbrev Number: 1 (DW_TAG_enumerator)
    <efc>   DW_AT_name        : (indirect string, offset: 0x37976): HARDRESET
    <f00>   DW_AT_const_value : 5
 <2><f01>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f02>   DW_AT_name        : (indirect string, offset: 0x55ac8): SOFTRESET
    <f06>   DW_AT_const_value : 6
 <2><f07>: Abbrev Number: 1 (DW_TAG_enumerator)
    <f08>   DW_AT_name        : (indirect string, offset: 0xb23b): JUMPTOAPPL
    <f0c>   DW_AT_const_value : 7
 <2><f0d>: Abbrev Number: 0
 <1><f0e>: Abbrev Number: 4 (DW_TAG_typedef)
    <f0f>   DW_AT_name        : (indirect string, offset: 0xadb46): FBL_DSC_t
    <f13>   DW_AT_decl_file   : 1
    <f14>   DW_AT_decl_line   : 43
    <f15>   DW_AT_decl_column : 2
    <f16>   DW_AT_type        : <0xed1>
 <1><f1a>: Abbrev Number: 7 (DW_TAG_variable)
    <f1b>   DW_AT_name        : (indirect string, offset: 0x4aa79): hcan1
    <f1f>   DW_AT_decl_file   : 1
    <f1f>   DW_AT_decl_line   : 61
    <f20>   DW_AT_decl_column : 19
    <f21>   DW_AT_type        : <0xe44>
    <f25>   DW_AT_external    : 1
    <f25>   DW_AT_location    : 5 byte block: 3 38 0 0 20 	(DW_OP_addr: 20000038)
 <1><f2b>: Abbrev Number: 7 (DW_TAG_variable)
    <f2c>   DW_AT_name        : (indirect string, offset: 0x5a205): FBL_firstCall
    <f30>   DW_AT_decl_file   : 1
    <f30>   DW_AT_decl_line   : 64
    <f31>   DW_AT_decl_column : 7
    <f32>   DW_AT_type        : <0xead>
    <f36>   DW_AT_external    : 1
    <f36>   DW_AT_location    : 5 byte block: 3 60 0 0 20 	(DW_OP_addr: 20000060)
 <1><f3c>: Abbrev Number: 7 (DW_TAG_variable)
    <f3d>   DW_AT_name        : (indirect string, offset: 0xbc36b): FBL_Block0EndAddress
    <f41>   DW_AT_decl_file   : 1
    <f41>   DW_AT_decl_line   : 65
    <f42>   DW_AT_decl_column : 8
    <f43>   DW_AT_type        : <0xec5>
    <f47>   DW_AT_external    : 1
    <f47>   DW_AT_location    : 5 byte block: 3 64 0 0 20 	(DW_OP_addr: 20000064)
 <1><f4d>: Abbrev Number: 9 (DW_TAG_array_type)
    <f4e>   DW_AT_type        : <0xead>
    <f52>   DW_AT_sibling     : <0xf5d>
 <2><f56>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <f57>   DW_AT_type        : <0x2c8>
    <f5b>   DW_AT_upper_bound : 7
 <2><f5c>: Abbrev Number: 0
 <1><f5d>: Abbrev Number: 7 (DW_TAG_variable)
    <f5e>   DW_AT_name        : (indirect string, offset: 0x89f51): FBL_RxFrame
    <f62>   DW_AT_decl_file   : 1
    <f62>   DW_AT_decl_line   : 66
    <f63>   DW_AT_decl_column : 7
    <f64>   DW_AT_type        : <0xf4d>
    <f68>   DW_AT_external    : 1
    <f68>   DW_AT_location    : 5 byte block: 3 68 0 0 20 	(DW_OP_addr: 20000068)
 <1><f6e>: Abbrev Number: 7 (DW_TAG_variable)
    <f6f>   DW_AT_name        : (indirect string, offset: 0x6b8f5): FBL_TxFrame
    <f73>   DW_AT_decl_file   : 1
    <f73>   DW_AT_decl_line   : 67
    <f74>   DW_AT_decl_column : 7
    <f75>   DW_AT_type        : <0xf4d>
    <f79>   DW_AT_external    : 1
    <f79>   DW_AT_location    : 5 byte block: 3 70 0 0 20 	(DW_OP_addr: 20000070)
 <1><f7f>: Abbrev Number: 7 (DW_TAG_variable)
    <f80>   DW_AT_name        : (indirect string, offset: 0x86145): FBL_RxHeader
    <f84>   DW_AT_decl_file   : 1
    <f84>   DW_AT_decl_line   : 68
    <f85>   DW_AT_decl_column : 21
    <f86>   DW_AT_type        : <0xdf6>
    <f8a>   DW_AT_external    : 1
    <f8a>   DW_AT_location    : 5 byte block: 3 78 0 0 20 	(DW_OP_addr: 20000078)
 <1><f90>: Abbrev Number: 7 (DW_TAG_variable)
    <f91>   DW_AT_name        : (indirect string, offset: 0x81277): FBL_TxHeader
    <f95>   DW_AT_decl_file   : 1
    <f95>   DW_AT_decl_line   : 69
    <f96>   DW_AT_decl_column : 21
    <f97>   DW_AT_type        : <0xd81>
    <f9b>   DW_AT_external    : 1
    <f9b>   DW_AT_location    : 5 byte block: 3 94 0 0 20 	(DW_OP_addr: 20000094)
 <1><fa1>: Abbrev Number: 7 (DW_TAG_variable)
    <fa2>   DW_AT_name        : (indirect string, offset: 0xdef5): FBL_TxMailbox
    <fa6>   DW_AT_decl_file   : 1
    <fa6>   DW_AT_decl_line   : 70
    <fa7>   DW_AT_decl_column : 8
    <fa8>   DW_AT_type        : <0xec5>
    <fac>   DW_AT_external    : 1
    <fac>   DW_AT_location    : 5 byte block: 3 ac 0 0 20 	(DW_OP_addr: 200000ac)
 <1><fb2>: Abbrev Number: 7 (DW_TAG_variable)
    <fb3>   DW_AT_name        : (indirect string, offset: 0x70731): FBL_DSC_Pointer
    <fb7>   DW_AT_decl_file   : 1
    <fb7>   DW_AT_decl_line   : 71
    <fb8>   DW_AT_decl_column : 9
    <fb9>   DW_AT_type        : <0xfc3>
    <fbd>   DW_AT_external    : 1
    <fbd>   DW_AT_location    : 5 byte block: 3 0 0 0 20 	(DW_OP_addr: 20000000)
 <1><fc3>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <fc4>   DW_AT_byte_size   : 4
    <fc4>   DW_AT_type        : <0xec5>
 <1><fc8>: Abbrev Number: 7 (DW_TAG_variable)
    <fc9>   DW_AT_name        : (indirect string, offset: 0x6ab44): FBL_DSC_State
    <fcd>   DW_AT_decl_file   : 1
    <fcd>   DW_AT_decl_line   : 72
    <fce>   DW_AT_decl_column : 11
    <fcf>   DW_AT_type        : <0xf0e>
    <fd3>   DW_AT_external    : 1
    <fd3>   DW_AT_location    : 5 byte block: 3 4 0 0 20 	(DW_OP_addr: 20000004)
 <1><fd9>: Abbrev Number: 9 (DW_TAG_array_type)
    <fda>   DW_AT_type        : <0xead>
    <fde>   DW_AT_sibling     : <0xfe9>
 <2><fe2>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <fe3>   DW_AT_type        : <0x2c8>
    <fe7>   DW_AT_upper_bound : 3
 <2><fe8>: Abbrev Number: 0
 <1><fe9>: Abbrev Number: 7 (DW_TAG_variable)
    <fea>   DW_AT_name        : (indirect string, offset: 0x84ef7): FBL_tempBuf_Programming
    <fee>   DW_AT_decl_file   : 1
    <fee>   DW_AT_decl_line   : 73
    <fef>   DW_AT_decl_column : 7
    <ff0>   DW_AT_type        : <0xfd9>
    <ff4>   DW_AT_external    : 1
    <ff4>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><ffa>: Abbrev Number: 7 (DW_TAG_variable)
    <ffb>   DW_AT_name        : (indirect string, offset: 0x1072): FBL_ProgrammingData
    <fff>   DW_AT_decl_file   : 1
    <fff>   DW_AT_decl_line   : 74
    <1000>   DW_AT_decl_column : 8
    <1001>   DW_AT_type        : <0xec5>
    <1005>   DW_AT_external    : 1
    <1005>   DW_AT_location    : 5 byte block: 3 b0 0 0 20 	(DW_OP_addr: 200000b0)
 <1><100b>: Abbrev Number: 7 (DW_TAG_variable)
    <100c>   DW_AT_name        : (indirect string, offset: 0x80b7d): FBL_ProgrammingIndex
    <1010>   DW_AT_decl_file   : 1
    <1010>   DW_AT_decl_line   : 75
    <1011>   DW_AT_decl_column : 8
    <1012>   DW_AT_type        : <0xec5>
    <1016>   DW_AT_external    : 1
    <1016>   DW_AT_location    : 5 byte block: 3 b4 0 0 20 	(DW_OP_addr: 200000b4)
 <1><101c>: Abbrev Number: 7 (DW_TAG_variable)
    <101d>   DW_AT_name        : (indirect string, offset: 0x719b0): FBL_ProgrammingAddress
    <1021>   DW_AT_decl_file   : 1
    <1021>   DW_AT_decl_line   : 76
    <1022>   DW_AT_decl_column : 8
    <1023>   DW_AT_type        : <0xec5>
    <1027>   DW_AT_external    : 1
    <1027>   DW_AT_location    : 5 byte block: 3 b8 0 0 20 	(DW_OP_addr: 200000b8)
 <1><102d>: Abbrev Number: 7 (DW_TAG_variable)
    <102e>   DW_AT_name        : (indirect string, offset: 0x5d6b5): FBL_IsRequestDownload_Positive
    <1032>   DW_AT_decl_file   : 1
    <1032>   DW_AT_decl_line   : 77
    <1033>   DW_AT_decl_column : 7
    <1034>   DW_AT_type        : <0xead>
    <1038>   DW_AT_external    : 1
    <1038>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><103e>: Abbrev Number: 7 (DW_TAG_variable)
    <103f>   DW_AT_name        : (indirect string, offset: 0x6ca19): FBL_IsRequestTransferExit_Positive
    <1043>   DW_AT_decl_file   : 1
    <1043>   DW_AT_decl_line   : 78
    <1044>   DW_AT_decl_column : 7
    <1045>   DW_AT_type        : <0xead>
    <1049>   DW_AT_external    : 1
    <1049>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><104f>: Abbrev Number: 7 (DW_TAG_variable)
    <1050>   DW_AT_name        : (indirect string, offset: 0x4a108): ROM_APPL_START_ADDR_storedValue
    <1054>   DW_AT_decl_file   : 1
    <1054>   DW_AT_decl_line   : 79
    <1055>   DW_AT_decl_column : 8
    <1056>   DW_AT_type        : <0xec5>
    <105a>   DW_AT_external    : 1
    <105a>   DW_AT_location    : 5 byte block: 3 bc 0 0 20 	(DW_OP_addr: 200000bc)
 <1><1060>: Abbrev Number: 7 (DW_TAG_variable)
    <1061>   DW_AT_name        : (indirect string, offset: 0xbbf2c): ROM_APPL_START_ADDR
    <1065>   DW_AT_decl_file   : 1
    <1065>   DW_AT_decl_line   : 80
    <1066>   DW_AT_decl_column : 8
    <1067>   DW_AT_type        : <0xec5>
    <106b>   DW_AT_external    : 1
    <106b>   DW_AT_location    : 5 byte block: 3 8 0 0 20 	(DW_OP_addr: 20000008)
 <1><1071>: Abbrev Number: 7 (DW_TAG_variable)
    <1072>   DW_AT_name        : (indirect string, offset: 0xb4ba2): FBL_DSC_Status
    <1076>   DW_AT_decl_file   : 1
    <1076>   DW_AT_decl_line   : 81
    <1077>   DW_AT_decl_column : 8
    <1078>   DW_AT_type        : <0xec5>
    <107c>   DW_AT_external    : 1
    <107c>   DW_AT_location    : 5 byte block: 3 c0 0 0 20 	(DW_OP_addr: 200000c0)
 <1><1082>: Abbrev Number: 7 (DW_TAG_variable)
    <1083>   DW_AT_name        : (indirect string, offset: 0xb3c8f): FBL_IsTransferDataActive
    <1087>   DW_AT_decl_file   : 1
    <1087>   DW_AT_decl_line   : 82
    <1088>   DW_AT_decl_column : 7
    <1089>   DW_AT_type        : <0xead>
    <108d>   DW_AT_external    : 1
    <108d>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><1093>: Abbrev Number: 16 (DW_TAG_subprogram)
    <1094>   DW_AT_external    : 1
    <1094>   DW_AT_name        : (indirect string, offset: 0x68c59): HAL_FLASH_Program
    <1098>   DW_AT_decl_file   : 14
    <1099>   DW_AT_decl_line   : 306
    <109b>   DW_AT_decl_column : 19
    <109b>   DW_AT_prototyped  : 1
    <109b>   DW_AT_type        : <0xa17>
    <109f>   DW_AT_declaration : 1
    <109f>   DW_AT_sibling     : <0x10b3>
 <2><10a3>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <10a4>   DW_AT_type        : <0x2f1>
 <2><10a8>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <10a9>   DW_AT_type        : <0x2f1>
 <2><10ad>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <10ae>   DW_AT_type        : <0x307>
 <2><10b2>: Abbrev Number: 0
 <1><10b3>: Abbrev Number: 29 (DW_TAG_subprogram)
    <10b4>   DW_AT_external    : 1
    <10b4>   DW_AT_name        : (indirect string, offset: 0x7c363): HAL_FLASH_Lock
    <10b8>   DW_AT_decl_file   : 14
    <10b8>   DW_AT_decl_line   : 322
    <10ba>   DW_AT_decl_column : 19
    <10bb>   DW_AT_prototyped  : 1
    <10bb>   DW_AT_type        : <0xa17>
    <10bf>   DW_AT_declaration : 1
 <1><10bf>: Abbrev Number: 29 (DW_TAG_subprogram)
    <10c0>   DW_AT_external    : 1
    <10c0>   DW_AT_name        : (indirect string, offset: 0x14030): HAL_FLASH_GetError
    <10c4>   DW_AT_decl_file   : 14
    <10c4>   DW_AT_decl_line   : 335
    <10c6>   DW_AT_decl_column : 10
    <10c7>   DW_AT_prototyped  : 1
    <10c7>   DW_AT_type        : <0x2f1>
    <10cb>   DW_AT_declaration : 1
 <1><10cb>: Abbrev Number: 16 (DW_TAG_subprogram)
    <10cc>   DW_AT_external    : 1
    <10cc>   DW_AT_name        : (indirect string, offset: 0x82478): HAL_FLASHEx_Erase
    <10d0>   DW_AT_decl_file   : 13
    <10d1>   DW_AT_decl_line   : 725
    <10d3>   DW_AT_decl_column : 19
    <10d3>   DW_AT_prototyped  : 1
    <10d3>   DW_AT_type        : <0xa17>
    <10d7>   DW_AT_declaration : 1
    <10d7>   DW_AT_sibling     : <0x10e6>
 <2><10db>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <10dc>   DW_AT_type        : <0x10e6>
 <2><10e0>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <10e1>   DW_AT_type        : <0x10eb>
 <2><10e5>: Abbrev Number: 0
 <1><10e6>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <10e7>   DW_AT_byte_size   : 4
    <10e7>   DW_AT_type        : <0xe9a>
 <1><10eb>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <10ec>   DW_AT_byte_size   : 4
    <10ec>   DW_AT_type        : <0x2f1>
 <1><10f0>: Abbrev Number: 29 (DW_TAG_subprogram)
    <10f1>   DW_AT_external    : 1
    <10f1>   DW_AT_name        : (indirect string, offset: 0x81323): HAL_FLASH_Unlock
    <10f5>   DW_AT_decl_file   : 14
    <10f5>   DW_AT_decl_line   : 321
    <10f7>   DW_AT_decl_column : 19
    <10f8>   DW_AT_prototyped  : 1
    <10f8>   DW_AT_type        : <0xa17>
    <10fc>   DW_AT_declaration : 1
 <1><10fc>: Abbrev Number: 42 (DW_TAG_subprogram)
    <10fd>   DW_AT_external    : 1
    <10fd>   DW_AT_name        : (indirect string, offset: 0x3d344): HAL_GPIO_Init
    <1101>   DW_AT_decl_file   : 11
    <1102>   DW_AT_decl_line   : 224
    <1103>   DW_AT_decl_column : 7
    <1104>   DW_AT_prototyped  : 1
    <1104>   DW_AT_declaration : 1
    <1104>   DW_AT_sibling     : <0x1113>
 <2><1108>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <1109>   DW_AT_type        : <0x1113>
 <2><110d>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <110e>   DW_AT_type        : <0x1118>
 <2><1112>: Abbrev Number: 0
 <1><1113>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <1114>   DW_AT_byte_size   : 4
    <1114>   DW_AT_type        : <0x7cd>
 <1><1118>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <1119>   DW_AT_byte_size   : 4
    <1119>   DW_AT_type        : <0xb96>
 <1><111d>: Abbrev Number: 16 (DW_TAG_subprogram)
    <111e>   DW_AT_external    : 1
    <111e>   DW_AT_name        : (indirect string, offset: 0xa77ab): HAL_CAN_Init
    <1122>   DW_AT_decl_file   : 12
    <1123>   DW_AT_decl_line   : 649
    <1125>   DW_AT_decl_column : 19
    <1125>   DW_AT_prototyped  : 1
    <1125>   DW_AT_type        : <0xa17>
    <1129>   DW_AT_declaration : 1
    <1129>   DW_AT_sibling     : <0x1133>
 <2><112d>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <112e>   DW_AT_type        : <0x1133>
 <2><1132>: Abbrev Number: 0
 <1><1133>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <1134>   DW_AT_byte_size   : 4
    <1134>   DW_AT_type        : <0xe44>
 <1><1138>: Abbrev Number: 16 (DW_TAG_subprogram)
    <1139>   DW_AT_external    : 1
    <1139>   DW_AT_name        : (indirect string, offset: 0x74037): HAL_CAN_ConfigFilter
    <113d>   DW_AT_decl_file   : 12
    <113e>   DW_AT_decl_line   : 671
    <1140>   DW_AT_decl_column : 19
    <1140>   DW_AT_prototyped  : 1
    <1140>   DW_AT_type        : <0xa17>
    <1144>   DW_AT_declaration : 1
    <1144>   DW_AT_sibling     : <0x1153>
 <2><1148>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <1149>   DW_AT_type        : <0x1133>
 <2><114d>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <114e>   DW_AT_type        : <0x1153>
 <2><1152>: Abbrev Number: 0
 <1><1153>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <1154>   DW_AT_byte_size   : 4
    <1154>   DW_AT_type        : <0xd25>
 <1><1158>: Abbrev Number: 32 (DW_TAG_subprogram)
    <1159>   DW_AT_external    : 1
    <1159>   DW_AT_name        : (indirect string, offset: 0x17992): HAL_NVIC_EnableIRQ
    <115d>   DW_AT_decl_file   : 15
    <115d>   DW_AT_decl_line   : 262
    <115f>   DW_AT_decl_column : 6
    <115f>   DW_AT_prototyped  : 1
    <115f>   DW_AT_declaration : 1
    <115f>   DW_AT_sibling     : <0x1169>
 <2><1163>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <1164>   DW_AT_type        : <0x254>
 <2><1168>: Abbrev Number: 0
 <1><1169>: Abbrev Number: 32 (DW_TAG_subprogram)
    <116a>   DW_AT_external    : 1
    <116a>   DW_AT_name        : (indirect string, offset: 0x9edb6): HAL_NVIC_SetPriority
    <116e>   DW_AT_decl_file   : 15
    <116e>   DW_AT_decl_line   : 261
    <1170>   DW_AT_decl_column : 6
    <1170>   DW_AT_prototyped  : 1
    <1170>   DW_AT_declaration : 1
    <1170>   DW_AT_sibling     : <0x1184>
 <2><1174>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <1175>   DW_AT_type        : <0x254>
 <2><1179>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <117a>   DW_AT_type        : <0x2f1>
 <2><117e>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <117f>   DW_AT_type        : <0x2f1>
 <2><1183>: Abbrev Number: 0
 <1><1184>: Abbrev Number: 16 (DW_TAG_subprogram)
    <1185>   DW_AT_external    : 1
    <1185>   DW_AT_name        : (indirect string, offset: 0xa4910): HAL_RCC_ClockConfig
    <1189>   DW_AT_decl_file   : 10
    <118a>   DW_AT_decl_line   : 1246
    <118c>   DW_AT_decl_column : 19
    <118c>   DW_AT_prototyped  : 1
    <118c>   DW_AT_type        : <0xa17>
    <1190>   DW_AT_declaration : 1
    <1190>   DW_AT_sibling     : <0x119f>
 <2><1194>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <1195>   DW_AT_type        : <0x119f>
 <2><1199>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <119a>   DW_AT_type        : <0x2f1>
 <2><119e>: Abbrev Number: 0
 <1><119f>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <11a0>   DW_AT_byte_size   : 4
    <11a0>   DW_AT_type        : <0xb40>
 <1><11a4>: Abbrev Number: 16 (DW_TAG_subprogram)
    <11a5>   DW_AT_external    : 1
    <11a5>   DW_AT_name        : (indirect string, offset: 0x84425): HAL_RCC_OscConfig
    <11a9>   DW_AT_decl_file   : 10
    <11aa>   DW_AT_decl_line   : 1245
    <11ac>   DW_AT_decl_column : 19
    <11ac>   DW_AT_prototyped  : 1
    <11ac>   DW_AT_type        : <0xa17>
    <11b0>   DW_AT_declaration : 1
    <11b0>   DW_AT_sibling     : <0x11ba>
 <2><11b4>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <11b5>   DW_AT_type        : <0x11ba>
 <2><11b9>: Abbrev Number: 0
 <1><11ba>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <11bb>   DW_AT_byte_size   : 4
    <11bb>   DW_AT_type        : <0xaea>
 <1><11bf>: Abbrev Number: 16 (DW_TAG_subprogram)
    <11c0>   DW_AT_external    : 1
    <11c0>   DW_AT_name        : (indirect string, offset: 0xae53f): HAL_CAN_AddTxMessage
    <11c4>   DW_AT_decl_file   : 12
    <11c5>   DW_AT_decl_line   : 688
    <11c7>   DW_AT_decl_column : 19
    <11c7>   DW_AT_prototyped  : 1
    <11c7>   DW_AT_type        : <0xa17>
    <11cb>   DW_AT_declaration : 1
    <11cb>   DW_AT_sibling     : <0x11e4>
 <2><11cf>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <11d0>   DW_AT_type        : <0x1133>
 <2><11d4>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <11d5>   DW_AT_type        : <0x11e4>
 <2><11d9>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <11da>   DW_AT_type        : <0x11e9>
 <2><11de>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <11df>   DW_AT_type        : <0x10eb>
 <2><11e3>: Abbrev Number: 0
 <1><11e4>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <11e5>   DW_AT_byte_size   : 4
    <11e5>   DW_AT_type        : <0xd8d>
 <1><11e9>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <11ea>   DW_AT_byte_size   : 4
    <11ea>   DW_AT_type        : <0x2e0>
 <1><11ee>: Abbrev Number: 16 (DW_TAG_subprogram)
    <11ef>   DW_AT_external    : 1
    <11ef>   DW_AT_name        : (indirect string, offset: 0x84958): HAL_CAN_ActivateNotification
    <11f3>   DW_AT_decl_file   : 12
    <11f4>   DW_AT_decl_line   : 707
    <11f6>   DW_AT_decl_column : 19
    <11f6>   DW_AT_prototyped  : 1
    <11f6>   DW_AT_type        : <0xa17>
    <11fa>   DW_AT_declaration : 1
    <11fa>   DW_AT_sibling     : <0x1209>
 <2><11fe>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <11ff>   DW_AT_type        : <0x1133>
 <2><1203>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <1204>   DW_AT_type        : <0x2f1>
 <2><1208>: Abbrev Number: 0
 <1><1209>: Abbrev Number: 16 (DW_TAG_subprogram)
    <120a>   DW_AT_external    : 1
    <120a>   DW_AT_name        : (indirect string, offset: 0x2b75e): HAL_CAN_Start
    <120e>   DW_AT_decl_file   : 12
    <120f>   DW_AT_decl_line   : 683
    <1211>   DW_AT_decl_column : 19
    <1211>   DW_AT_prototyped  : 1
    <1211>   DW_AT_type        : <0xa17>
    <1215>   DW_AT_declaration : 1
    <1215>   DW_AT_sibling     : <0x121f>
 <2><1219>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <121a>   DW_AT_type        : <0x1133>
 <2><121e>: Abbrev Number: 0
 <1><121f>: Abbrev Number: 43 (DW_TAG_subprogram)
    <1220>   DW_AT_external    : 1
    <1220>   DW_AT_name        : (indirect string, offset: 0xb44ca): HAL_Init
    <1224>   DW_AT_decl_file   : 16
    <1225>   DW_AT_decl_line   : 219
    <1226>   DW_AT_decl_column : 19
    <1227>   DW_AT_prototyped  : 1
    <1227>   DW_AT_type        : <0xa17>
    <122b>   DW_AT_declaration : 1
 <1><122b>: Abbrev Number: 16 (DW_TAG_subprogram)
    <122c>   DW_AT_external    : 1
    <122c>   DW_AT_name        : (indirect string, offset: 0x6d95e): HAL_CAN_GetRxMessage
    <1230>   DW_AT_decl_file   : 12
    <1231>   DW_AT_decl_line   : 694
    <1233>   DW_AT_decl_column : 19
    <1233>   DW_AT_prototyped  : 1
    <1233>   DW_AT_type        : <0xa17>
    <1237>   DW_AT_declaration : 1
    <1237>   DW_AT_sibling     : <0x1250>
 <2><123b>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <123c>   DW_AT_type        : <0x1133>
 <2><1240>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <1241>   DW_AT_type        : <0x2f1>
 <2><1245>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <1246>   DW_AT_type        : <0x1250>
 <2><124a>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <124b>   DW_AT_type        : <0x1255>
 <2><124f>: Abbrev Number: 0
 <1><1250>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <1251>   DW_AT_byte_size   : 4
    <1251>   DW_AT_type        : <0xdf6>
 <1><1255>: Abbrev Number: 12 (DW_TAG_pointer_type)
    <1256>   DW_AT_byte_size   : 4
    <1256>   DW_AT_type        : <0x2cf>
 <1><125a>: Abbrev Number: 17 (DW_TAG_subprogram)
    <125b>   DW_AT_external    : 1
    <125b>   DW_AT_name        : (indirect string, offset: 0x54fb5): Error_Handler
    <125f>   DW_AT_decl_file   : 1
    <125f>   DW_AT_decl_line   : 852
    <1261>   DW_AT_decl_column : 6
    <1261>   DW_AT_prototyped  : 1
    <1261>   DW_AT_low_pc      : 0x80010fc
    <1265>   DW_AT_high_pc     : 0xc
    <1269>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <126b>   DW_AT_call_all_tail_calls: 1
    <126b>   DW_AT_sibling     : <0x1281>
 <2><126f>: Abbrev Number: 18 (DW_TAG_inlined_subroutine)
    <1270>   DW_AT_abstract_origin: <0x185d>
    <1274>   DW_AT_low_pc      : 0x8001100
    <1278>   DW_AT_high_pc     : 0x4
    <127c>   DW_AT_call_file   : 1
    <127d>   DW_AT_call_line   : 855
    <127f>   DW_AT_call_column : 2
 <2><1280>: Abbrev Number: 0
 <1><1281>: Abbrev Number: 44 (DW_TAG_subprogram)
    <1282>   DW_AT_external    : 1
    <1282>   DW_AT_name        : (indirect string, offset: 0x28dac): FBL_DiagRoutine_DSC_Programming
    <1286>   DW_AT_decl_file   : 1
    <1287>   DW_AT_decl_line   : 761
    <1289>   DW_AT_decl_column : 6
    <128a>   DW_AT_prototyped  : 1
    <128a>   DW_AT_low_pc      : 0x8000fd4
    <128e>   DW_AT_high_pc     : 0x128
    <1292>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <1294>   DW_AT_call_all_tail_calls: 1
 <1><1294>: Abbrev Number: 17 (DW_TAG_subprogram)
    <1295>   DW_AT_external    : 1
    <1295>   DW_AT_name        : (indirect string, offset: 0x1273f): FBL_DiagRoutine_RDBI_ReadActiveDiagnosticSession
    <1299>   DW_AT_decl_file   : 1
    <1299>   DW_AT_decl_line   : 735
    <129b>   DW_AT_decl_column : 6
    <129b>   DW_AT_prototyped  : 1
    <129b>   DW_AT_low_pc      : 0x8000f1c
    <129f>   DW_AT_high_pc     : 0xb8
    <12a3>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <12a5>   DW_AT_call_all_tail_calls: 1
    <12a5>   DW_AT_sibling     : <0x12c1>
 <2><12a9>: Abbrev Number: 23 (DW_TAG_lexical_block)
    <12aa>   DW_AT_low_pc      : 0x8000f6c
    <12ae>   DW_AT_high_pc     : 0x1a
 <3><12b2>: Abbrev Number: 26 (DW_TAG_variable)
    <12b3>   DW_AT_name        : i
    <12b5>   DW_AT_decl_file   : 1
    <12b5>   DW_AT_decl_line   : 747
    <12b7>   DW_AT_decl_column : 12
    <12b8>   DW_AT_type        : <0xead>
    <12bc>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <3><12bf>: Abbrev Number: 0
 <2><12c0>: Abbrev Number: 0
 <1><12c1>: Abbrev Number: 17 (DW_TAG_subprogram)
    <12c2>   DW_AT_external    : 1
    <12c2>   DW_AT_name        : (indirect string, offset: 0xb618e): FBL_DiagRoutine_ER_HardReset
    <12c6>   DW_AT_decl_file   : 1
    <12c6>   DW_AT_decl_line   : 727
    <12c8>   DW_AT_decl_column : 6
    <12c8>   DW_AT_prototyped  : 1
    <12c8>   DW_AT_low_pc      : 0x8000ee0
    <12cc>   DW_AT_high_pc     : 0x3c
    <12d0>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <12d2>   DW_AT_call_all_tail_calls: 1
    <12d2>   DW_AT_sibling     : <0x1305>
