Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x593 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 12 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x1c59a): GNU C11 12.3.1 20230626 -mcpu=cortex-m3 -mfloat-abi=soft -mthumb -march=armv7-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x472e): ../APPL/LoadCtrl/LoadCtrl.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x82f61): C:/Users/Daniel/Desktop/FG9322/PDM - Power Distributor Module/PDM_APP/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 2 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 1
    <2c>   DW_AT_encoding    : 6	(signed char)
    <2d>   DW_AT_name        : (indirect string, offset: 0x46bfb): signed char
 <1><31>: Abbrev Number: 3 (DW_TAG_typedef)
    <32>   DW_AT_name        : (indirect string, offset: 0x294a6): __uint8_t
    <36>   DW_AT_decl_file   : 2
    <37>   DW_AT_decl_line   : 43
    <38>   DW_AT_decl_column : 24
    <39>   DW_AT_type        : <0x3d>
 <1><3d>: Abbrev Number: 2 (DW_TAG_base_type)
    <3e>   DW_AT_byte_size   : 1
    <3f>   DW_AT_encoding    : 8	(unsigned char)
    <40>   DW_AT_name        : (indirect string, offset: 0x1cb55): unsigned char
 <1><44>: Abbrev Number: 2 (DW_TAG_base_type)
    <45>   DW_AT_byte_size   : 2
    <46>   DW_AT_encoding    : 5	(signed)
    <47>   DW_AT_name        : (indirect string, offset: 0x688ca): short int
 <1><4b>: Abbrev Number: 3 (DW_TAG_typedef)
    <4c>   DW_AT_name        : (indirect string, offset: 0x72807): __uint16_t
    <50>   DW_AT_decl_file   : 2
    <51>   DW_AT_decl_line   : 57
    <52>   DW_AT_decl_column : 25
    <53>   DW_AT_type        : <0x57>
 <1><57>: Abbrev Number: 2 (DW_TAG_base_type)
    <58>   DW_AT_byte_size   : 2
    <59>   DW_AT_encoding    : 7	(unsigned)
    <5a>   DW_AT_name        : (indirect string, offset: 0x2e973): short unsigned int
 <1><5e>: Abbrev Number: 2 (DW_TAG_base_type)
    <5f>   DW_AT_byte_size   : 4
    <60>   DW_AT_encoding    : 5	(signed)
    <61>   DW_AT_name        : (indirect string, offset: 0xc439): long int
 <1><65>: Abbrev Number: 3 (DW_TAG_typedef)
    <66>   DW_AT_name        : (indirect string, offset: 0x5981b): __uint32_t
    <6a>   DW_AT_decl_file   : 2
    <6b>   DW_AT_decl_line   : 79
    <6c>   DW_AT_decl_column : 25
    <6d>   DW_AT_type        : <0x71>
 <1><71>: Abbrev Number: 2 (DW_TAG_base_type)
    <72>   DW_AT_byte_size   : 4
    <73>   DW_AT_encoding    : 7	(unsigned)
    <74>   DW_AT_name        : (indirect string, offset: 0x21605): long unsigned int
 <1><78>: Abbrev Number: 2 (DW_TAG_base_type)
    <79>   DW_AT_byte_size   : 8
    <7a>   DW_AT_encoding    : 5	(signed)
    <7b>   DW_AT_name        : (indirect string, offset: 0x40bc0): long long int
 <1><7f>: Abbrev Number: 2 (DW_TAG_base_type)
    <80>   DW_AT_byte_size   : 8
    <81>   DW_AT_encoding    : 7	(unsigned)
    <82>   DW_AT_name        : (indirect string, offset: 0x1d6b1): long long unsigned int
 <1><86>: Abbrev Number: 13 (DW_TAG_base_type)
    <87>   DW_AT_byte_size   : 4
    <88>   DW_AT_encoding    : 5	(signed)
    <89>   DW_AT_name        : int
 <1><8d>: Abbrev Number: 2 (DW_TAG_base_type)
    <8e>   DW_AT_byte_size   : 4
    <8f>   DW_AT_encoding    : 7	(unsigned)
    <90>   DW_AT_name        : (indirect string, offset: 0xbd78): unsigned int
 <1><94>: Abbrev Number: 3 (DW_TAG_typedef)
    <95>   DW_AT_name        : (indirect string, offset: 0x294a8): uint8_t
    <99>   DW_AT_decl_file   : 3
    <9a>   DW_AT_decl_line   : 24
    <9b>   DW_AT_decl_column : 19
    <9c>   DW_AT_type        : <0x31>
 <1><a0>: Abbrev Number: 3 (DW_TAG_typedef)
    <a1>   DW_AT_name        : (indirect string, offset: 0x91d99): uint16_t
    <a5>   DW_AT_decl_file   : 3
    <a6>   DW_AT_decl_line   : 36
    <a7>   DW_AT_decl_column : 20
    <a8>   DW_AT_type        : <0x4b>
 <1><ac>: Abbrev Number: 3 (DW_TAG_typedef)
    <ad>   DW_AT_name        : (indirect string, offset: 0x91d49): uint32_t
    <b1>   DW_AT_decl_file   : 3
    <b2>   DW_AT_decl_line   : 48
    <b3>   DW_AT_decl_column : 20
    <b4>   DW_AT_type        : <0x65>
 <1><b8>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <b9>   DW_AT_type        : <0xac>
 <1><bd>: Abbrev Number: 3 (DW_TAG_typedef)
    <be>   DW_AT_name        : (indirect string, offset: 0x46ba0): uint8
    <c2>   DW_AT_decl_file   : 4
    <c3>   DW_AT_decl_line   : 6
    <c4>   DW_AT_decl_column : 17
    <c5>   DW_AT_type        : <0x94>
 <1><c9>: Abbrev Number: 3 (DW_TAG_typedef)
    <ca>   DW_AT_name        : (indirect string, offset: 0x82d36): uint16
    <ce>   DW_AT_decl_file   : 4
    <cf>   DW_AT_decl_line   : 7
    <d0>   DW_AT_decl_column : 18
    <d1>   DW_AT_type        : <0xa0>
 <1><d5>: Abbrev Number: 3 (DW_TAG_typedef)
    <d6>   DW_AT_name        : (indirect string, offset: 0x834c3): uint32
    <da>   DW_AT_decl_file   : 4
    <db>   DW_AT_decl_line   : 8
    <dc>   DW_AT_decl_column : 18
    <dd>   DW_AT_type        : <0xac>
 <1><e1>: Abbrev Number: 15 (DW_TAG_structure_type)
    <e2>   DW_AT_byte_size   : 28
    <e3>   DW_AT_decl_file   : 5
    <e4>   DW_AT_decl_line   : 358
    <e6>   DW_AT_decl_column : 9
    <e7>   DW_AT_sibling     : <0x140>
 <2><eb>: Abbrev Number: 5 (DW_TAG_member)
    <ec>   DW_AT_name        : CRL
    <f0>   DW_AT_decl_file   : 5
    <f0>   DW_AT_decl_line   : 360
    <f2>   DW_AT_decl_column : 17
    <f2>   DW_AT_type        : <0xb8>
    <f6>   DW_AT_data_member_location: 0
 <2><f7>: Abbrev Number: 5 (DW_TAG_member)
    <f8>   DW_AT_name        : CRH
    <fc>   DW_AT_decl_file   : 5
    <fc>   DW_AT_decl_line   : 361
    <fe>   DW_AT_decl_column : 17
    <fe>   DW_AT_type        : <0xb8>
    <102>   DW_AT_data_member_location: 4
 <2><103>: Abbrev Number: 5 (DW_TAG_member)
    <104>   DW_AT_name        : IDR
    <108>   DW_AT_decl_file   : 5
    <108>   DW_AT_decl_line   : 362
    <10a>   DW_AT_decl_column : 17
    <10a>   DW_AT_type        : <0xb8>
    <10e>   DW_AT_data_member_location: 8
 <2><10f>: Abbrev Number: 5 (DW_TAG_member)
    <110>   DW_AT_name        : ODR
    <114>   DW_AT_decl_file   : 5
    <114>   DW_AT_decl_line   : 363
    <116>   DW_AT_decl_column : 17
    <116>   DW_AT_type        : <0xb8>
    <11a>   DW_AT_data_member_location: 12
 <2><11b>: Abbrev Number: 7 (DW_TAG_member)
    <11c>   DW_AT_name        : (indirect string, offset: 0x1fd18): BSRR
    <120>   DW_AT_decl_file   : 5
    <120>   DW_AT_decl_line   : 364
    <122>   DW_AT_decl_column : 17
    <122>   DW_AT_type        : <0xb8>
    <126>   DW_AT_data_member_location: 16
 <2><127>: Abbrev Number: 5 (DW_TAG_member)
    <128>   DW_AT_name        : BRR
    <12c>   DW_AT_decl_file   : 5
    <12c>   DW_AT_decl_line   : 365
    <12e>   DW_AT_decl_column : 17
    <12e>   DW_AT_type        : <0xb8>
    <132>   DW_AT_data_member_location: 20
 <2><133>: Abbrev Number: 7 (DW_TAG_member)
    <134>   DW_AT_name        : (indirect string, offset: 0x7836a): LCKR
    <138>   DW_AT_decl_file   : 5
    <138>   DW_AT_decl_line   : 366
    <13a>   DW_AT_decl_column : 17
    <13a>   DW_AT_type        : <0xb8>
    <13e>   DW_AT_data_member_location: 24
 <2><13f>: Abbrev Number: 0
 <1><140>: Abbrev Number: 16 (DW_TAG_typedef)
    <141>   DW_AT_name        : (indirect string, offset: 0x87929): GPIO_TypeDef
    <145>   DW_AT_decl_file   : 5
    <146>   DW_AT_decl_line   : 367
    <148>   DW_AT_decl_column : 3
    <149>   DW_AT_type        : <0xe1>
 <1><14d>: Abbrev Number: 2 (DW_TAG_base_type)
    <14e>   DW_AT_byte_size   : 8
    <14f>   DW_AT_encoding    : 4	(float)
    <150>   DW_AT_name        : (indirect string, offset: 0xd70a): long double
 <1><154>: Abbrev Number: 17 (DW_TAG_enumeration_type)
    <155>   DW_AT_encoding    : 7	(unsigned)
    <156>   DW_AT_byte_size   : 1
    <157>   DW_AT_type        : <0x3d>
    <15b>   DW_AT_decl_file   : 6
    <15c>   DW_AT_decl_line   : 66
    <15d>   DW_AT_decl_column : 1
    <15e>   DW_AT_sibling     : <0x16f>
 <2><162>: Abbrev Number: 8 (DW_TAG_enumerator)
    <163>   DW_AT_name        : (indirect string, offset: 0x1d338): GPIO_PIN_RESET
    <167>   DW_AT_const_value : 0
 <2><168>: Abbrev Number: 8 (DW_TAG_enumerator)
    <169>   DW_AT_name        : (indirect string, offset: 0x18f1e): GPIO_PIN_SET
    <16d>   DW_AT_const_value : 1
 <2><16e>: Abbrev Number: 0
 <1><16f>: Abbrev Number: 3 (DW_TAG_typedef)
    <170>   DW_AT_name        : (indirect string, offset: 0x891c4): GPIO_PinState
    <174>   DW_AT_decl_file   : 6
    <175>   DW_AT_decl_line   : 69
    <176>   DW_AT_decl_column : 3
    <177>   DW_AT_type        : <0x154>
 <1><17b>: Abbrev Number: 2 (DW_TAG_base_type)
    <17c>   DW_AT_byte_size   : 1
    <17d>   DW_AT_encoding    : 8	(unsigned char)
    <17e>   DW_AT_name        : (indirect string, offset: 0x8f941): char
 <1><182>: Abbrev Number: 2 (DW_TAG_base_type)
    <183>   DW_AT_byte_size   : 4
    <184>   DW_AT_encoding    : 4	(float)
    <185>   DW_AT_name        : (indirect string, offset: 0x785d3): float
 <1><189>: Abbrev Number: 2 (DW_TAG_base_type)
    <18a>   DW_AT_byte_size   : 8
    <18b>   DW_AT_encoding    : 4	(float)
    <18c>   DW_AT_name        : (indirect string, offset: 0x8ea3c): double
 <1><190>: Abbrev Number: 1 (DW_TAG_variable)
    <191>   DW_AT_name        : (indirect string, offset: 0x5b55b): LoadCtrl_MainCounter
    <195>   DW_AT_decl_file   : 1
    <195>   DW_AT_decl_line   : 6
    <196>   DW_AT_decl_column : 8
    <197>   DW_AT_type        : <0xd5>
    <19b>   DW_AT_external    : 1
    <19b>   DW_AT_location    : 5 byte block: 3 bc 0 0 20 	(DW_OP_addr: 200000bc)
 <1><1a1>: Abbrev Number: 1 (DW_TAG_variable)
    <1a2>   DW_AT_name        : (indirect string, offset: 0x20420): LoadCtrl_AnalogVoltValue
    <1a6>   DW_AT_decl_file   : 1
    <1a6>   DW_AT_decl_line   : 7
    <1a7>   DW_AT_decl_column : 8
    <1a8>   DW_AT_type        : <0xd5>
    <1ac>   DW_AT_external    : 1
    <1ac>   DW_AT_location    : 5 byte block: 3 c0 0 0 20 	(DW_OP_addr: 200000c0)
 <1><1b2>: Abbrev Number: 1 (DW_TAG_variable)
    <1b3>   DW_AT_name        : (indirect string, offset: 0x1ba6): LoadCtrl_AnalogCurrentValue
    <1b7>   DW_AT_decl_file   : 1
    <1b7>   DW_AT_decl_line   : 8
    <1b8>   DW_AT_decl_column : 8
    <1b9>   DW_AT_type        : <0xd5>
    <1bd>   DW_AT_external    : 1
    <1bd>   DW_AT_location    : 5 byte block: 3 c4 0 0 20 	(DW_OP_addr: 200000c4)
 <1><1c3>: Abbrev Number: 9 (DW_TAG_array_type)
    <1c4>   DW_AT_type        : <0xbd>
    <1c8>   DW_AT_sibling     : <0x1d3>
 <2><1cc>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <1cd>   DW_AT_type        : <0x8d>
    <1d1>   DW_AT_upper_bound : 7
 <2><1d2>: Abbrev Number: 0
 <1><1d3>: Abbrev Number: 1 (DW_TAG_variable)
    <1d4>   DW_AT_name        : (indirect string, offset: 0x85aeb): LoadCtrl_StatusList
    <1d8>   DW_AT_decl_file   : 1
    <1d8>   DW_AT_decl_line   : 9
    <1d9>   DW_AT_decl_column : 7
    <1da>   DW_AT_type        : <0x1c3>
    <1de>   DW_AT_external    : 1
    <1de>   DW_AT_location    : 5 byte block: 3 c8 0 0 20 	(DW_OP_addr: 200000c8)
 <1><1e4>: Abbrev Number: 1 (DW_TAG_variable)
    <1e5>   DW_AT_name        : (indirect string, offset: 0x85ae7): DiagLoadCtrl_StatusList
    <1e9>   DW_AT_decl_file   : 1
    <1e9>   DW_AT_decl_line   : 10
    <1ea>   DW_AT_decl_column : 7
    <1eb>   DW_AT_type        : <0x1c3>
    <1ef>   DW_AT_external    : 1
    <1ef>   DW_AT_location    : 5 byte block: 3 d0 0 0 20 	(DW_OP_addr: 200000d0)
 <1><1f5>: Abbrev Number: 1 (DW_TAG_variable)
    <1f6>   DW_AT_name        : (indirect string, offset: 0x41fbb): LoadCtrl_VoltValueToActualAmperage
    <1fa>   DW_AT_decl_file   : 1
    <1fa>   DW_AT_decl_line   : 11
    <1fb>   DW_AT_decl_column : 7
    <1fc>   DW_AT_type        : <0x182>
    <200>   DW_AT_external    : 1
    <200>   DW_AT_location    : 5 byte block: 3 d8 0 0 20 	(DW_OP_addr: 200000d8)
 <1><206>: Abbrev Number: 1 (DW_TAG_variable)
    <207>   DW_AT_name        : (indirect string, offset: 0xbef7): LoadCtrl_AdcVoltToActualVolt
    <20b>   DW_AT_decl_file   : 1
    <20b>   DW_AT_decl_line   : 12
    <20c>   DW_AT_decl_column : 7
    <20d>   DW_AT_type        : <0x182>
    <211>   DW_AT_external    : 1
    <211>   DW_AT_location    : 5 byte block: 3 dc 0 0 20 	(DW_OP_addr: 200000dc)
 <1><217>: Abbrev Number: 1 (DW_TAG_variable)
    <218>   DW_AT_name        : (indirect string, offset: 0x407f6): CanH_RxSig_CommandList1
    <21c>   DW_AT_decl_file   : 1
    <21c>   DW_AT_decl_line   : 13
    <21d>   DW_AT_decl_column : 7
    <21e>   DW_AT_type        : <0xbd>
    <222>   DW_AT_external    : 1
    <222>   DW_AT_location    : 5 byte block: 3 0 0 0 20 	(DW_OP_addr: 20000000)
 <1><228>: Abbrev Number: 1 (DW_TAG_variable)
    <229>   DW_AT_name        : (indirect string, offset: 0x4080e): CanH_RxSig_CommandList2
    <22d>   DW_AT_decl_file   : 1
    <22d>   DW_AT_decl_line   : 14
    <22e>   DW_AT_decl_column : 7
    <22f>   DW_AT_type        : <0xbd>
    <233>   DW_AT_external    : 1
    <233>   DW_AT_location    : 5 byte block: 3 1 0 0 20 	(DW_OP_addr: 20000001)
 <1><239>: Abbrev Number: 1 (DW_TAG_variable)
    <23a>   DW_AT_name        : (indirect string, offset: 0x40826): CanH_RxSig_CommandList3
    <23e>   DW_AT_decl_file   : 1
    <23e>   DW_AT_decl_line   : 15
    <23f>   DW_AT_decl_column : 7
    <240>   DW_AT_type        : <0xbd>
    <244>   DW_AT_external    : 1
    <244>   DW_AT_location    : 5 byte block: 3 2 0 0 20 	(DW_OP_addr: 20000002)
 <1><24a>: Abbrev Number: 1 (DW_TAG_variable)
    <24b>   DW_AT_name        : (indirect string, offset: 0x4083e): CanH_RxSig_CommandList4
    <24f>   DW_AT_decl_file   : 1
    <24f>   DW_AT_decl_line   : 16
    <250>   DW_AT_decl_column : 7
    <251>   DW_AT_type        : <0xbd>
    <255>   DW_AT_external    : 1
    <255>   DW_AT_location    : 5 byte block: 3 3 0 0 20 	(DW_OP_addr: 20000003)
 <1><25b>: Abbrev Number: 1 (DW_TAG_variable)
    <25c>   DW_AT_name        : (indirect string, offset: 0x40856): CanH_RxSig_CommandList5
    <260>   DW_AT_decl_file   : 1
    <260>   DW_AT_decl_line   : 17
    <261>   DW_AT_decl_column : 7
    <262>   DW_AT_type        : <0xbd>
    <266>   DW_AT_external    : 1
    <266>   DW_AT_location    : 5 byte block: 3 4 0 0 20 	(DW_OP_addr: 20000004)
 <1><26c>: Abbrev Number: 1 (DW_TAG_variable)
    <26d>   DW_AT_name        : (indirect string, offset: 0x5d8e7): CanH_RxSig_CommandList6
    <271>   DW_AT_decl_file   : 1
    <271>   DW_AT_decl_line   : 18
    <272>   DW_AT_decl_column : 7
    <273>   DW_AT_type        : <0xbd>
    <277>   DW_AT_external    : 1
    <277>   DW_AT_location    : 5 byte block: 3 5 0 0 20 	(DW_OP_addr: 20000005)
 <1><27d>: Abbrev Number: 1 (DW_TAG_variable)
    <27e>   DW_AT_name        : (indirect string, offset: 0x4089d): CanH_RxSig_CommandList7
    <282>   DW_AT_decl_file   : 1
    <282>   DW_AT_decl_line   : 19
    <283>   DW_AT_decl_column : 7
    <284>   DW_AT_type        : <0xbd>
    <288>   DW_AT_external    : 1
    <288>   DW_AT_location    : 5 byte block: 3 6 0 0 20 	(DW_OP_addr: 20000006)
 <1><28e>: Abbrev Number: 1 (DW_TAG_variable)
    <28f>   DW_AT_name        : (indirect string, offset: 0x408b5): CanH_RxSig_CommandList8
    <293>   DW_AT_decl_file   : 1
    <293>   DW_AT_decl_line   : 20
    <294>   DW_AT_decl_column : 7
    <295>   DW_AT_type        : <0xbd>
    <299>   DW_AT_external    : 1
    <299>   DW_AT_location    : 5 byte block: 3 7 0 0 20 	(DW_OP_addr: 20000007)
 <1><29f>: Abbrev Number: 1 (DW_TAG_variable)
    <2a0>   DW_AT_name        : (indirect string, offset: 0x1edc6): CanH_TxSig_StatusList1
    <2a4>   DW_AT_decl_file   : 1
    <2a4>   DW_AT_decl_line   : 21
    <2a5>   DW_AT_decl_column : 7
    <2a6>   DW_AT_type        : <0xbd>
    <2aa>   DW_AT_external    : 1
    <2aa>   DW_AT_location    : 5 byte block: 3 e0 0 0 20 	(DW_OP_addr: 200000e0)
 <1><2b0>: Abbrev Number: 1 (DW_TAG_variable)
    <2b1>   DW_AT_name        : (indirect string, offset: 0x1eddd): CanH_TxSig_StatusList2
    <2b5>   DW_AT_decl_file   : 1
    <2b5>   DW_AT_decl_line   : 22
    <2b6>   DW_AT_decl_column : 7
    <2b7>   DW_AT_type        : <0xbd>
    <2bb>   DW_AT_external    : 1
    <2bb>   DW_AT_location    : 5 byte block: 3 e1 0 0 20 	(DW_OP_addr: 200000e1)
 <1><2c1>: Abbrev Number: 1 (DW_TAG_variable)
    <2c2>   DW_AT_name        : (indirect string, offset: 0x1edf4): CanH_TxSig_StatusList3
    <2c6>   DW_AT_decl_file   : 1
    <2c6>   DW_AT_decl_line   : 23
    <2c7>   DW_AT_decl_column : 7
    <2c8>   DW_AT_type        : <0xbd>
    <2cc>   DW_AT_external    : 1
    <2cc>   DW_AT_location    : 5 byte block: 3 e2 0 0 20 	(DW_OP_addr: 200000e2)
 <1><2d2>: Abbrev Number: 1 (DW_TAG_variable)
    <2d3>   DW_AT_name        : (indirect string, offset: 0x1ee0b): CanH_TxSig_StatusList4
    <2d7>   DW_AT_decl_file   : 1
    <2d7>   DW_AT_decl_line   : 24
    <2d8>   DW_AT_decl_column : 7
    <2d9>   DW_AT_type        : <0xbd>
    <2dd>   DW_AT_external    : 1
    <2dd>   DW_AT_location    : 5 byte block: 3 e3 0 0 20 	(DW_OP_addr: 200000e3)
 <1><2e3>: Abbrev Number: 1 (DW_TAG_variable)
    <2e4>   DW_AT_name        : (indirect string, offset: 0x1ee22): CanH_TxSig_StatusList5
    <2e8>   DW_AT_decl_file   : 1
    <2e8>   DW_AT_decl_line   : 25
    <2e9>   DW_AT_decl_column : 7
    <2ea>   DW_AT_type        : <0xbd>
    <2ee>   DW_AT_external    : 1
    <2ee>   DW_AT_location    : 5 byte block: 3 e4 0 0 20 	(DW_OP_addr: 200000e4)
 <1><2f4>: Abbrev Number: 1 (DW_TAG_variable)
    <2f5>   DW_AT_name        : (indirect string, offset: 0x1ee39): CanH_TxSig_StatusList6
    <2f9>   DW_AT_decl_file   : 1
    <2f9>   DW_AT_decl_line   : 26
    <2fa>   DW_AT_decl_column : 7
    <2fb>   DW_AT_type        : <0xbd>
    <2ff>   DW_AT_external    : 1
    <2ff>   DW_AT_location    : 5 byte block: 3 e5 0 0 20 	(DW_OP_addr: 200000e5)
 <1><305>: Abbrev Number: 1 (DW_TAG_variable)
    <306>   DW_AT_name        : (indirect string, offset: 0x1ee50): CanH_TxSig_StatusList7
    <30a>   DW_AT_decl_file   : 1
    <30a>   DW_AT_decl_line   : 27
    <30b>   DW_AT_decl_column : 7
    <30c>   DW_AT_type        : <0xbd>
    <310>   DW_AT_external    : 1
    <310>   DW_AT_location    : 5 byte block: 3 e6 0 0 20 	(DW_OP_addr: 200000e6)
 <1><316>: Abbrev Number: 1 (DW_TAG_variable)
    <317>   DW_AT_name        : (indirect string, offset: 0x59826): CanH_TxSig_StatusList8
    <31b>   DW_AT_decl_file   : 1
    <31b>   DW_AT_decl_line   : 28
    <31c>   DW_AT_decl_column : 7
    <31d>   DW_AT_type        : <0xbd>
    <321>   DW_AT_external    : 1
    <321>   DW_AT_location    : 5 byte block: 3 e7 0 0 20 	(DW_OP_addr: 200000e7)
 <1><327>: Abbrev Number: 1 (DW_TAG_variable)
    <328>   DW_AT_name        : (indirect string, offset: 0x1f8b0): CanH_TxSig_SupplyVoltage
    <32c>   DW_AT_decl_file   : 1
    <32c>   DW_AT_decl_line   : 29
    <32d>   DW_AT_decl_column : 7
    <32e>   DW_AT_type        : <0xbd>
    <332>   DW_AT_external    : 1
    <332>   DW_AT_location    : 5 byte block: 3 e8 0 0 20 	(DW_OP_addr: 200000e8)
 <1><338>: Abbrev Number: 1 (DW_TAG_variable)
    <339>   DW_AT_name        : (indirect string, offset: 0x8e94): CanH_TxSig_TotalCurrentConsumption
    <33d>   DW_AT_decl_file   : 1
    <33d>   DW_AT_decl_line   : 30
    <33e>   DW_AT_decl_column : 7
    <33f>   DW_AT_type        : <0xbd>
    <343>   DW_AT_external    : 1
    <343>   DW_AT_location    : 5 byte block: 3 e9 0 0 20 	(DW_OP_addr: 200000e9)
 <1><349>: Abbrev Number: 1 (DW_TAG_variable)
    <34a>   DW_AT_name        : (indirect string, offset: 0x4cc): CanH_TxSig_PowerSupplyNetworkWarning
    <34e>   DW_AT_decl_file   : 1
    <34e>   DW_AT_decl_line   : 31
    <34f>   DW_AT_decl_column : 7
    <350>   DW_AT_type        : <0xbd>
    <354>   DW_AT_external    : 1
    <354>   DW_AT_location    : 5 byte block: 3 ea 0 0 20 	(DW_OP_addr: 200000ea)
 <1><35a>: Abbrev Number: 1 (DW_TAG_variable)
    <35b>   DW_AT_name        : (indirect string, offset: 0x259fe): Param_MaxVoltageValue
    <35f>   DW_AT_decl_file   : 1
    <35f>   DW_AT_decl_line   : 32
    <360>   DW_AT_decl_column : 7
    <361>   DW_AT_type        : <0xbd>
    <365>   DW_AT_external    : 1
    <365>   DW_AT_location    : 5 byte block: 3 eb 0 0 20 	(DW_OP_addr: 200000eb)
 <1><36b>: Abbrev Number: 1 (DW_TAG_variable)
    <36c>   DW_AT_name        : (indirect string, offset: 0x5f50d): Param_MinVoltageValue
    <370>   DW_AT_decl_file   : 1
    <370>   DW_AT_decl_line   : 33
    <371>   DW_AT_decl_column : 7
    <372>   DW_AT_type        : <0xbd>
    <376>   DW_AT_external    : 1
    <376>   DW_AT_location    : 5 byte block: 3 ec 0 0 20 	(DW_OP_addr: 200000ec)
 <1><37c>: Abbrev Number: 1 (DW_TAG_variable)
    <37d>   DW_AT_name        : (indirect string, offset: 0x4a42d): Param_CurrentSensorCalibrationFactor
    <381>   DW_AT_decl_file   : 1
    <381>   DW_AT_decl_line   : 34
    <382>   DW_AT_decl_column : 7
    <383>   DW_AT_type        : <0xbd>
    <387>   DW_AT_external    : 1
    <387>   DW_AT_location    : 5 byte block: 3 ed 0 0 20 	(DW_OP_addr: 200000ed)
 <1><38d>: Abbrev Number: 1 (DW_TAG_variable)
    <38e>   DW_AT_name        : (indirect string, offset: 0x24e08): Param_NoLoadCurrentValueOnSensor
    <392>   DW_AT_decl_file   : 1
    <392>   DW_AT_decl_line   : 35
    <393>   DW_AT_decl_column : 8
    <394>   DW_AT_type        : <0xc9>
    <398>   DW_AT_external    : 1
    <398>   DW_AT_location    : 5 byte block: 3 ee 0 0 20 	(DW_OP_addr: 200000ee)
 <1><39e>: Abbrev Number: 1 (DW_TAG_variable)
    <39f>   DW_AT_name        : (indirect string, offset: 0x26176): Param_NominalCurrentRating
    <3a3>   DW_AT_decl_file   : 1
    <3a3>   DW_AT_decl_line   : 36
    <3a4>   DW_AT_decl_column : 7
    <3a5>   DW_AT_type        : <0xbd>
    <3a9>   DW_AT_external    : 1
    <3a9>   DW_AT_location    : 5 byte block: 3 f0 0 0 20 	(DW_OP_addr: 200000f0)
 <1><3af>: Abbrev Number: 1 (DW_TAG_variable)
    <3b0>   DW_AT_name        : (indirect string, offset: 0x563f): Param_MaximumCurrentRating
    <3b4>   DW_AT_decl_file   : 1
    <3b4>   DW_AT_decl_line   : 37
    <3b5>   DW_AT_decl_column : 7
    <3b6>   DW_AT_type        : <0xbd>
    <3ba>   DW_AT_external    : 1
    <3ba>   DW_AT_location    : 5 byte block: 3 f1 0 0 20 	(DW_OP_addr: 200000f1)
 <1><3c0>: Abbrev Number: 1 (DW_TAG_variable)
    <3c1>   DW_AT_name        : (indirect string, offset: 0x8b7ee): Param_I2tRating
    <3c5>   DW_AT_decl_file   : 1
    <3c5>   DW_AT_decl_line   : 38
    <3c6>   DW_AT_decl_column : 7
    <3c7>   DW_AT_type        : <0xbd>
    <3cb>   DW_AT_external    : 1
    <3cb>   DW_AT_location    : 5 byte block: 3 f2 0 0 20 	(DW_OP_addr: 200000f2)
 <1><3d1>: Abbrev Number: 1 (DW_TAG_variable)
    <3d2>   DW_AT_name        : (indirect string, offset: 0x499aa): Param_MaxAdcRange
    <3d6>   DW_AT_decl_file   : 1
    <3d6>   DW_AT_decl_line   : 39
    <3d7>   DW_AT_decl_column : 8
    <3d8>   DW_AT_type        : <0xc9>
    <3dc>   DW_AT_external    : 1
    <3dc>   DW_AT_location    : 5 byte block: 3 f4 0 0 20 	(DW_OP_addr: 200000f4)
 <1><3e2>: Abbrev Number: 1 (DW_TAG_variable)
    <3e3>   DW_AT_name        : (indirect string, offset: 0x7bdfe): Param_AdcVrefIntTyp
    <3e7>   DW_AT_decl_file   : 1
    <3e7>   DW_AT_decl_line   : 40
    <3e8>   DW_AT_decl_column : 8
    <3e9>   DW_AT_type        : <0xc9>
    <3ed>   DW_AT_external    : 1
    <3ed>   DW_AT_location    : 5 byte block: 3 f6 0 0 20 	(DW_OP_addr: 200000f6)
 <1><3f3>: Abbrev Number: 1 (DW_TAG_variable)
    <3f4>   DW_AT_name        : (indirect string, offset: 0x28110): Param_VoltMaxValue16
    <3f8>   DW_AT_decl_file   : 1
    <3f8>   DW_AT_decl_line   : 41
    <3f9>   DW_AT_decl_column : 8
    <3fa>   DW_AT_type        : <0xc9>
    <3fe>   DW_AT_external    : 1
    <3fe>   DW_AT_location    : 5 byte block: 3 f8 0 0 20 	(DW_OP_addr: 200000f8)
 <1><404>: Abbrev Number: 1 (DW_TAG_variable)
    <405>   DW_AT_name        : (indirect string, offset: 0x2272c): Param_VarefStandard
    <409>   DW_AT_decl_file   : 1
    <409>   DW_AT_decl_line   : 42
    <40a>   DW_AT_decl_column : 8
    <40b>   DW_AT_type        : <0xc9>
    <40f>   DW_AT_external    : 1
    <40f>   DW_AT_location    : 5 byte block: 3 fa 0 0 20 	(DW_OP_addr: 200000fa)
 <1><415>: Abbrev Number: 1 (DW_TAG_variable)
    <416>   DW_AT_name        : (indirect string, offset: 0x88fc3): Param_MaxOutSns
    <41a>   DW_AT_decl_file   : 1
    <41a>   DW_AT_decl_line   : 43
    <41b>   DW_AT_decl_column : 8
    <41c>   DW_AT_type        : <0xc9>
    <420>   DW_AT_external    : 1
    <420>   DW_AT_location    : 5 byte block: 3 fc 0 0 20 	(DW_OP_addr: 200000fc)
 <1><426>: Abbrev Number: 1 (DW_TAG_variable)
    <427>   DW_AT_name        : (indirect string, offset: 0x4ecb3): LoadCtrl_I2tCounter
    <42b>   DW_AT_decl_file   : 1
    <42b>   DW_AT_decl_line   : 44
    <42c>   DW_AT_decl_column : 41
    <42d>   DW_AT_type        : <0xd5>
    <431>   DW_AT_external    : 1
    <431>   DW_AT_location    : 5 byte block: 3 0 4c 0 20 	(DW_OP_addr: 20004c00)
 <1><437>: Abbrev Number: 1 (DW_TAG_variable)
    <438>   DW_AT_name        : (indirect string, offset: 0x7a466): LoadCtrl_SwitchOffFlag
    <43c>   DW_AT_decl_file   : 1
    <43c>   DW_AT_decl_line   : 45
    <43d>   DW_AT_decl_column : 40
    <43e>   DW_AT_type        : <0xbd>
    <442>   DW_AT_external    : 1
    <442>   DW_AT_location    : 5 byte block: 3 4 4c 0 20 	(DW_OP_addr: 20004c04)
 <1><448>: Abbrev Number: 1 (DW_TAG_variable)
    <449>   DW_AT_name        : (indirect string, offset: 0x89e43): LoadCtrl_PermanentSwitchOff_Rin2
    <44d>   DW_AT_decl_file   : 1
    <44d>   DW_AT_decl_line   : 46
    <44e>   DW_AT_decl_column : 40
    <44f>   DW_AT_type        : <0xbd>
    <453>   DW_AT_external    : 1
    <453>   DW_AT_location    : 5 byte block: 3 5 4c 0 20 	(DW_OP_addr: 20004c05)
 <1><459>: Abbrev Number: 1 (DW_TAG_variable)
    <45a>   DW_AT_name        : (indirect string, offset: 0x89eaa): LoadCtrl_PermanentSwitchOff_Rin3
    <45e>   DW_AT_decl_file   : 1
    <45e>   DW_AT_decl_line   : 47
    <45f>   DW_AT_decl_column : 40
    <460>   DW_AT_type        : <0xbd>
    <464>   DW_AT_external    : 1
    <464>   DW_AT_location    : 5 byte block: 3 6 4c 0 20 	(DW_OP_addr: 20004c06)
 <1><46a>: Abbrev Number: 1 (DW_TAG_variable)
    <46b>   DW_AT_name        : (indirect string, offset: 0x35c75): LoadCtrl_PermanentSwitchOff_Rin4
    <46f>   DW_AT_decl_file   : 1
    <46f>   DW_AT_decl_line   : 48
    <470>   DW_AT_decl_column : 40
    <471>   DW_AT_type        : <0xbd>
    <475>   DW_AT_external    : 1
    <475>   DW_AT_location    : 5 byte block: 3 7 4c 0 20 	(DW_OP_addr: 20004c07)
 <1><47b>: Abbrev Number: 1 (DW_TAG_variable)
    <47c>   DW_AT_name        : (indirect string, offset: 0x47266): LoadCtrl_Rin2Counter
    <480>   DW_AT_decl_file   : 1
    <480>   DW_AT_decl_line   : 49
    <481>   DW_AT_decl_column : 40
    <482>   DW_AT_type        : <0xbd>
    <486>   DW_AT_external    : 1
    <486>   DW_AT_location    : 5 byte block: 3 8 4c 0 20 	(DW_OP_addr: 20004c08)
 <1><48c>: Abbrev Number: 1 (DW_TAG_variable)
    <48d>   DW_AT_name        : (indirect string, offset: 0x45970): LoadCtrl_Rin3Counter
    <491>   DW_AT_decl_file   : 1
    <491>   DW_AT_decl_line   : 50
    <492>   DW_AT_decl_column : 40
    <493>   DW_AT_type        : <0xbd>
    <497>   DW_AT_external    : 1
    <497>   DW_AT_location    : 5 byte block: 3 9 4c 0 20 	(DW_OP_addr: 20004c09)
 <1><49d>: Abbrev Number: 1 (DW_TAG_variable)
    <49e>   DW_AT_name        : (indirect string, offset: 0x43b10): LoadCtrl_Rin4Counter
    <4a2>   DW_AT_decl_file   : 1
    <4a2>   DW_AT_decl_line   : 51
    <4a3>   DW_AT_decl_column : 40
    <4a4>   DW_AT_type        : <0xbd>
    <4a8>   DW_AT_external    : 1
    <4a8>   DW_AT_location    : 5 byte block: 3 a 4c 0 20 	(DW_OP_addr: 20004c0a)
 <1><4ae>: Abbrev Number: 1 (DW_TAG_variable)
    <4af>   DW_AT_name        : (indirect string, offset: 0xdca3): LoadCtrl_LockRin2
    <4b3>   DW_AT_decl_file   : 1
    <4b3>   DW_AT_decl_line   : 52
    <4b4>   DW_AT_decl_column : 40
    <4b5>   DW_AT_type        : <0xbd>
    <4b9>   DW_AT_external    : 1
    <4b9>   DW_AT_location    : 5 byte block: 3 b 4c 0 20 	(DW_OP_addr: 20004c0b)
 <1><4bf>: Abbrev Number: 1 (DW_TAG_variable)
    <4c0>   DW_AT_name        : (indirect string, offset: 0xdcb5): LoadCtrl_LockRin3
    <4c4>   DW_AT_decl_file   : 1
    <4c4>   DW_AT_decl_line   : 53
    <4c5>   DW_AT_decl_column : 40
    <4c6>   DW_AT_type        : <0xbd>
    <4ca>   DW_AT_external    : 1
    <4ca>   DW_AT_location    : 5 byte block: 3 c 4c 0 20 	(DW_OP_addr: 20004c0c)
 <1><4d0>: Abbrev Number: 1 (DW_TAG_variable)
    <4d1>   DW_AT_name        : (indirect string, offset: 0xdcc7): LoadCtrl_LockRin4
    <4d5>   DW_AT_decl_file   : 1
    <4d5>   DW_AT_decl_line   : 54
    <4d6>   DW_AT_decl_column : 40
    <4d7>   DW_AT_type        : <0xbd>
    <4db>   DW_AT_external    : 1
    <4db>   DW_AT_location    : 5 byte block: 3 d 4c 0 20 	(DW_OP_addr: 20004c0d)
 <1><4e1>: Abbrev Number: 9 (DW_TAG_array_type)
    <4e2>   DW_AT_type        : <0xd5>
    <4e6>   DW_AT_sibling     : <0x4f1>
 <2><4ea>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <4eb>   DW_AT_type        : <0x8d>
    <4ef>   DW_AT_upper_bound : 3
 <2><4f0>: Abbrev Number: 0
 <1><4f1>: Abbrev Number: 18 (DW_TAG_variable)
    <4f2>   DW_AT_name        : (indirect string, offset: 0x4fff1): Ain_Buffer
    <4f6>   DW_AT_decl_file   : 1
    <4f7>   DW_AT_decl_line   : 55
    <4f8>   DW_AT_decl_column : 15
    <4f9>   DW_AT_type        : <0x4e1>
    <4fd>   DW_AT_external    : 1
    <4fd>   DW_AT_declaration : 1
 <1><4fd>: Abbrev Number: 11 (DW_TAG_subprogram)
    <4fe>   DW_AT_external    : 1
    <4fe>   DW_AT_name        : (indirect string, offset: 0x192ea): HAL_GPIO_WritePin
    <502>   DW_AT_decl_file   : 6
    <503>   DW_AT_decl_line   : 235
    <504>   DW_AT_decl_column : 6
    <505>   DW_AT_prototyped  : 1
    <505>   DW_AT_declaration : 1
    <505>   DW_AT_sibling     : <0x519>
 <2><509>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <50a>   DW_AT_type        : <0x519>
 <2><50e>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <50f>   DW_AT_type        : <0xa0>
 <2><513>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <514>   DW_AT_type        : <0x16f>
 <2><518>: Abbrev Number: 0
 <1><519>: Abbrev Number: 19 (DW_TAG_pointer_type)
    <51a>   DW_AT_byte_size   : 4
    <51b>   DW_AT_type        : <0x140>
 <1><51f>: Abbrev Number: 11 (DW_TAG_subprogram)
    <520>   DW_AT_external    : 1
    <520>   DW_AT_name        : (indirect string, offset: 0x6292b): Dem_SetDtc
    <524>   DW_AT_decl_file   : 7
    <525>   DW_AT_decl_line   : 18
    <526>   DW_AT_decl_column : 13
    <527>   DW_AT_prototyped  : 1
    <527>   DW_AT_declaration : 1
    <527>   DW_AT_sibling     : <0x53b>
 <2><52b>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <52c>   DW_AT_type        : <0xbd>
 <2><530>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <531>   DW_AT_type        : <0xd5>
 <2><535>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <536>   DW_AT_type        : <0xbd>
 <2><53a>: Abbrev Number: 0
 <1><53b>: Abbrev Number: 20 (DW_TAG_subprogram)
    <53c>   DW_AT_external    : 1
    <53c>   DW_AT_name        : (indirect string, offset: 0x7418d): LoadCtrl_MainFunction
    <540>   DW_AT_decl_file   : 1
    <541>   DW_AT_decl_line   : 59
    <542>   DW_AT_decl_column : 6
    <543>   DW_AT_prototyped  : 1
    <543>   DW_AT_low_pc      : 0x8004f74
    <547>   DW_AT_high_pc     : 0x8c8
    <54b>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <54d>   DW_AT_call_all_tail_calls: 1
 <2><54d>: Abbrev Number: 6 (DW_TAG_variable)
    <54e>   DW_AT_name        : (indirect string, offset: 0x5d4f6): aux1
    <552>   DW_AT_decl_file   : 1
    <552>   DW_AT_decl_line   : 61
    <553>   DW_AT_decl_column : 15
    <553>   DW_AT_type        : <0x182>
    <557>   DW_AT_location    : 5 byte block: 3 0 1 0 20 	(DW_OP_addr: 20000100)
 <2><55d>: Abbrev Number: 6 (DW_TAG_variable)
    <55e>   DW_AT_name        : (indirect string, offset: 0x5d4fb): aux2
    <562>   DW_AT_decl_file   : 1
    <562>   DW_AT_decl_line   : 62
    <563>   DW_AT_decl_column : 15
    <563>   DW_AT_type        : <0x182>
    <567>   DW_AT_location    : 5 byte block: 3 4 1 0 20 	(DW_OP_addr: 20000104)
 <2><56d>: Abbrev Number: 6 (DW_TAG_variable)
    <56e>   DW_AT_name        : (indirect string, offset: 0x5d500): aux3
    <572>   DW_AT_decl_file   : 1
    <572>   DW_AT_decl_line   : 63
    <573>   DW_AT_decl_column : 15
    <573>   DW_AT_type        : <0x182>
    <577>   DW_AT_location    : 5 byte block: 3 8 1 0 20 	(DW_OP_addr: 20000108)
 <2><57d>: Abbrev Number: 21 (DW_TAG_lexical_block)
    <57e>   DW_AT_low_pc      : 0x8005706
    <582>   DW_AT_high_pc     : 0x8e
 <3><586>: Abbrev Number: 22 (DW_TAG_variable)
    <587>   DW_AT_name        : i
    <589>   DW_AT_decl_file   : 1
    <58a>   DW_AT_decl_line   : 374
    <58c>   DW_AT_decl_column : 13
    <58d>   DW_AT_type        : <0xbd>
    <591>   DW_AT_location    : 2 byte block: 91 6f 	(DW_OP_fbreg: -17)
 <3><594>: Abbrev Number: 0
 <2><595>: Abbrev Number: 0
 <1><596>: Abbrev Number: 0
  Compilation Unit @ offset 0x597:
   Length:        0xaea (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x146
   Pointer Size:  4
 <0><5a3>: Abbrev Number: 22 (DW_TAG_compile_unit)
    <5a4>   DW_AT_producer    : (indirect string, offset: 0x1c59a): GNU C11 12.3.1 20230626 -mcpu=cortex-m3 -mfloat-abi=soft -mthumb -march=armv7-m -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <5a8>   DW_AT_language    : 29	(C11)
    <5a9>   DW_AT_name        : (indirect string, offset: 0x8c508): ../BSW/Com/CanH/CanH.c
    <5ad>   DW_AT_comp_dir    : (indirect string, offset: 0x82f61): C:/Users/Daniel/Desktop/FG9322/PDM - Power Distributor Module/PDM_APP/Debug
    <5b1>   DW_AT_ranges      : 0x20
    <5b5>   DW_AT_low_pc      : 0
    <5b9>   DW_AT_stmt_list   : 0xd69
    <5bd>   DW_AT_macros      : 0x16b4e
 <1><5c1>: Abbrev Number: 8 (DW_TAG_base_type)
    <5c2>   DW_AT_byte_size   : 1
    <5c3>   DW_AT_encoding    : 6	(signed char)
    <5c4>   DW_AT_name        : (indirect string, offset: 0x46bfb): signed char
 <1><5c8>: Abbrev Number: 4 (DW_TAG_typedef)
    <5c9>   DW_AT_name        : (indirect string, offset: 0x294a6): __uint8_t
    <5cd>   DW_AT_decl_file   : 2
    <5ce>   DW_AT_decl_line   : 43
    <5cf>   DW_AT_decl_column : 24
    <5d0>   DW_AT_type        : <0x5d4>
 <1><5d4>: Abbrev Number: 8 (DW_TAG_base_type)
    <5d5>   DW_AT_byte_size   : 1
    <5d6>   DW_AT_encoding    : 8	(unsigned char)
    <5d7>   DW_AT_name        : (indirect string, offset: 0x1cb55): unsigned char
 <1><5db>: Abbrev Number: 8 (DW_TAG_base_type)
    <5dc>   DW_AT_byte_size   : 2
    <5dd>   DW_AT_encoding    : 5	(signed)
    <5de>   DW_AT_name        : (indirect string, offset: 0x688ca): short int
 <1><5e2>: Abbrev Number: 8 (DW_TAG_base_type)
    <5e3>   DW_AT_byte_size   : 2
    <5e4>   DW_AT_encoding    : 7	(unsigned)
    <5e5>   DW_AT_name        : (indirect string, offset: 0x2e973): short unsigned int
 <1><5e9>: Abbrev Number: 8 (DW_TAG_base_type)
    <5ea>   DW_AT_byte_size   : 4
    <5eb>   DW_AT_encoding    : 5	(signed)
    <5ec>   DW_AT_name        : (indirect string, offset: 0xc439): long int
 <1><5f0>: Abbrev Number: 4 (DW_TAG_typedef)
    <5f1>   DW_AT_name        : (indirect string, offset: 0x5981b): __uint32_t
    <5f5>   DW_AT_decl_file   : 2
    <5f6>   DW_AT_decl_line   : 79
    <5f7>   DW_AT_decl_column : 25
    <5f8>   DW_AT_type        : <0x5fc>
 <1><5fc>: Abbrev Number: 8 (DW_TAG_base_type)
    <5fd>   DW_AT_byte_size   : 4
    <5fe>   DW_AT_encoding    : 7	(unsigned)
    <5ff>   DW_AT_name        : (indirect string, offset: 0x21605): long unsigned int
 <1><603>: Abbrev Number: 8 (DW_TAG_base_type)
    <604>   DW_AT_byte_size   : 8
    <605>   DW_AT_encoding    : 5	(signed)
    <606>   DW_AT_name        : (indirect string, offset: 0x40bc0): long long int
 <1><60a>: Abbrev Number: 8 (DW_TAG_base_type)
    <60b>   DW_AT_byte_size   : 8
    <60c>   DW_AT_encoding    : 7	(unsigned)
    <60d>   DW_AT_name        : (indirect string, offset: 0x1d6b1): long long unsigned int
 <1><611>: Abbrev Number: 23 (DW_TAG_base_type)
    <612>   DW_AT_byte_size   : 4
    <613>   DW_AT_encoding    : 5	(signed)
    <614>   DW_AT_name        : int
 <1><618>: Abbrev Number: 8 (DW_TAG_base_type)
    <619>   DW_AT_byte_size   : 4
    <61a>   DW_AT_encoding    : 7	(unsigned)
    <61b>   DW_AT_name        : (indirect string, offset: 0xbd78): unsigned int
 <1><61f>: Abbrev Number: 4 (DW_TAG_typedef)
    <620>   DW_AT_name        : (indirect string, offset: 0x294a8): uint8_t
    <624>   DW_AT_decl_file   : 3
    <625>   DW_AT_decl_line   : 24
    <626>   DW_AT_decl_column : 19
    <627>   DW_AT_type        : <0x5c8>
 <1><62b>: Abbrev Number: 4 (DW_TAG_typedef)
    <62c>   DW_AT_name        : (indirect string, offset: 0x91d49): uint32_t
    <630>   DW_AT_decl_file   : 3
    <631>   DW_AT_decl_line   : 48
    <632>   DW_AT_decl_column : 20
    <633>   DW_AT_type        : <0x5f0>
 <1><637>: Abbrev Number: 20 (DW_TAG_volatile_type)
    <638>   DW_AT_type        : <0x62b>
 <1><63c>: Abbrev Number: 4 (DW_TAG_typedef)
    <63d>   DW_AT_name        : (indirect string, offset: 0x46ba0): uint8
    <641>   DW_AT_decl_file   : 4
    <642>   DW_AT_decl_line   : 6
    <643>   DW_AT_decl_column : 17
    <644>   DW_AT_type        : <0x61f>
 <1><648>: Abbrev Number: 4 (DW_TAG_typedef)
    <649>   DW_AT_name        : (indirect string, offset: 0x834c3): uint32
    <64d>   DW_AT_decl_file   : 4
    <64e>   DW_AT_decl_line   : 8
    <64f>   DW_AT_decl_column : 18
    <650>   DW_AT_type        : <0x62b>
 <1><654>: Abbrev Number: 18 (DW_TAG_enumeration_type)
    <655>   DW_AT_encoding    : 7	(unsigned)
    <655>   DW_AT_byte_size   : 1
    <655>   DW_AT_type        : <0x5d4>
    <659>   DW_AT_decl_file   : 5
    <65a>   DW_AT_decl_line   : 4
    <65b>   DW_AT_decl_column : 1
    <65b>   DW_AT_sibling     : <0x67e>
 <2><65f>: Abbrev Number: 5 (DW_TAG_enumerator)
    <660>   DW_AT_name        : (indirect string, offset: 0x8c740): INIT
    <664>   DW_AT_const_value : 0
 <2><665>: Abbrev Number: 5 (DW_TAG_enumerator)
    <666>   DW_AT_name        : (indirect string, offset: 0x8c37c): NO_COMMUNICATION
    <66a>   DW_AT_const_value : 1
 <2><66b>: Abbrev Number: 5 (DW_TAG_enumerator)
    <66c>   DW_AT_name        : (indirect string, offset: 0x8c7f9): FULL_COMMUNICATION
    <670>   DW_AT_const_value : 2
 <2><671>: Abbrev Number: 5 (DW_TAG_enumerator)
    <672>   DW_AT_name        : (indirect string, offset: 0x8c720): PARTIAL_COMMUNICATION
    <676>   DW_AT_const_value : 3
 <2><677>: Abbrev Number: 5 (DW_TAG_enumerator)
    <678>   DW_AT_name        : (indirect string, offset: 0x8c736): CC_ACTIVE
    <67c>   DW_AT_const_value : 4
 <2><67d>: Abbrev Number: 0
 <1><67e>: Abbrev Number: 4 (DW_TAG_typedef)
    <67f>   DW_AT_name        : (indirect string, offset: 0x8c865): CanH_ComStat_t
    <683>   DW_AT_decl_file   : 5
    <684>   DW_AT_decl_line   : 10
    <685>   DW_AT_decl_column : 2
    <686>   DW_AT_type        : <0x654>
 <1><68a>: Abbrev Number: 10 (DW_TAG_array_type)
    <68b>   DW_AT_type        : <0x62b>
    <68f>   DW_AT_sibling     : <0x69a>
 <2><693>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <694>   DW_AT_type        : <0x618>
    <698>   DW_AT_upper_bound : 7
 <2><699>: Abbrev Number: 0
 <1><69a>: Abbrev Number: 13 (DW_TAG_structure_type)
    <69b>   DW_AT_byte_size   : 16
    <69c>   DW_AT_decl_file   : 6
    <69d>   DW_AT_decl_line   : 203
    <69e>   DW_AT_decl_column : 9
    <69e>   DW_AT_sibling     : <0x6d7>
 <2><6a2>: Abbrev Number: 6 (DW_TAG_member)
    <6a3>   DW_AT_name        : TIR
    <6a7>   DW_AT_decl_file   : 6
    <6a8>   DW_AT_decl_line   : 205
    <6a9>   DW_AT_decl_column : 17
    <6aa>   DW_AT_type        : <0x637>
    <6ae>   DW_AT_data_member_location: 0
 <2><6af>: Abbrev Number: 1 (DW_TAG_member)
    <6b0>   DW_AT_name        : (indirect string, offset: 0x8c860): TDTR
    <6b4>   DW_AT_decl_file   : 6
    <6b5>   DW_AT_decl_line   : 206
    <6b6>   DW_AT_decl_column : 17
    <6b7>   DW_AT_type        : <0x637>
    <6bb>   DW_AT_data_member_location: 4
 <2><6bc>: Abbrev Number: 1 (DW_TAG_member)
    <6bd>   DW_AT_name        : (indirect string, offset: 0x8c57d): TDLR
    <6c1>   DW_AT_decl_file   : 6
    <6c2>   DW_AT_decl_line   : 207
    <6c3>   DW_AT_decl_column : 17
    <6c4>   DW_AT_type        : <0x637>
    <6c8>   DW_AT_data_member_location: 8
 <2><6c9>: Abbrev Number: 1 (DW_TAG_member)
    <6ca>   DW_AT_name        : (indirect string, offset: 0x8c578): TDHR
    <6ce>   DW_AT_decl_file   : 6
    <6cf>   DW_AT_decl_line   : 208
    <6d0>   DW_AT_decl_column : 17
    <6d1>   DW_AT_type        : <0x637>
    <6d5>   DW_AT_data_member_location: 12
 <2><6d6>: Abbrev Number: 0
 <1><6d7>: Abbrev Number: 4 (DW_TAG_typedef)
    <6d8>   DW_AT_name        : (indirect string, offset: 0x8c5df): CAN_TxMailBox_TypeDef
    <6dc>   DW_AT_decl_file   : 6
    <6dd>   DW_AT_decl_line   : 209
    <6de>   DW_AT_decl_column : 3
    <6df>   DW_AT_type        : <0x69a>
 <1><6e3>: Abbrev Number: 13 (DW_TAG_structure_type)
    <6e4>   DW_AT_byte_size   : 16
    <6e5>   DW_AT_decl_file   : 6
    <6e6>   DW_AT_decl_line   : 215
    <6e7>   DW_AT_decl_column : 9
    <6e7>   DW_AT_sibling     : <0x720>
 <2><6eb>: Abbrev Number: 6 (DW_TAG_member)
    <6ec>   DW_AT_name        : RIR
    <6f0>   DW_AT_decl_file   : 6
    <6f1>   DW_AT_decl_line   : 217
    <6f2>   DW_AT_decl_column : 17
    <6f3>   DW_AT_type        : <0x637>
    <6f7>   DW_AT_data_member_location: 0
 <2><6f8>: Abbrev Number: 1 (DW_TAG_member)
    <6f9>   DW_AT_name        : (indirect string, offset: 0x8c3b4): RDTR
    <6fd>   DW_AT_decl_file   : 6
    <6fe>   DW_AT_decl_line   : 218
    <6ff>   DW_AT_decl_column : 17
    <700>   DW_AT_type        : <0x637>
    <704>   DW_AT_data_member_location: 4
 <2><705>: Abbrev Number: 1 (DW_TAG_member)
    <706>   DW_AT_name        : (indirect string, offset: 0x8c3af): RDLR
    <70a>   DW_AT_decl_file   : 6
    <70b>   DW_AT_decl_line   : 219
    <70c>   DW_AT_decl_column : 17
    <70d>   DW_AT_type        : <0x637>
    <711>   DW_AT_data_member_location: 8
 <2><712>: Abbrev Number: 1 (DW_TAG_member)
    <713>   DW_AT_name        : (indirect string, offset: 0x8c40b): RDHR
    <717>   DW_AT_decl_file   : 6
    <718>   DW_AT_decl_line   : 220
    <719>   DW_AT_decl_column : 17
    <71a>   DW_AT_type        : <0x637>
    <71e>   DW_AT_data_member_location: 12
 <2><71f>: Abbrev Number: 0
 <1><720>: Abbrev Number: 4 (DW_TAG_typedef)
    <721>   DW_AT_name        : (indirect string, offset: 0x8c45f): CAN_FIFOMailBox_TypeDef
    <725>   DW_AT_decl_file   : 6
    <726>   DW_AT_decl_line   : 221
    <727>   DW_AT_decl_column : 3
    <728>   DW_AT_type        : <0x6e3>
 <1><72c>: Abbrev Number: 13 (DW_TAG_structure_type)
    <72d>   DW_AT_byte_size   : 8
    <72e>   DW_AT_decl_file   : 6
    <72f>   DW_AT_decl_line   : 227
    <730>   DW_AT_decl_column : 9
    <730>   DW_AT_sibling     : <0x74f>
 <2><734>: Abbrev Number: 6 (DW_TAG_member)
    <735>   DW_AT_name        : FR1
    <739>   DW_AT_decl_file   : 6
    <73a>   DW_AT_decl_line   : 229
    <73b>   DW_AT_decl_column : 17
    <73c>   DW_AT_type        : <0x637>
    <740>   DW_AT_data_member_location: 0
 <2><741>: Abbrev Number: 6 (DW_TAG_member)
    <742>   DW_AT_name        : FR2
    <746>   DW_AT_decl_file   : 6
    <747>   DW_AT_decl_line   : 230
    <748>   DW_AT_decl_column : 17
    <749>   DW_AT_type        : <0x637>
    <74d>   DW_AT_data_member_location: 4
 <2><74e>: Abbrev Number: 0
 <1><74f>: Abbrev Number: 4 (DW_TAG_typedef)
    <750>   DW_AT_name        : (indirect string, offset: 0x8c6f1): CAN_FilterRegister_TypeDef
    <754>   DW_AT_decl_file   : 6
    <755>   DW_AT_decl_line   : 231
    <756>   DW_AT_decl_column : 3
    <757>   DW_AT_type        : <0x72c>
 <1><75b>: Abbrev Number: 24 (DW_TAG_structure_type)
    <75c>   DW_AT_byte_size   : 688
    <75e>   DW_AT_decl_file   : 6
    <75f>   DW_AT_decl_line   : 237
    <760>   DW_AT_decl_column : 9
    <761>   DW_AT_sibling     : <0x88a>
 <2><765>: Abbrev Number: 6 (DW_TAG_member)
    <766>   DW_AT_name        : MCR
    <76a>   DW_AT_decl_file   : 6
    <76b>   DW_AT_decl_line   : 239
    <76c>   DW_AT_decl_column : 17
    <76d>   DW_AT_type        : <0x637>
    <771>   DW_AT_data_member_location: 0
 <2><772>: Abbrev Number: 6 (DW_TAG_member)
    <773>   DW_AT_name        : MSR
    <777>   DW_AT_decl_file   : 6
    <778>   DW_AT_decl_line   : 240
    <779>   DW_AT_decl_column : 17
    <77a>   DW_AT_type        : <0x637>
    <77e>   DW_AT_data_member_location: 4
 <2><77f>: Abbrev Number: 6 (DW_TAG_member)
    <780>   DW_AT_name        : TSR
    <784>   DW_AT_decl_file   : 6
    <785>   DW_AT_decl_line   : 241
    <786>   DW_AT_decl_column : 17
    <787>   DW_AT_type        : <0x637>
    <78b>   DW_AT_data_member_location: 8
 <2><78c>: Abbrev Number: 1 (DW_TAG_member)
    <78d>   DW_AT_name        : (indirect string, offset: 0x8c503): RF0R
    <791>   DW_AT_decl_file   : 6
    <792>   DW_AT_decl_line   : 242
    <793>   DW_AT_decl_column : 17
    <794>   DW_AT_type        : <0x637>
    <798>   DW_AT_data_member_location: 12
 <2><799>: Abbrev Number: 1 (DW_TAG_member)
    <79a>   DW_AT_name        : (indirect string, offset: 0x8c5ff): RF1R
    <79e>   DW_AT_decl_file   : 6
    <79f>   DW_AT_decl_line   : 243
    <7a0>   DW_AT_decl_column : 17
    <7a1>   DW_AT_type        : <0x637>
    <7a5>   DW_AT_data_member_location: 16
 <2><7a6>: Abbrev Number: 6 (DW_TAG_member)
    <7a7>   DW_AT_name        : IER
    <7ab>   DW_AT_decl_file   : 6
    <7ac>   DW_AT_decl_line   : 244
    <7ad>   DW_AT_decl_column : 17
    <7ae>   DW_AT_type        : <0x637>
    <7b2>   DW_AT_data_member_location: 20
 <2><7b3>: Abbrev Number: 6 (DW_TAG_member)
    <7b4>   DW_AT_name        : ESR
    <7b8>   DW_AT_decl_file   : 6
    <7b9>   DW_AT_decl_line   : 245
    <7ba>   DW_AT_decl_column : 17
    <7bb>   DW_AT_type        : <0x637>
    <7bf>   DW_AT_data_member_location: 24
 <2><7c0>: Abbrev Number: 6 (DW_TAG_member)
    <7c1>   DW_AT_name        : BTR
    <7c5>   DW_AT_decl_file   : 6
    <7c6>   DW_AT_decl_line   : 246
    <7c7>   DW_AT_decl_column : 17
    <7c8>   DW_AT_type        : <0x637>
    <7cc>   DW_AT_data_member_location: 28
 <2><7cd>: Abbrev Number: 1 (DW_TAG_member)
    <7ce>   DW_AT_name        : (indirect string, offset: 0x8c80c): RESERVED0
    <7d2>   DW_AT_decl_file   : 6
    <7d3>   DW_AT_decl_line   : 247
    <7d4>   DW_AT_decl_column : 13
    <7d5>   DW_AT_type        : <0x88a>
    <7d9>   DW_AT_data_member_location: 32
 <2><7da>: Abbrev Number: 12 (DW_TAG_member)
    <7db>   DW_AT_name        : (indirect string, offset: 0x8c538): sTxMailBox
    <7df>   DW_AT_decl_file   : 6
    <7df>   DW_AT_decl_line   : 248
    <7e0>   DW_AT_decl_column : 25
    <7e1>   DW_AT_type        : <0x89a>
    <7e5>   DW_AT_data_member_location: 384
 <2><7e7>: Abbrev Number: 12 (DW_TAG_member)
    <7e8>   DW_AT_name        : (indirect string, offset: 0x8c477): sFIFOMailBox
    <7ec>   DW_AT_decl_file   : 6
    <7ec>   DW_AT_decl_line   : 249
    <7ed>   DW_AT_decl_column : 27
    <7ee>   DW_AT_type        : <0x8aa>
    <7f2>   DW_AT_data_member_location: 432
 <2><7f4>: Abbrev Number: 12 (DW_TAG_member)
    <7f5>   DW_AT_name        : (indirect string, offset: 0x8c816): RESERVED1
    <7f9>   DW_AT_decl_file   : 6
    <7f9>   DW_AT_decl_line   : 250
    <7fa>   DW_AT_decl_column : 13
    <7fb>   DW_AT_type        : <0x8ba>
    <7ff>   DW_AT_data_member_location: 464
 <2><801>: Abbrev Number: 25 (DW_TAG_member)
    <802>   DW_AT_name        : FMR
    <806>   DW_AT_decl_file   : 6
    <807>   DW_AT_decl_line   : 251
    <808>   DW_AT_decl_column : 17
    <809>   DW_AT_type        : <0x637>
    <80d>   DW_AT_data_member_location: 512
 <2><80f>: Abbrev Number: 12 (DW_TAG_member)
    <810>   DW_AT_name        : (indirect string, offset: 0x8c38d): FM1R
    <814>   DW_AT_decl_file   : 6
    <814>   DW_AT_decl_line   : 252
    <815>   DW_AT_decl_column : 17
    <816>   DW_AT_type        : <0x637>
    <81a>   DW_AT_data_member_location: 516
 <2><81c>: Abbrev Number: 12 (DW_TAG_member)
    <81d>   DW_AT_name        : (indirect string, offset: 0x8c820): RESERVED2
    <821>   DW_AT_decl_file   : 6
    <821>   DW_AT_decl_line   : 253
    <822>   DW_AT_decl_column : 13
    <823>   DW_AT_type        : <0x62b>
    <827>   DW_AT_data_member_location: 520
 <2><829>: Abbrev Number: 12 (DW_TAG_member)
    <82a>   DW_AT_name        : (indirect string, offset: 0x8c77e): FS1R
    <82e>   DW_AT_decl_file   : 6
    <82e>   DW_AT_decl_line   : 254
    <82f>   DW_AT_decl_column : 17
    <830>   DW_AT_type        : <0x637>
    <834>   DW_AT_data_member_location: 524
 <2><836>: Abbrev Number: 12 (DW_TAG_member)
    <837>   DW_AT_name        : (indirect string, offset: 0x8c82a): RESERVED3
    <83b>   DW_AT_decl_file   : 6
    <83b>   DW_AT_decl_line   : 255
    <83c>   DW_AT_decl_column : 13
    <83d>   DW_AT_type        : <0x62b>
    <841>   DW_AT_data_member_location: 528
 <2><843>: Abbrev Number: 15 (DW_TAG_member)
    <844>   DW_AT_name        : (indirect string, offset: 0x8c644): FFA1R
    <848>   DW_AT_decl_file   : 6
    <848>   DW_AT_decl_line   : 256
    <84a>   DW_AT_decl_column : 17
    <84b>   DW_AT_type        : <0x637>
    <84f>   DW_AT_data_member_location: 532
 <2><851>: Abbrev Number: 15 (DW_TAG_member)
    <852>   DW_AT_name        : (indirect string, offset: 0x8c5d5): RESERVED4
    <856>   DW_AT_decl_file   : 6
    <856>   DW_AT_decl_line   : 257
    <858>   DW_AT_decl_column : 13
    <859>   DW_AT_type        : <0x62b>
    <85d>   DW_AT_data_member_location: 536
 <2><85f>: Abbrev Number: 15 (DW_TAG_member)
    <860>   DW_AT_name        : (indirect string, offset: 0x8c645): FA1R
    <864>   DW_AT_decl_file   : 6
    <864>   DW_AT_decl_line   : 258
    <866>   DW_AT_decl_column : 17
    <867>   DW_AT_type        : <0x637>
    <86b>   DW_AT_data_member_location: 540
 <2><86d>: Abbrev Number: 15 (DW_TAG_member)
    <86e>   DW_AT_name        : (indirect string, offset: 0x8c834): RESERVED5
    <872>   DW_AT_decl_file   : 6
    <872>   DW_AT_decl_line   : 259
    <874>   DW_AT_decl_column : 13
    <875>   DW_AT_type        : <0x68a>
    <879>   DW_AT_data_member_location: 544
 <2><87b>: Abbrev Number: 15 (DW_TAG_member)
    <87c>   DW_AT_name        : (indirect string, offset: 0x8c4d3): sFilterRegister
    <880>   DW_AT_decl_file   : 6
    <880>   DW_AT_decl_line   : 260
    <882>   DW_AT_decl_column : 30
    <883>   DW_AT_type        : <0x8ca>
    <887>   DW_AT_data_member_location: 576
 <2><889>: Abbrev Number: 0
 <1><88a>: Abbrev Number: 10 (DW_TAG_array_type)
    <88b>   DW_AT_type        : <0x62b>
    <88f>   DW_AT_sibling     : <0x89a>
 <2><893>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <894>   DW_AT_type        : <0x618>
    <898>   DW_AT_upper_bound : 87
 <2><899>: Abbrev Number: 0
 <1><89a>: Abbrev Number: 10 (DW_TAG_array_type)
    <89b>   DW_AT_type        : <0x6d7>
    <89f>   DW_AT_sibling     : <0x8aa>
 <2><8a3>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <8a4>   DW_AT_type        : <0x618>
    <8a8>   DW_AT_upper_bound : 2
 <2><8a9>: Abbrev Number: 0
 <1><8aa>: Abbrev Number: 10 (DW_TAG_array_type)
    <8ab>   DW_AT_type        : <0x720>
    <8af>   DW_AT_sibling     : <0x8ba>
 <2><8b3>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <8b4>   DW_AT_type        : <0x618>
    <8b8>   DW_AT_upper_bound : 1
 <2><8b9>: Abbrev Number: 0
 <1><8ba>: Abbrev Number: 10 (DW_TAG_array_type)
    <8bb>   DW_AT_type        : <0x62b>
    <8bf>   DW_AT_sibling     : <0x8ca>
 <2><8c3>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <8c4>   DW_AT_type        : <0x618>
    <8c8>   DW_AT_upper_bound : 11
 <2><8c9>: Abbrev Number: 0
 <1><8ca>: Abbrev Number: 10 (DW_TAG_array_type)
    <8cb>   DW_AT_type        : <0x74f>
    <8cf>   DW_AT_sibling     : <0x8da>
 <2><8d3>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <8d4>   DW_AT_type        : <0x618>
    <8d8>   DW_AT_upper_bound : 13
 <2><8d9>: Abbrev Number: 0
 <1><8da>: Abbrev Number: 26 (DW_TAG_typedef)
    <8db>   DW_AT_name        : (indirect string, offset: 0x8c772): CAN_TypeDef
    <8df>   DW_AT_decl_file   : 6
    <8e0>   DW_AT_decl_line   : 261
    <8e2>   DW_AT_decl_column : 3
    <8e3>   DW_AT_type        : <0x75b>
 <1><8e7>: Abbrev Number: 18 (DW_TAG_enumeration_type)
    <8e8>   DW_AT_encoding    : 7	(unsigned)
    <8e8>   DW_AT_byte_size   : 1
    <8e8>   DW_AT_type        : <0x5d4>
    <8ec>   DW_AT_decl_file   : 7
    <8ed>   DW_AT_decl_line   : 158
    <8ee>   DW_AT_decl_column : 1
    <8ee>   DW_AT_sibling     : <0x8ff>
 <2><8f2>: Abbrev Number: 5 (DW_TAG_enumerator)
    <8f3>   DW_AT_name        : (indirect string, offset: 0x42e01): DISABLE
    <8f7>   DW_AT_const_value : 0
 <2><8f8>: Abbrev Number: 5 (DW_TAG_enumerator)
    <8f9>   DW_AT_name        : (indirect string, offset: 0x7f699): ENABLE
    <8fd>   DW_AT_const_value : 1
 <2><8fe>: Abbrev Number: 0
 <1><8ff>: Abbrev Number: 4 (DW_TAG_typedef)
    <900>   DW_AT_name        : (indirect string, offset: 0x8c88e): FunctionalState
    <904>   DW_AT_decl_file   : 7
    <905>   DW_AT_decl_line   : 161
    <906>   DW_AT_decl_column : 3
    <907>   DW_AT_type        : <0x8e7>
 <1><90b>: Abbrev Number: 8 (DW_TAG_base_type)
    <90c>   DW_AT_byte_size   : 8
    <90d>   DW_AT_encoding    : 4	(float)
    <90e>   DW_AT_name        : (indirect string, offset: 0xd70a): long double
 <1><912>: Abbrev Number: 18 (DW_TAG_enumeration_type)
    <913>   DW_AT_encoding    : 7	(unsigned)
    <913>   DW_AT_byte_size   : 1
    <913>   DW_AT_type        : <0x5d4>
    <917>   DW_AT_decl_file   : 8
    <918>   DW_AT_decl_line   : 40
    <919>   DW_AT_decl_column : 1
    <919>   DW_AT_sibling     : <0x936>
 <2><91d>: Abbrev Number: 5 (DW_TAG_enumerator)
    <91e>   DW_AT_name        : (indirect string, offset: 0x8c531): HAL_OK
    <922>   DW_AT_const_value : 0
 <2><923>: Abbrev Number: 5 (DW_TAG_enumerator)
    <924>   DW_AT_name        : (indirect string, offset: 0x8c5f5): HAL_ERROR
    <928>   DW_AT_const_value : 1
 <2><929>: Abbrev Number: 5 (DW_TAG_enumerator)
    <92a>   DW_AT_name        : (indirect string, offset: 0x8c410): HAL_BUSY
    <92e>   DW_AT_const_value : 2
 <2><92f>: Abbrev Number: 5 (DW_TAG_enumerator)
    <930>   DW_AT_name        : (indirect string, offset: 0x8c4f7): HAL_TIMEOUT
    <934>   DW_AT_const_value : 3
 <2><935>: Abbrev Number: 0
 <1><936>: Abbrev Number: 4 (DW_TAG_typedef)
    <937>   DW_AT_name        : (indirect string, offset: 0x8c318): HAL_StatusTypeDef
    <93b>   DW_AT_decl_file   : 8
    <93c>   DW_AT_decl_line   : 45
    <93d>   DW_AT_decl_column : 3
    <93e>   DW_AT_type        : <0x912>
 <1><942>: Abbrev Number: 18 (DW_TAG_enumeration_type)
    <943>   DW_AT_encoding    : 7	(unsigned)
    <943>   DW_AT_byte_size   : 1
    <943>   DW_AT_type        : <0x5d4>
    <947>   DW_AT_decl_file   : 9
    <948>   DW_AT_decl_line   : 48
    <949>   DW_AT_decl_column : 1
    <949>   DW_AT_sibling     : <0x972>
 <2><94d>: Abbrev Number: 5 (DW_TAG_enumerator)
    <94e>   DW_AT_name        : (indirect string, offset: 0x8c32a): HAL_CAN_STATE_RESET
    <952>   DW_AT_const_value : 0
 <2><953>: Abbrev Number: 5 (DW_TAG_enumerator)
    <954>   DW_AT_name        : (indirect string, offset: 0x8c44b): HAL_CAN_STATE_READY
    <958>   DW_AT_const_value : 1
 <2><959>: Abbrev Number: 5 (DW_TAG_enumerator)
    <95a>   DW_AT_name        : (indirect string, offset: 0x8c7b4): HAL_CAN_STATE_LISTENING
    <95e>   DW_AT_const_value : 2
 <2><95f>: Abbrev Number: 5 (DW_TAG_enumerator)
    <960>   DW_AT_name        : (indirect string, offset: 0x8c798): HAL_CAN_STATE_SLEEP_PENDING
    <964>   DW_AT_const_value : 3
 <2><965>: Abbrev Number: 5 (DW_TAG_enumerator)
    <966>   DW_AT_name        : (indirect string, offset: 0x8c350): HAL_CAN_STATE_SLEEP_ACTIVE
    <96a>   DW_AT_const_value : 4
 <2><96b>: Abbrev Number: 5 (DW_TAG_enumerator)
    <96c>   DW_AT_name        : (indirect string, offset: 0x8c6cb): HAL_CAN_STATE_ERROR
    <970>   DW_AT_const_value : 5
 <2><971>: Abbrev Number: 0
 <1><972>: Abbrev Number: 4 (DW_TAG_typedef)
    <973>   DW_AT_name        : (indirect string, offset: 0x8c758): HAL_CAN_StateTypeDef
    <977>   DW_AT_decl_file   : 9
    <978>   DW_AT_decl_line   : 56
    <979>   DW_AT_decl_column : 3
    <97a>   DW_AT_type        : <0x942>
 <1><97e>: Abbrev Number: 20 (DW_TAG_volatile_type)
    <97f>   DW_AT_type        : <0x972>
 <1><983>: Abbrev Number: 13 (DW_TAG_structure_type)
    <984>   DW_AT_byte_size   : 28
    <985>   DW_AT_decl_file   : 9
    <986>   DW_AT_decl_line   : 61
    <987>   DW_AT_decl_column : 9
    <987>   DW_AT_sibling     : <0xa1b>
 <2><98b>: Abbrev Number: 1 (DW_TAG_member)
    <98c>   DW_AT_name        : (indirect string, offset: 0x93662): Prescaler
    <990>   DW_AT_decl_file   : 9
    <991>   DW_AT_decl_line   : 63
    <992>   DW_AT_decl_column : 12
    <993>   DW_AT_type        : <0x62b>
    <997>   DW_AT_data_member_location: 0
 <2><998>: Abbrev Number: 1 (DW_TAG_member)
    <999>   DW_AT_name        : (indirect string, offset: 0x9814f): Mode
    <99d>   DW_AT_decl_file   : 9
    <99e>   DW_AT_decl_line   : 66
    <99f>   DW_AT_decl_column : 12
    <9a0>   DW_AT_type        : <0x62b>
    <9a4>   DW_AT_data_member_location: 4
 <2><9a5>: Abbrev Number: 1 (DW_TAG_member)
    <9a6>   DW_AT_name        : (indirect string, offset: 0x8c3db): SyncJumpWidth
    <9aa>   DW_AT_decl_file   : 9
    <9ab>   DW_AT_decl_line   : 69
    <9ac>   DW_AT_decl_column : 12
    <9ad>   DW_AT_type        : <0x62b>
    <9b1>   DW_AT_data_member_location: 8
 <2><9b2>: Abbrev Number: 1 (DW_TAG_member)
    <9b3>   DW_AT_name        : (indirect string, offset: 0x8c566): TimeSeg1
    <9b7>   DW_AT_decl_file   : 9
    <9b8>   DW_AT_decl_line   : 73
    <9b9>   DW_AT_decl_column : 12
    <9ba>   DW_AT_type        : <0x62b>
    <9be>   DW_AT_data_member_location: 12
 <2><9bf>: Abbrev Number: 1 (DW_TAG_member)
    <9c0>   DW_AT_name        : (indirect string, offset: 0x8c56f): TimeSeg2
    <9c4>   DW_AT_decl_file   : 9
    <9c5>   DW_AT_decl_line   : 76
    <9c6>   DW_AT_decl_column : 12
    <9c7>   DW_AT_type        : <0x62b>
    <9cb>   DW_AT_data_member_location: 16
 <2><9cc>: Abbrev Number: 1 (DW_TAG_member)
    <9cd>   DW_AT_name        : (indirect string, offset: 0x8c39d): TimeTriggeredMode
    <9d1>   DW_AT_decl_file   : 9
    <9d2>   DW_AT_decl_line   : 79
    <9d3>   DW_AT_decl_column : 19
    <9d4>   DW_AT_type        : <0x8ff>
    <9d8>   DW_AT_data_member_location: 20
 <2><9d9>: Abbrev Number: 1 (DW_TAG_member)
    <9da>   DW_AT_name        : (indirect string, offset: 0x8c639): AutoBusOff
    <9de>   DW_AT_decl_file   : 9
    <9df>   DW_AT_decl_line   : 82
    <9e0>   DW_AT_decl_column : 19
    <9e1>   DW_AT_type        : <0x8ff>
    <9e5>   DW_AT_data_member_location: 21
 <2><9e6>: Abbrev Number: 1 (DW_TAG_member)
    <9e7>   DW_AT_name        : (indirect string, offset: 0x8c883): AutoWakeUp
    <9eb>   DW_AT_decl_file   : 9
    <9ec>   DW_AT_decl_line   : 85
    <9ed>   DW_AT_decl_column : 19
    <9ee>   DW_AT_type        : <0x8ff>
    <9f2>   DW_AT_data_member_location: 22
 <2><9f3>: Abbrev Number: 1 (DW_TAG_member)
    <9f4>   DW_AT_name        : (indirect string, offset: 0x8c89e): AutoRetransmission
    <9f8>   DW_AT_decl_file   : 9
    <9f9>   DW_AT_decl_line   : 88
    <9fa>   DW_AT_decl_column : 19
    <9fb>   DW_AT_type        : <0x8ff>
    <9ff>   DW_AT_data_member_location: 23
 <2><a00>: Abbrev Number: 1 (DW_TAG_member)
    <a01>   DW_AT_name        : (indirect string, offset: 0x8c51f): ReceiveFifoLocked
    <a05>   DW_AT_decl_file   : 9
    <a06>   DW_AT_decl_line   : 91
    <a07>   DW_AT_decl_column : 19
    <a08>   DW_AT_type        : <0x8ff>
    <a0c>   DW_AT_data_member_location: 24
 <2><a0d>: Abbrev Number: 1 (DW_TAG_member)
    <a0e>   DW_AT_name        : (indirect string, offset: 0x8c6b6): TransmitFifoPriority
    <a12>   DW_AT_decl_file   : 9
    <a13>   DW_AT_decl_line   : 94
    <a14>   DW_AT_decl_column : 19
    <a15>   DW_AT_type        : <0x8ff>
    <a19>   DW_AT_data_member_location: 25
 <2><a1a>: Abbrev Number: 0
 <1><a1b>: Abbrev Number: 4 (DW_TAG_typedef)
    <a1c>   DW_AT_name        : (indirect string, offset: 0x8c43b): CAN_InitTypeDef
    <a20>   DW_AT_decl_file   : 9
    <a21>   DW_AT_decl_line   : 97
    <a22>   DW_AT_decl_column : 3
    <a23>   DW_AT_type        : <0x983>
 <1><a27>: Abbrev Number: 13 (DW_TAG_structure_type)
    <a28>   DW_AT_byte_size   : 24
    <a29>   DW_AT_decl_file   : 9
    <a2a>   DW_AT_decl_line   : 152
    <a2b>   DW_AT_decl_column : 9
    <a2b>   DW_AT_sibling     : <0xa7e>
 <2><a2f>: Abbrev Number: 1 (DW_TAG_member)
    <a30>   DW_AT_name        : (indirect string, offset: 0x8c3e9): StdId
    <a34>   DW_AT_decl_file   : 9
    <a35>   DW_AT_decl_line   : 154
    <a36>   DW_AT_decl_column : 12
    <a37>   DW_AT_type        : <0x62b>
    <a3b>   DW_AT_data_member_location: 0
 <2><a3c>: Abbrev Number: 1 (DW_TAG_member)
    <a3d>   DW_AT_name        : (indirect string, offset: 0x8c5cf): ExtId
    <a41>   DW_AT_decl_file   : 9
    <a42>   DW_AT_decl_line   : 157
    <a43>   DW_AT_decl_column : 12
    <a44>   DW_AT_type        : <0x62b>
    <a48>   DW_AT_data_member_location: 4
 <2><a49>: Abbrev Number: 6 (DW_TAG_member)
    <a4a>   DW_AT_name        : IDE
    <a4e>   DW_AT_decl_file   : 9
    <a4f>   DW_AT_decl_line   : 160
    <a50>   DW_AT_decl_column : 12
    <a51>   DW_AT_type        : <0x62b>
    <a55>   DW_AT_data_member_location: 8
 <2><a56>: Abbrev Number: 6 (DW_TAG_member)
    <a57>   DW_AT_name        : RTR
    <a5b>   DW_AT_decl_file   : 9
    <a5c>   DW_AT_decl_line   : 163
    <a5d>   DW_AT_decl_column : 12
    <a5e>   DW_AT_type        : <0x62b>
    <a62>   DW_AT_data_member_location: 12
 <2><a63>: Abbrev Number: 6 (DW_TAG_member)
    <a64>   DW_AT_name        : DLC
    <a68>   DW_AT_decl_file   : 9
    <a69>   DW_AT_decl_line   : 166
    <a6a>   DW_AT_decl_column : 12
    <a6b>   DW_AT_type        : <0x62b>
    <a6f>   DW_AT_data_member_location: 16
 <2><a70>: Abbrev Number: 1 (DW_TAG_member)
    <a71>   DW_AT_name        : (indirect string, offset: 0x8c745): TransmitGlobalTime
    <a75>   DW_AT_decl_file   : 9
    <a76>   DW_AT_decl_line   : 169
    <a77>   DW_AT_decl_column : 19
    <a78>   DW_AT_type        : <0x8ff>
    <a7c>   DW_AT_data_member_location: 20
 <2><a7d>: Abbrev Number: 0
 <1><a7e>: Abbrev Number: 4 (DW_TAG_typedef)
    <a7f>   DW_AT_name        : (indirect string, offset: 0x8c4ad): CAN_TxHeaderTypeDef
    <a83>   DW_AT_decl_file   : 9
    <a84>   DW_AT_decl_line   : 175
    <a85>   DW_AT_decl_column : 3
    <a86>   DW_AT_type        : <0xa27>
 <1><a8a>: Abbrev Number: 13 (DW_TAG_structure_type)
    <a8b>   DW_AT_byte_size   : 28
    <a8c>   DW_AT_decl_file   : 9
    <a8d>   DW_AT_decl_line   : 180
    <a8e>   DW_AT_decl_column : 9
    <a8e>   DW_AT_sibling     : <0xaee>
 <2><a92>: Abbrev Number: 1 (DW_TAG_member)
    <a93>   DW_AT_name        : (indirect string, offset: 0x8c3e9): StdId
    <a97>   DW_AT_decl_file   : 9
    <a98>   DW_AT_decl_line   : 182
    <a99>   DW_AT_decl_column : 12
    <a9a>   DW_AT_type        : <0x62b>
    <a9e>   DW_AT_data_member_location: 0
 <2><a9f>: Abbrev Number: 1 (DW_TAG_member)
    <aa0>   DW_AT_name        : (indirect string, offset: 0x8c5cf): ExtId
    <aa4>   DW_AT_decl_file   : 9
    <aa5>   DW_AT_decl_line   : 185
    <aa6>   DW_AT_decl_column : 12
    <aa7>   DW_AT_type        : <0x62b>
    <aab>   DW_AT_data_member_location: 4
 <2><aac>: Abbrev Number: 6 (DW_TAG_member)
    <aad>   DW_AT_name        : IDE
    <ab1>   DW_AT_decl_file   : 9
    <ab2>   DW_AT_decl_line   : 188
    <ab3>   DW_AT_decl_column : 12
    <ab4>   DW_AT_type        : <0x62b>
    <ab8>   DW_AT_data_member_location: 8
 <2><ab9>: Abbrev Number: 6 (DW_TAG_member)
    <aba>   DW_AT_name        : RTR
    <abe>   DW_AT_decl_file   : 9
    <abf>   DW_AT_decl_line   : 191
    <ac0>   DW_AT_decl_column : 12
    <ac1>   DW_AT_type        : <0x62b>
    <ac5>   DW_AT_data_member_location: 12
 <2><ac6>: Abbrev Number: 6 (DW_TAG_member)
    <ac7>   DW_AT_name        : DLC
    <acb>   DW_AT_decl_file   : 9
    <acc>   DW_AT_decl_line   : 194
    <acd>   DW_AT_decl_column : 12
    <ace>   DW_AT_type        : <0x62b>
    <ad2>   DW_AT_data_member_location: 16
 <2><ad3>: Abbrev Number: 1 (DW_TAG_member)
    <ad4>   DW_AT_name        : (indirect string, offset: 0x95ee0): Timestamp
    <ad8>   DW_AT_decl_file   : 9
    <ad9>   DW_AT_decl_line   : 197
    <ada>   DW_AT_decl_column : 12
    <adb>   DW_AT_type        : <0x62b>
    <adf>   DW_AT_data_member_location: 20
 <2><ae0>: Abbrev Number: 1 (DW_TAG_member)
    <ae1>   DW_AT_name        : (indirect string, offset: 0x8c3ca): FilterMatchIndex
    <ae5>   DW_AT_decl_file   : 9
    <ae6>   DW_AT_decl_line   : 201
    <ae7>   DW_AT_decl_column : 12
    <ae8>   DW_AT_type        : <0x62b>
    <aec>   DW_AT_data_member_location: 24
 <2><aed>: Abbrev Number: 0
 <1><aee>: Abbrev Number: 4 (DW_TAG_typedef)
    <aef>   DW_AT_name        : (indirect string, offset: 0x8c4e3): CAN_RxHeaderTypeDef
    <af3>   DW_AT_decl_file   : 9
    <af4>   DW_AT_decl_line   : 204
    <af5>   DW_AT_decl_column : 3
    <af6>   DW_AT_type        : <0xa8a>
 <1><afa>: Abbrev Number: 27 (DW_TAG_structure_type)
    <afb>   DW_AT_name        : (indirect string, offset: 0x8c597): __CAN_HandleTypeDef
    <aff>   DW_AT_byte_size   : 100
    <b00>   DW_AT_decl_file   : 9
    <b01>   DW_AT_decl_line   : 209
    <b02>   DW_AT_decl_column : 16
    <b03>   DW_AT_sibling     : <0xbff>
 <2><b07>: Abbrev Number: 1 (DW_TAG_member)
    <b08>   DW_AT_name        : (indirect string, offset: 0x8c543): Instance
    <b0c>   DW_AT_decl_file   : 9
    <b0d>   DW_AT_decl_line   : 211
    <b0e>   DW_AT_decl_column : 32
    <b0f>   DW_AT_type        : <0xbff>
    <b13>   DW_AT_data_member_location: 0
 <2><b14>: Abbrev Number: 1 (DW_TAG_member)
    <b15>   DW_AT_name        : (indirect string, offset: 0x96dbd): Init
    <b19>   DW_AT_decl_file   : 9
    <b1a>   DW_AT_decl_line   : 213
    <b1b>   DW_AT_decl_column : 31
    <b1c>   DW_AT_type        : <0xa1b>
    <b20>   DW_AT_data_member_location: 4
 <2><b21>: Abbrev Number: 1 (DW_TAG_member)
    <b22>   DW_AT_name        : (indirect string, offset: 0x9349b): State
    <b26>   DW_AT_decl_file   : 9
    <b27>   DW_AT_decl_line   : 215
    <b28>   DW_AT_decl_column : 31
    <b29>   DW_AT_type        : <0x97e>
    <b2d>   DW_AT_data_member_location: 32
 <2><b2e>: Abbrev Number: 1 (DW_TAG_member)
    <b2f>   DW_AT_name        : (indirect string, offset: 0x968e2): ErrorCode
    <b33>   DW_AT_decl_file   : 9
    <b34>   DW_AT_decl_line   : 217
    <b35>   DW_AT_decl_column : 31
    <b36>   DW_AT_type        : <0x637>
    <b3a>   DW_AT_data_member_location: 36
 <2><b3b>: Abbrev Number: 1 (DW_TAG_member)
    <b3c>   DW_AT_name        : (indirect string, offset: 0x9611b): TxMailbox0CompleteCallback
    <b40>   DW_AT_decl_file   : 9
    <b41>   DW_AT_decl_line   : 221
    <b42>   DW_AT_decl_column : 11
    <b43>   DW_AT_type        : <0xc14>
    <b47>   DW_AT_data_member_location: 40
 <2><b48>: Abbrev Number: 1 (DW_TAG_member)
    <b49>   DW_AT_name        : (indirect string, offset: 0x96246): TxMailbox1CompleteCallback
    <b4d>   DW_AT_decl_file   : 9
    <b4e>   DW_AT_decl_line   : 222
    <b4f>   DW_AT_decl_column : 11
    <b50>   DW_AT_type        : <0xc14>
    <b54>   DW_AT_data_member_location: 44
 <2><b55>: Abbrev Number: 1 (DW_TAG_member)
    <b56>   DW_AT_name        : (indirect string, offset: 0x960a1): TxMailbox2CompleteCallback
    <b5a>   DW_AT_decl_file   : 9
    <b5b>   DW_AT_decl_line   : 223
    <b5c>   DW_AT_decl_column : 11
    <b5d>   DW_AT_type        : <0xc14>
    <b61>   DW_AT_data_member_location: 48
 <2><b62>: Abbrev Number: 1 (DW_TAG_member)
    <b63>   DW_AT_name        : (indirect string, offset: 0x960fb): TxMailbox0AbortCallback
    <b67>   DW_AT_decl_file   : 9
    <b68>   DW_AT_decl_line   : 224
    <b69>   DW_AT_decl_column : 11
    <b6a>   DW_AT_type        : <0xc14>
    <b6e>   DW_AT_data_member_location: 52
 <2><b6f>: Abbrev Number: 1 (DW_TAG_member)
    <b70>   DW_AT_name        : (indirect string, offset: 0x95efc): TxMailbox1AbortCallback
    <b74>   DW_AT_decl_file   : 9
    <b75>   DW_AT_decl_line   : 225
    <b76>   DW_AT_decl_column : 11
    <b77>   DW_AT_type        : <0xc14>
    <b7b>   DW_AT_data_member_location: 56
 <2><b7c>: Abbrev Number: 1 (DW_TAG_member)
    <b7d>   DW_AT_name        : (indirect string, offset: 0x95f75): TxMailbox2AbortCallback
    <b81>   DW_AT_decl_file   : 9
    <b82>   DW_AT_decl_line   : 226
    <b83>   DW_AT_decl_column : 11
    <b84>   DW_AT_type        : <0xc14>
    <b88>   DW_AT_data_member_location: 60
 <2><b89>: Abbrev Number: 1 (DW_TAG_member)
    <b8a>   DW_AT_name        : (indirect string, offset: 0x8c846): RxFifo0MsgPendingCallback
    <b8e>   DW_AT_decl_file   : 9
    <b8f>   DW_AT_decl_line   : 227
    <b90>   DW_AT_decl_column : 11
    <b91>   DW_AT_type        : <0xc14>
    <b95>   DW_AT_data_member_location: 64
 <2><b96>: Abbrev Number: 1 (DW_TAG_member)
    <b97>   DW_AT_name        : (indirect string, offset: 0x8c3f7): RxFifo0FullCallback
    <b9b>   DW_AT_decl_file   : 9
    <b9c>   DW_AT_decl_line   : 228
    <b9d>   DW_AT_decl_column : 11
    <b9e>   DW_AT_type        : <0xc14>
    <ba2>   DW_AT_data_member_location: 68
 <2><ba3>: Abbrev Number: 1 (DW_TAG_member)
    <ba4>   DW_AT_name        : (indirect string, offset: 0x962bd): RxFifo1MsgPendingCallback
    <ba8>   DW_AT_decl_file   : 9
    <ba9>   DW_AT_decl_line   : 229
    <baa>   DW_AT_decl_column : 11
    <bab>   DW_AT_type        : <0xc14>
    <baf>   DW_AT_data_member_location: 72
 <2><bb0>: Abbrev Number: 1 (DW_TAG_member)
    <bb1>   DW_AT_name        : (indirect string, offset: 0x961f4): RxFifo1FullCallback
    <bb5>   DW_AT_decl_file   : 9
    <bb6>   DW_AT_decl_line   : 230
    <bb7>   DW_AT_decl_column : 11
    <bb8>   DW_AT_type        : <0xc14>
    <bbc>   DW_AT_data_member_location: 76
 <2><bbd>: Abbrev Number: 1 (DW_TAG_member)
    <bbe>   DW_AT_name        : (indirect string, offset: 0x96064): SleepCallback
    <bc2>   DW_AT_decl_file   : 9
    <bc3>   DW_AT_decl_line   : 231
    <bc4>   DW_AT_decl_column : 11
    <bc5>   DW_AT_type        : <0xc14>
    <bc9>   DW_AT_data_member_location: 80
 <2><bca>: Abbrev Number: 1 (DW_TAG_member)
    <bcb>   DW_AT_name        : (indirect string, offset: 0x9621c): WakeUpFromRxMsgCallback
    <bcf>   DW_AT_decl_file   : 9
    <bd0>   DW_AT_decl_line   : 232
    <bd1>   DW_AT_decl_column : 11
    <bd2>   DW_AT_type        : <0xc14>
    <bd6>   DW_AT_data_member_location: 84
 <2><bd7>: Abbrev Number: 1 (DW_TAG_member)
    <bd8>   DW_AT_name        : (indirect string, offset: 0x95a9d): ErrorCallback
    <bdc>   DW_AT_decl_file   : 9
    <bdd>   DW_AT_decl_line   : 233
    <bde>   DW_AT_decl_column : 11
    <bdf>   DW_AT_type        : <0xc14>
    <be3>   DW_AT_data_member_location: 88
 <2><be4>: Abbrev Number: 1 (DW_TAG_member)
    <be5>   DW_AT_name        : (indirect string, offset: 0x90c26): MspInitCallback
    <be9>   DW_AT_decl_file   : 9
    <bea>   DW_AT_decl_line   : 235
    <beb>   DW_AT_decl_column : 11
    <bec>   DW_AT_type        : <0xc14>
    <bf0>   DW_AT_data_member_location: 92
 <2><bf1>: Abbrev Number: 1 (DW_TAG_member)
    <bf2>   DW_AT_name        : (indirect string, offset: 0x9159b): MspDeInitCallback
    <bf6>   DW_AT_decl_file   : 9
    <bf7>   DW_AT_decl_line   : 236
    <bf8>   DW_AT_decl_column : 11
    <bf9>   DW_AT_type        : <0xc14>
    <bfd>   DW_AT_data_member_location: 96
 <2><bfe>: Abbrev Number: 0
 <1><bff>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <c00>   DW_AT_byte_size   : 4
    <c00>   DW_AT_type        : <0x8da>
 <1><c04>: Abbrev Number: 28 (DW_TAG_subroutine_type)
    <c05>   DW_AT_prototyped  : 1
    <c05>   DW_AT_sibling     : <0xc0f>
 <2><c09>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <c0a>   DW_AT_type        : <0xc0f>
 <2><c0e>: Abbrev Number: 0
 <1><c0f>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <c10>   DW_AT_byte_size   : 4
    <c10>   DW_AT_type        : <0xafa>
 <1><c14>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <c15>   DW_AT_byte_size   : 4
    <c15>   DW_AT_type        : <0xc04>
 <1><c19>: Abbrev Number: 4 (DW_TAG_typedef)
    <c1a>   DW_AT_name        : (indirect string, offset: 0x8c599): CAN_HandleTypeDef
    <c1e>   DW_AT_decl_file   : 9
    <c1f>   DW_AT_decl_line   : 239
    <c20>   DW_AT_decl_column : 3
    <c21>   DW_AT_type        : <0xafa>
 <1><c25>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <c26>   DW_AT_byte_size   : 4
    <c26>   DW_AT_type        : <0xc19>
 <1><c2a>: Abbrev Number: 3 (DW_TAG_variable)
    <c2b>   DW_AT_name        : (indirect string, offset: 0x8c76d): hcan
    <c2f>   DW_AT_decl_file   : 10
    <c30>   DW_AT_decl_line   : 35
    <c31>   DW_AT_decl_column : 26
    <c32>   DW_AT_type        : <0xc19>
    <c36>   DW_AT_external    : 1
    <c36>   DW_AT_declaration : 1
 <1><c36>: Abbrev Number: 2 (DW_TAG_variable)
    <c37>   DW_AT_name        : (indirect string, offset: 0x8c64a): CanH_RxSig_Gear
    <c3b>   DW_AT_decl_file   : 1
    <c3b>   DW_AT_decl_line   : 6
    <c3c>   DW_AT_decl_column : 7
    <c3d>   DW_AT_type        : <0x63c>
    <c41>   DW_AT_external    : 1
    <c41>   DW_AT_location    : 5 byte block: 3 c 1 0 20 	(DW_OP_addr: 2000010c)
 <1><c47>: Abbrev Number: 2 (DW_TAG_variable)
    <c48>   DW_AT_name        : (indirect string, offset: 0x8c677): CanH_RxSig_Ignition
    <c4c>   DW_AT_decl_file   : 1
    <c4c>   DW_AT_decl_line   : 7
    <c4d>   DW_AT_decl_column : 7
    <c4e>   DW_AT_type        : <0x63c>
    <c52>   DW_AT_external    : 1
    <c52>   DW_AT_location    : 5 byte block: 3 d 1 0 20 	(DW_OP_addr: 2000010d)
 <1><c58>: Abbrev Number: 2 (DW_TAG_variable)
    <c59>   DW_AT_name        : (indirect string, offset: 0x8c7da): CanH_RxSig_Rpm
    <c5d>   DW_AT_decl_file   : 1
    <c5d>   DW_AT_decl_line   : 8
    <c5e>   DW_AT_decl_column : 7
    <c5f>   DW_AT_type        : <0x63c>
    <c63>   DW_AT_external    : 1
    <c63>   DW_AT_location    : 5 byte block: 3 e 1 0 20 	(DW_OP_addr: 2000010e)
 <1><c69>: Abbrev Number: 2 (DW_TAG_variable)
    <c6a>   DW_AT_name        : (indirect string, offset: 0x8c49c): CanH_RxSig_Speed
    <c6e>   DW_AT_decl_file   : 1
    <c6e>   DW_AT_decl_line   : 9
    <c6f>   DW_AT_decl_column : 7
    <c70>   DW_AT_type        : <0x63c>
    <c74>   DW_AT_external    : 1
    <c74>   DW_AT_location    : 5 byte block: 3 f 1 0 20 	(DW_OP_addr: 2000010f)
 <1><c7a>: Abbrev Number: 2 (DW_TAG_variable)
    <c7b>   DW_AT_name        : (indirect string, offset: 0x8c36b): CanH_MainCounter
    <c7f>   DW_AT_decl_file   : 1
    <c7f>   DW_AT_decl_line   : 10
    <c80>   DW_AT_decl_column : 8
    <c81>   DW_AT_type        : <0x648>
    <c85>   DW_AT_external    : 1
    <c85>   DW_AT_location    : 5 byte block: 3 10 1 0 20 	(DW_OP_addr: 20000110)
 <1><c8b>: Abbrev Number: 2 (DW_TAG_variable)
    <c8c>   DW_AT_name        : (indirect string, offset: 0x8c54c): CanH_RxFifo0MsgPendingCnt
    <c90>   DW_AT_decl_file   : 1
    <c90>   DW_AT_decl_line   : 11
    <c91>   DW_AT_decl_column : 8
    <c92>   DW_AT_type        : <0x648>
    <c96>   DW_AT_external    : 1
    <c96>   DW_AT_location    : 5 byte block: 3 14 1 0 20 	(DW_OP_addr: 20000114)
 <1><c9c>: Abbrev Number: 2 (DW_TAG_variable)
    <c9d>   DW_AT_name        : (indirect string, offset: 0x8c70c): CanH_RxFifo0FullCnt
    <ca1>   DW_AT_decl_file   : 1
    <ca1>   DW_AT_decl_line   : 12
    <ca2>   DW_AT_decl_column : 8
    <ca3>   DW_AT_type        : <0x648>
    <ca7>   DW_AT_external    : 1
    <ca7>   DW_AT_location    : 5 byte block: 3 18 1 0 20 	(DW_OP_addr: 20000118)
 <1><cad>: Abbrev Number: 2 (DW_TAG_variable)
    <cae>   DW_AT_name        : (indirect string, offset: 0x8c69c): CanH_RxHeader
    <cb2>   DW_AT_decl_file   : 1
    <cb2>   DW_AT_decl_line   : 13
    <cb3>   DW_AT_decl_column : 21
    <cb4>   DW_AT_type        : <0xaee>
    <cb8>   DW_AT_external    : 1
    <cb8>   DW_AT_location    : 5 byte block: 3 1c 1 0 20 	(DW_OP_addr: 2000011c)
 <1><cbe>: Abbrev Number: 10 (DW_TAG_array_type)
    <cbf>   DW_AT_type        : <0x63c>
    <cc3>   DW_AT_sibling     : <0xcce>
 <2><cc7>: Abbrev Number: 11 (DW_TAG_subrange_type)
    <cc8>   DW_AT_type        : <0x618>
    <ccc>   DW_AT_upper_bound : 7
 <2><ccd>: Abbrev Number: 0
 <1><cce>: Abbrev Number: 2 (DW_TAG_variable)
    <ccf>   DW_AT_name        : (indirect string, offset: 0x8c6aa): CanH_RxData
    <cd3>   DW_AT_decl_file   : 1
    <cd3>   DW_AT_decl_line   : 14
    <cd4>   DW_AT_decl_column : 7
    <cd5>   DW_AT_type        : <0xcbe>
    <cd9>   DW_AT_external    : 1
    <cd9>   DW_AT_location    : 5 byte block: 3 38 1 0 20 	(DW_OP_addr: 20000138)
 <1><cdf>: Abbrev Number: 2 (DW_TAG_variable)
    <ce0>   DW_AT_name        : (indirect string, offset: 0x8c669): CanH_TxHeader
    <ce4>   DW_AT_decl_file   : 1
    <ce4>   DW_AT_decl_line   : 15
    <ce5>   DW_AT_decl_column : 21
    <ce6>   DW_AT_type        : <0xa7e>
    <cea>   DW_AT_external    : 1
    <cea>   DW_AT_location    : 5 byte block: 3 40 1 0 20 	(DW_OP_addr: 20000140)
 <1><cf0>: Abbrev Number: 2 (DW_TAG_variable)
    <cf1>   DW_AT_name        : (indirect string, offset: 0x8c62d): CanH_TxData
    <cf5>   DW_AT_decl_file   : 1
    <cf5>   DW_AT_decl_line   : 16
    <cf6>   DW_AT_decl_column : 7
    <cf7>   DW_AT_type        : <0xcbe>
    <cfb>   DW_AT_external    : 1
    <cfb>   DW_AT_location    : 5 byte block: 3 58 1 0 20 	(DW_OP_addr: 20000158)
 <1><d01>: Abbrev Number: 2 (DW_TAG_variable)
    <d02>   DW_AT_name        : (indirect string, offset: 0x8c65a): CanH_TxMailbox
    <d06>   DW_AT_decl_file   : 1
    <d06>   DW_AT_decl_line   : 17
    <d07>   DW_AT_decl_column : 8
    <d08>   DW_AT_type        : <0x648>
    <d0c>   DW_AT_external    : 1
    <d0c>   DW_AT_location    : 5 byte block: 3 60 1 0 20 	(DW_OP_addr: 20000160)
 <1><d12>: Abbrev Number: 2 (DW_TAG_variable)
    <d13>   DW_AT_name        : (indirect string, offset: 0x8c874): CanH_XcpTxData
    <d17>   DW_AT_decl_file   : 1
    <d17>   DW_AT_decl_line   : 18
    <d18>   DW_AT_decl_column : 7
    <d19>   DW_AT_type        : <0xcbe>
    <d1d>   DW_AT_external    : 1
    <d1d>   DW_AT_location    : 5 byte block: 3 64 1 0 20 	(DW_OP_addr: 20000164)
 <1><d23>: Abbrev Number: 2 (DW_TAG_variable)
    <d24>   DW_AT_name        : (indirect string, offset: 0x8c33e): CanH_XcpTxMailbox
    <d28>   DW_AT_decl_file   : 1
    <d28>   DW_AT_decl_line   : 19
    <d29>   DW_AT_decl_column : 8
    <d2a>   DW_AT_type        : <0x648>
    <d2e>   DW_AT_external    : 1
    <d2e>   DW_AT_location    : 5 byte block: 3 6c 1 0 20 	(DW_OP_addr: 2000016c)
 <1><d34>: Abbrev Number: 2 (DW_TAG_variable)
    <d35>   DW_AT_name        : (indirect string, offset: 0x8c419): CanH_XcpTxHeader
    <d39>   DW_AT_decl_file   : 1
    <d39>   DW_AT_decl_line   : 20
    <d3a>   DW_AT_decl_column : 21
    <d3b>   DW_AT_type        : <0xa7e>
    <d3f>   DW_AT_external    : 1
    <d3f>   DW_AT_location    : 5 byte block: 3 70 1 0 20 	(DW_OP_addr: 20000170)
 <1><d45>: Abbrev Number: 2 (DW_TAG_variable)
    <d46>   DW_AT_name        : (indirect string, offset: 0x8c582): CanH_RequestBusSleep
    <d4a>   DW_AT_decl_file   : 1
    <d4a>   DW_AT_decl_line   : 21
    <d4b>   DW_AT_decl_column : 7
    <d4c>   DW_AT_type        : <0x63c>
    <d50>   DW_AT_external    : 1
    <d50>   DW_AT_location    : 5 byte block: 3 88 1 0 20 	(DW_OP_addr: 20000188)
 <1><d56>: Abbrev Number: 2 (DW_TAG_variable)
    <d57>   DW_AT_name        : (indirect string, offset: 0x8c61a): CanH_NoCommCounter
    <d5b>   DW_AT_decl_file   : 1
    <d5b>   DW_AT_decl_line   : 22
    <d5c>   DW_AT_decl_column : 8
    <d5d>   DW_AT_type        : <0x648>
    <d61>   DW_AT_external    : 1
    <d61>   DW_AT_location    : 5 byte block: 3 8c 1 0 20 	(DW_OP_addr: 2000018c)
 <1><d67>: Abbrev Number: 2 (DW_TAG_variable)
    <d68>   DW_AT_name        : (indirect string, offset: 0x8c484): CanH_CommunicationState
    <d6c>   DW_AT_decl_file   : 1
    <d6c>   DW_AT_decl_line   : 23
    <d6d>   DW_AT_decl_column : 16
    <d6e>   DW_AT_type        : <0x67e>
    <d72>   DW_AT_external    : 1
    <d72>   DW_AT_location    : 5 byte block: 3 90 1 0 20 	(DW_OP_addr: 20000190)
 <1><d78>: Abbrev Number: 2 (DW_TAG_variable)
    <d79>   DW_AT_name        : (indirect string, offset: 0x8c7cc): CanH_XcpArray
    <d7d>   DW_AT_decl_file   : 1
    <d7d>   DW_AT_decl_line   : 24
    <d7e>   DW_AT_decl_column : 7
    <d7f>   DW_AT_type        : <0xcbe>
    <d83>   DW_AT_external    : 1
    <d83>   DW_AT_location    : 5 byte block: 3 94 1 0 20 	(DW_OP_addr: 20000194)
 <1><d89>: Abbrev Number: 2 (DW_TAG_variable)
    <d8a>   DW_AT_name        : (indirect string, offset: 0x8c5ab): CanH_DiagArray
    <d8e>   DW_AT_decl_file   : 1
    <d8e>   DW_AT_decl_line   : 25
    <d8f>   DW_AT_decl_column : 7
    <d90>   DW_AT_type        : <0xcbe>
    <d94>   DW_AT_external    : 1
    <d94>   DW_AT_location    : 5 byte block: 3 9c 1 0 20 	(DW_OP_addr: 2000019c)
 <1><d9a>: Abbrev Number: 2 (DW_TAG_variable)
    <d9b>   DW_AT_name        : (indirect string, offset: 0x8c6df): CanH_DiagRxHeader
    <d9f>   DW_AT_decl_file   : 1
    <d9f>   DW_AT_decl_line   : 26
    <da0>   DW_AT_decl_column : 21
    <da1>   DW_AT_type        : <0xaee>
    <da5>   DW_AT_external    : 1
    <da5>   DW_AT_location    : 5 byte block: 3 a4 1 0 20 	(DW_OP_addr: 200001a4)
 <1><dab>: Abbrev Number: 2 (DW_TAG_variable)
    <dac>   DW_AT_name        : (indirect string, offset: 0x8c42a): CanH_XcpRxHeader
    <db0>   DW_AT_decl_file   : 1
    <db0>   DW_AT_decl_line   : 27
    <db1>   DW_AT_decl_column : 21
    <db2>   DW_AT_type        : <0xaee>
    <db6>   DW_AT_external    : 1
    <db6>   DW_AT_location    : 5 byte block: 3 c0 1 0 20 	(DW_OP_addr: 200001c0)
 <1><dbc>: Abbrev Number: 2 (DW_TAG_variable)
    <dbd>   DW_AT_name        : (indirect string, offset: 0x8c7e9): Can_isXcpActive
    <dc1>   DW_AT_decl_file   : 1
    <dc1>   DW_AT_decl_line   : 28
    <dc2>   DW_AT_decl_column : 7
    <dc3>   DW_AT_type        : <0x63c>
    <dc7>   DW_AT_external    : 1
    <dc7>   DW_AT_location    : 5 byte block: 3 dc 1 0 20 	(DW_OP_addr: 200001dc)
 <1><dcd>: Abbrev Number: 3 (DW_TAG_variable)
    <dce>   DW_AT_name        : (indirect string, offset: 0x1edc6): CanH_TxSig_StatusList1
    <dd2>   DW_AT_decl_file   : 1
    <dd3>   DW_AT_decl_line   : 31
    <dd4>   DW_AT_decl_column : 14
    <dd5>   DW_AT_type        : <0x63c>
    <dd9>   DW_AT_external    : 1
    <dd9>   DW_AT_declaration : 1
 <1><dd9>: Abbrev Number: 3 (DW_TAG_variable)
    <dda>   DW_AT_name        : (indirect string, offset: 0x1eddd): CanH_TxSig_StatusList2
    <dde>   DW_AT_decl_file   : 1
    <ddf>   DW_AT_decl_line   : 32
    <de0>   DW_AT_decl_column : 14
    <de1>   DW_AT_type        : <0x63c>
    <de5>   DW_AT_external    : 1
    <de5>   DW_AT_declaration : 1
 <1><de5>: Abbrev Number: 3 (DW_TAG_variable)
    <de6>   DW_AT_name        : (indirect string, offset: 0x1edf4): CanH_TxSig_StatusList3
    <dea>   DW_AT_decl_file   : 1
    <deb>   DW_AT_decl_line   : 33
    <dec>   DW_AT_decl_column : 14
    <ded>   DW_AT_type        : <0x63c>
    <df1>   DW_AT_external    : 1
    <df1>   DW_AT_declaration : 1
 <1><df1>: Abbrev Number: 3 (DW_TAG_variable)
    <df2>   DW_AT_name        : (indirect string, offset: 0x1ee0b): CanH_TxSig_StatusList4
    <df6>   DW_AT_decl_file   : 1
    <df7>   DW_AT_decl_line   : 34
    <df8>   DW_AT_decl_column : 14
    <df9>   DW_AT_type        : <0x63c>
    <dfd>   DW_AT_external    : 1
    <dfd>   DW_AT_declaration : 1
 <1><dfd>: Abbrev Number: 3 (DW_TAG_variable)
    <dfe>   DW_AT_name        : (indirect string, offset: 0x1ee22): CanH_TxSig_StatusList5
    <e02>   DW_AT_decl_file   : 1
    <e03>   DW_AT_decl_line   : 35
    <e04>   DW_AT_decl_column : 14
    <e05>   DW_AT_type        : <0x63c>
    <e09>   DW_AT_external    : 1
    <e09>   DW_AT_declaration : 1
 <1><e09>: Abbrev Number: 3 (DW_TAG_variable)
    <e0a>   DW_AT_name        : (indirect string, offset: 0x1ee39): CanH_TxSig_StatusList6
    <e0e>   DW_AT_decl_file   : 1
    <e0f>   DW_AT_decl_line   : 36
    <e10>   DW_AT_decl_column : 14
    <e11>   DW_AT_type        : <0x63c>
    <e15>   DW_AT_external    : 1
    <e15>   DW_AT_declaration : 1
 <1><e15>: Abbrev Number: 3 (DW_TAG_variable)
    <e16>   DW_AT_name        : (indirect string, offset: 0x1ee50): CanH_TxSig_StatusList7
    <e1a>   DW_AT_decl_file   : 1
    <e1b>   DW_AT_decl_line   : 37
    <e1c>   DW_AT_decl_column : 14
    <e1d>   DW_AT_type        : <0x63c>
    <e21>   DW_AT_external    : 1
    <e21>   DW_AT_declaration : 1
 <1><e21>: Abbrev Number: 3 (DW_TAG_variable)
    <e22>   DW_AT_name        : (indirect string, offset: 0x59826): CanH_TxSig_StatusList8
    <e26>   DW_AT_decl_file   : 1
    <e27>   DW_AT_decl_line   : 38
    <e28>   DW_AT_decl_column : 14
    <e29>   DW_AT_type        : <0x63c>
    <e2d>   DW_AT_external    : 1
    <e2d>   DW_AT_declaration : 1
 <1><e2d>: Abbrev Number: 3 (DW_TAG_variable)
    <e2e>   DW_AT_name        : (indirect string, offset: 0x8e94): CanH_TxSig_TotalCurrentConsumption
    <e32>   DW_AT_decl_file   : 1
    <e33>   DW_AT_decl_line   : 39
    <e34>   DW_AT_decl_column : 14
    <e35>   DW_AT_type        : <0x63c>
    <e39>   DW_AT_external    : 1
    <e39>   DW_AT_declaration : 1
 <1><e39>: Abbrev Number: 3 (DW_TAG_variable)
    <e3a>   DW_AT_name        : (indirect string, offset: 0x4cc): CanH_TxSig_PowerSupplyNetworkWarning
    <e3e>   DW_AT_decl_file   : 1
    <e3f>   DW_AT_decl_line   : 40
    <e40>   DW_AT_decl_column : 14
    <e41>   DW_AT_type        : <0x63c>
    <e45>   DW_AT_external    : 1
    <e45>   DW_AT_declaration : 1
 <1><e45>: Abbrev Number: 3 (DW_TAG_variable)
    <e46>   DW_AT_name        : (indirect string, offset: 0x1f8b0): CanH_TxSig_SupplyVoltage
    <e4a>   DW_AT_decl_file   : 1
    <e4b>   DW_AT_decl_line   : 41
    <e4c>   DW_AT_decl_column : 14
    <e4d>   DW_AT_type        : <0x63c>
    <e51>   DW_AT_external    : 1
    <e51>   DW_AT_declaration : 1
 <1><e51>: Abbrev Number: 3 (DW_TAG_variable)
    <e52>   DW_AT_name        : (indirect string, offset: 0x407f6): CanH_RxSig_CommandList1
    <e56>   DW_AT_decl_file   : 1
    <e57>   DW_AT_decl_line   : 42
    <e58>   DW_AT_decl_column : 14
    <e59>   DW_AT_type        : <0x63c>
    <e5d>   DW_AT_external    : 1
    <e5d>   DW_AT_declaration : 1
 <1><e5d>: Abbrev Number: 3 (DW_TAG_variable)
    <e5e>   DW_AT_name        : (indirect string, offset: 0x4080e): CanH_RxSig_CommandList2
    <e62>   DW_AT_decl_file   : 1
    <e63>   DW_AT_decl_line   : 43
    <e64>   DW_AT_decl_column : 14
    <e65>   DW_AT_type        : <0x63c>
    <e69>   DW_AT_external    : 1
    <e69>   DW_AT_declaration : 1
 <1><e69>: Abbrev Number: 3 (DW_TAG_variable)
    <e6a>   DW_AT_name        : (indirect string, offset: 0x40826): CanH_RxSig_CommandList3
    <e6e>   DW_AT_decl_file   : 1
    <e6f>   DW_AT_decl_line   : 44
    <e70>   DW_AT_decl_column : 14
    <e71>   DW_AT_type        : <0x63c>
    <e75>   DW_AT_external    : 1
    <e75>   DW_AT_declaration : 1
 <1><e75>: Abbrev Number: 3 (DW_TAG_variable)
    <e76>   DW_AT_name        : (indirect string, offset: 0x4083e): CanH_RxSig_CommandList4
    <e7a>   DW_AT_decl_file   : 1
    <e7b>   DW_AT_decl_line   : 45
    <e7c>   DW_AT_decl_column : 14
    <e7d>   DW_AT_type        : <0x63c>
    <e81>   DW_AT_external    : 1
    <e81>   DW_AT_declaration : 1
 <1><e81>: Abbrev Number: 3 (DW_TAG_variable)
    <e82>   DW_AT_name        : (indirect string, offset: 0x40856): CanH_RxSig_CommandList5
    <e86>   DW_AT_decl_file   : 1
    <e87>   DW_AT_decl_line   : 46
    <e88>   DW_AT_decl_column : 14
    <e89>   DW_AT_type        : <0x63c>
    <e8d>   DW_AT_external    : 1
    <e8d>   DW_AT_declaration : 1
 <1><e8d>: Abbrev Number: 3 (DW_TAG_variable)
    <e8e>   DW_AT_name        : (indirect string, offset: 0x5d8e7): CanH_RxSig_CommandList6
    <e92>   DW_AT_decl_file   : 1
    <e93>   DW_AT_decl_line   : 47
    <e94>   DW_AT_decl_column : 14
    <e95>   DW_AT_type        : <0x63c>
    <e99>   DW_AT_external    : 1
    <e99>   DW_AT_declaration : 1
 <1><e99>: Abbrev Number: 3 (DW_TAG_variable)
    <e9a>   DW_AT_name        : (indirect string, offset: 0x4089d): CanH_RxSig_CommandList7
    <e9e>   DW_AT_decl_file   : 1
    <e9f>   DW_AT_decl_line   : 48
    <ea0>   DW_AT_decl_column : 14
    <ea1>   DW_AT_type        : <0x63c>
    <ea5>   DW_AT_external    : 1
    <ea5>   DW_AT_declaration : 1
 <1><ea5>: Abbrev Number: 3 (DW_TAG_variable)
    <ea6>   DW_AT_name        : (indirect string, offset: 0x408b5): CanH_RxSig_CommandList8
    <eaa>   DW_AT_decl_file   : 1
    <eab>   DW_AT_decl_line   : 49
    <eac>   DW_AT_decl_column : 14
    <ead>   DW_AT_type        : <0x63c>
    <eb1>   DW_AT_external    : 1
    <eb1>   DW_AT_declaration : 1
 <1><eb1>: Abbrev Number: 16 (DW_TAG_subprogram)
    <eb2>   DW_AT_external    : 1
    <eb2>   DW_AT_name        : (indirect string, offset: 0x8c5ba): HAL_CAN_GetRxMessage
    <eb6>   DW_AT_decl_file   : 9
    <eb6>   DW_AT_decl_line   : 684
    <eb8>   DW_AT_decl_column : 19
    <eb9>   DW_AT_prototyped  : 1
    <eb9>   DW_AT_type        : <0x936>
    <ebd>   DW_AT_declaration : 1
    <ebd>   DW_AT_sibling     : <0xed6>
 <2><ec1>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <ec2>   DW_AT_type        : <0xc25>
 <2><ec6>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <ec7>   DW_AT_type        : <0x62b>
 <2><ecb>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <ecc>   DW_AT_type        : <0xed6>
 <2><ed0>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <ed1>   DW_AT_type        : <0xedb>
 <2><ed5>: Abbrev Number: 0
 <1><ed6>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <ed7>   DW_AT_byte_size   : 4
    <ed7>   DW_AT_type        : <0xaee>
 <1><edb>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <edc>   DW_AT_byte_size   : 4
    <edc>   DW_AT_type        : <0x61f>
 <1><ee0>: Abbrev Number: 16 (DW_TAG_subprogram)
    <ee1>   DW_AT_external    : 1
    <ee1>   DW_AT_name        : (indirect string, offset: 0x8c8b1): HAL_CAN_RequestSleep
    <ee5>   DW_AT_decl_file   : 9
    <ee5>   DW_AT_decl_line   : 676
    <ee7>   DW_AT_decl_column : 19
    <ee8>   DW_AT_prototyped  : 1
    <ee8>   DW_AT_type        : <0x936>
    <eec>   DW_AT_declaration : 1
    <eec>   DW_AT_sibling     : <0xef6>
 <2><ef0>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <ef1>   DW_AT_type        : <0xc25>
 <2><ef5>: Abbrev Number: 0
 <1><ef6>: Abbrev Number: 16 (DW_TAG_subprogram)
    <ef7>   DW_AT_external    : 1
    <ef7>   DW_AT_name        : (indirect string, offset: 0x8c604): HAL_CAN_IsSleepActive
    <efb>   DW_AT_decl_file   : 9
    <efb>   DW_AT_decl_line   : 678
    <efd>   DW_AT_decl_column : 10
    <efe>   DW_AT_prototyped  : 1
    <efe>   DW_AT_type        : <0x62b>
    <f02>   DW_AT_declaration : 1
    <f02>   DW_AT_sibling     : <0xf0c>
 <2><f06>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <f07>   DW_AT_type        : <0xc25>
 <2><f0b>: Abbrev Number: 0
 <1><f0c>: Abbrev Number: 16 (DW_TAG_subprogram)
    <f0d>   DW_AT_external    : 1
    <f0d>   DW_AT_name        : (indirect string, offset: 0x8c68b): HAL_CAN_GetError
    <f11>   DW_AT_decl_file   : 9
    <f11>   DW_AT_decl_line   : 734
    <f13>   DW_AT_decl_column : 10
    <f14>   DW_AT_prototyped  : 1
    <f14>   DW_AT_type        : <0x62b>
    <f18>   DW_AT_declaration : 1
    <f18>   DW_AT_sibling     : <0xf22>
 <2><f1c>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <f1d>   DW_AT_type        : <0xc25>
 <2><f21>: Abbrev Number: 0
 <1><f22>: Abbrev Number: 16 (DW_TAG_subprogram)
    <f23>   DW_AT_external    : 1
    <f23>   DW_AT_name        : (indirect string, offset: 0x8c783): HAL_CAN_AddTxMessage
    <f27>   DW_AT_decl_file   : 9
    <f27>   DW_AT_decl_line   : 679
    <f29>   DW_AT_decl_column : 19
    <f2a>   DW_AT_prototyped  : 1
    <f2a>   DW_AT_type        : <0x936>
    <f2e>   DW_AT_declaration : 1
    <f2e>   DW_AT_sibling     : <0xf47>
 <2><f32>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <f33>   DW_AT_type        : <0xc25>
 <2><f37>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <f38>   DW_AT_type        : <0xf47>
 <2><f3c>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <f3d>   DW_AT_type        : <0xedb>
 <2><f41>: Abbrev Number: 7 (DW_TAG_formal_parameter)
    <f42>   DW_AT_type        : <0xf4c>
 <2><f46>: Abbrev Number: 0
 <1><f47>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <f48>   DW_AT_byte_size   : 4
    <f48>   DW_AT_type        : <0xa7e>
 <1><f4c>: Abbrev Number: 9 (DW_TAG_pointer_type)
    <f4d>   DW_AT_byte_size   : 4
    <f4d>   DW_AT_type        : <0x62b>
 <1><f51>: Abbrev Number: 29 (DW_TAG_subprogram)
    <f52>   DW_AT_external    : 1
    <f52>   DW_AT_name        : (indirect string, offset: 0x8c3b9): Xcp_MainFunction
    <f56>   DW_AT_decl_file   : 11
    <f57>   DW_AT_decl_line   : 6
    <f58>   DW_AT_decl_column : 13
    <f59>   DW_AT_prototyped  : 1
    <f59>   DW_AT_declaration : 1
 <1><f59>: Abbrev Number: 30 (DW_TAG_subprogram)
    <f5a>   DW_AT_external    : 1
    <f5a>   DW_AT_name        : (indirect string, offset: 0x8c3ef): HAL_CAN_RxFifo0FullCallback
    <f5e>   DW_AT_decl_file   : 1
    <f5f>   DW_AT_decl_line   : 300
    <f61>   DW_AT_decl_column : 6
    <f62>   DW_AT_prototyped  : 1
    <f62>   DW_AT_low_pc      : 0x8005c9c
    <f66>   DW_AT_high_pc     : 0x18c
    <f6a>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <f6c>   DW_AT_call_all_tail_calls: 1
    <f6c>   DW_AT_sibling     : <0xfce>
 <2><f70>: Abbrev Number: 31 (DW_TAG_formal_parameter)
    <f71>   DW_AT_name        : (indirect string, offset: 0x8c76d): hcan
    <f75>   DW_AT_decl_file   : 1
    <f76>   DW_AT_decl_line   : 300
    <f78>   DW_AT_decl_column : 53
    <f79>   DW_AT_type        : <0xc25>
    <f7d>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><f80>: Abbrev Number: 17 (DW_TAG_lexical_block)
    <f81>   DW_AT_low_pc      : 0x8005d3e
    <f85>   DW_AT_high_pc     : 0x1e
    <f89>   DW_AT_sibling     : <0xf9b>
 <3><f8d>: Abbrev Number: 14 (DW_TAG_variable)
    <f8e>   DW_AT_name        : i
    <f90>   DW_AT_decl_file   : 1
    <f90>   DW_AT_decl_line   : 338
    <f92>   DW_AT_decl_column : 13
    <f93>   DW_AT_type        : <0x63c>
    <f97>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <3><f9a>: Abbrev Number: 0
 <2><f9b>: Abbrev Number: 17 (DW_TAG_lexical_block)
    <f9c>   DW_AT_low_pc      : 0x8005d78
    <fa0>   DW_AT_high_pc     : 0x1e
    <fa4>   DW_AT_sibling     : <0xfb6>
 <3><fa8>: Abbrev Number: 14 (DW_TAG_variable)
    <fa9>   DW_AT_name        : i
    <fab>   DW_AT_decl_file   : 1
    <fab>   DW_AT_decl_line   : 353
    <fad>   DW_AT_decl_column : 13
    <fae>   DW_AT_type        : <0x63c>
    <fb2>   DW_AT_location    : 2 byte block: 91 76 	(DW_OP_fbreg: -10)
 <3><fb5>: Abbrev Number: 0
 <2><fb6>: Abbrev Number: 19 (DW_TAG_lexical_block)
    <fb7>   DW_AT_low_pc      : 0x8005dc0
    <fbb>   DW_AT_high_pc     : 0x1a
 <3><fbf>: Abbrev Number: 14 (DW_TAG_variable)
    <fc0>   DW_AT_name        : i
    <fc2>   DW_AT_decl_file   : 1
    <fc2>   DW_AT_decl_line   : 371
    <fc4>   DW_AT_decl_column : 12
    <fc5>   DW_AT_type        : <0x63c>
    <fc9>   DW_AT_location    : 2 byte block: 91 75 	(DW_OP_fbreg: -11)
 <3><fcc>: Abbrev Number: 0
 <2><fcd>: Abbrev Number: 0
 <1><fce>: Abbrev Number: 32 (DW_TAG_subprogram)
    <fcf>   DW_AT_external    : 1
    <fcf>   DW_AT_name        : (indirect string, offset: 0x8c83e): HAL_CAN_RxFifo0MsgPendingCallback
    <fd3>   DW_AT_decl_file   : 1
    <fd4>   DW_AT_decl_line   : 222
    <fd5>   DW_AT_decl_column : 6
    <fd6>   DW_AT_prototyped  : 1
    <fd6>   DW_AT_low_pc      : 0x8005b04
    <fda>   DW_AT_high_pc     : 0x198
    <fde>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <fe0>   DW_AT_call_all_tail_calls: 1
    <fe0>   DW_AT_sibling     : <0x1041>
 <2><fe4>: Abbrev Number: 33 (DW_TAG_formal_parameter)
    <fe5>   DW_AT_name        : (indirect string, offset: 0x8c76d): hcan
    <fe9>   DW_AT_decl_file   : 1
    <fea>   DW_AT_decl_line   : 222
    <feb>   DW_AT_decl_column : 59
    <fec>   DW_AT_type        : <0xc25>
    <ff0>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><ff3>: Abbrev Number: 17 (DW_TAG_lexical_block)
    <ff4>   DW_AT_low_pc      : 0x8005bac
    <ff8>   DW_AT_high_pc     : 0x1e
    <ffc>   DW_AT_sibling     : <0x100e>
 <3><1000>: Abbrev Number: 14 (DW_TAG_variable)
    <1001>   DW_AT_name        : i
    <1003>   DW_AT_decl_file   : 1
    <1003>   DW_AT_decl_line   : 261
    <1005>   DW_AT_decl_column : 13
    <1006>   DW_AT_type        : <0x63c>
    <100a>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <3><100d>: Abbrev Number: 0
 <2><100e>: Abbrev Number: 17 (DW_TAG_lexical_block)
    <100f>   DW_AT_low_pc      : 0x8005be6
    <1013>   DW_AT_high_pc     : 0x1e
    <1017>   DW_AT_sibling     : <0x1029>
 <3><101b>: Abbrev Number: 14 (DW_TAG_variable)
    <101c>   DW_AT_name        : i
    <101e>   DW_AT_decl_file   : 1
    <101e>   DW_AT_decl_line   : 276
    <1020>   DW_AT_decl_column : 13
    <1021>   DW_AT_type        : <0x63c>
    <1025>   DW_AT_location    : 2 byte block: 91 76 	(DW_OP_fbreg: -10)
 <3><1028>: Abbrev Number: 0
 <2><1029>: Abbrev Number: 19 (DW_TAG_lexical_block)
    <102a>   DW_AT_low_pc      : 0x8005c2e
    <102e>   DW_AT_high_pc     : 0x1a
 <3><1032>: Abbrev Number: 14 (DW_TAG_variable)
    <1033>   DW_AT_name        : i
    <1035>   DW_AT_decl_file   : 1
    <1035>   DW_AT_decl_line   : 294
    <1037>   DW_AT_decl_column : 12
    <1038>   DW_AT_type        : <0x63c>
    <103c>   DW_AT_location    : 2 byte block: 91 75 	(DW_OP_fbreg: -11)
 <3><103f>: Abbrev Number: 0
 <2><1040>: Abbrev Number: 0
 <1><1041>: Abbrev Number: 34 (DW_TAG_subprogram)
    <1042>   DW_AT_external    : 1
    <1042>   DW_AT_name        : (indirect string, offset: 0x8c4c1): CanH_MainFunction
    <1046>   DW_AT_decl_file   : 1
    <1047>   DW_AT_decl_line   : 55
    <1048>   DW_AT_decl_column : 6
    <1049>   DW_AT_prototyped  : 1
    <1049>   DW_AT_low_pc      : 0x800583c
    <104d>   DW_AT_high_pc     : 0x2c8
    <1051>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <1053>   DW_AT_call_all_tail_calls: 1
 <2><1053>: Abbrev Number: 17 (DW_TAG_lexical_block)
    <1054>   DW_AT_low_pc      : 0x800596a
    <1058>   DW_AT_high_pc     : 0x1a
    <105c>   DW_AT_sibling     : <0x106d>
 <3><1060>: Abbrev Number: 21 (DW_TAG_variable)
    <1061>   DW_AT_name        : i
    <1063>   DW_AT_decl_file   : 1
    <1063>   DW_AT_decl_line   : 119
    <1064>   DW_AT_decl_column : 15
    <1065>   DW_AT_type        : <0x63c>
    <1069>   DW_AT_location    : 2 byte block: 91 77 	(DW_OP_fbreg: -9)
 <3><106c>: Abbrev Number: 0
 <2><106d>: Abbrev Number: 19 (DW_TAG_lexical_block)
    <106e>   DW_AT_low_pc      : 0x8005a82
    <1072>   DW_AT_high_pc     : 0x1a
 <3><1076>: Abbrev Number: 21 (DW_TAG_variable)
    <1077>   DW_AT_name        : i
    <1079>   DW_AT_decl_file   : 1
    <1079>   DW_AT_decl_line   : 216
    <107a>   DW_AT_decl_column : 12
    <107b>   DW_AT_type        : <0x63c>
    <107f>   DW_AT_location    : 2 byte block: 91 76 	(DW_OP_fbreg: -10)
 <3><1082>: Abbrev Number: 0
 <2><1083>: Abbrev Number: 0
 <1><1084>: Abbrev Number: 0
  Compilation Unit @ offset 0x1085:
   Length:        0x786 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x364
   Pointer Size:  4
