Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x44b (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 17 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x87bec): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x326d): ../Core/Src/gpio.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x4a0d8): C:/Users/Daniel/Desktop/FG9322/EDAS - Electronic Data Acquisition System/EDAS_FBL/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 2 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 1
    <2c>   DW_AT_encoding    : 6	(signed char)
    <2d>   DW_AT_name        : (indirect string, offset: 0x661a5): signed char
 <1><31>: Abbrev Number: 2 (DW_TAG_base_type)
    <32>   DW_AT_byte_size   : 1
    <33>   DW_AT_encoding    : 8	(unsigned char)
    <34>   DW_AT_name        : (indirect string, offset: 0x61e6f): unsigned char
 <1><38>: Abbrev Number: 2 (DW_TAG_base_type)
    <39>   DW_AT_byte_size   : 2
    <3a>   DW_AT_encoding    : 5	(signed)
    <3b>   DW_AT_name        : (indirect string, offset: 0x5215): short int
 <1><3f>: Abbrev Number: 3 (DW_TAG_typedef)
    <40>   DW_AT_name        : (indirect string, offset: 0x6e27b): __uint16_t
    <44>   DW_AT_decl_file   : 2
    <45>   DW_AT_decl_line   : 57
    <46>   DW_AT_decl_column : 25
    <47>   DW_AT_type        : <0x4b>
 <1><4b>: Abbrev Number: 2 (DW_TAG_base_type)
    <4c>   DW_AT_byte_size   : 2
    <4d>   DW_AT_encoding    : 7	(unsigned)
    <4e>   DW_AT_name        : (indirect string, offset: 0x4403b): short unsigned int
 <1><52>: Abbrev Number: 2 (DW_TAG_base_type)
    <53>   DW_AT_byte_size   : 4
    <54>   DW_AT_encoding    : 5	(signed)
    <55>   DW_AT_name        : (indirect string, offset: 0x1b474): long int
 <1><59>: Abbrev Number: 3 (DW_TAG_typedef)
    <5a>   DW_AT_name        : (indirect string, offset: 0x3b7cb): __uint32_t
    <5e>   DW_AT_decl_file   : 2
    <5f>   DW_AT_decl_line   : 79
    <60>   DW_AT_decl_column : 25
    <61>   DW_AT_type        : <0x65>
 <1><65>: Abbrev Number: 2 (DW_TAG_base_type)
    <66>   DW_AT_byte_size   : 4
    <67>   DW_AT_encoding    : 7	(unsigned)
    <68>   DW_AT_name        : (indirect string, offset: 0x4fd87): long unsigned int
 <1><6c>: Abbrev Number: 2 (DW_TAG_base_type)
    <6d>   DW_AT_byte_size   : 8
    <6e>   DW_AT_encoding    : 5	(signed)
    <6f>   DW_AT_name        : (indirect string, offset: 0x35fa4): long long int
 <1><73>: Abbrev Number: 2 (DW_TAG_base_type)
    <74>   DW_AT_byte_size   : 8
    <75>   DW_AT_encoding    : 7	(unsigned)
    <76>   DW_AT_name        : (indirect string, offset: 0x2e275): long long unsigned int
 <1><7a>: Abbrev Number: 18 (DW_TAG_base_type)
    <7b>   DW_AT_byte_size   : 4
    <7c>   DW_AT_encoding    : 5	(signed)
    <7d>   DW_AT_name        : int
 <1><81>: Abbrev Number: 2 (DW_TAG_base_type)
    <82>   DW_AT_byte_size   : 4
    <83>   DW_AT_encoding    : 7	(unsigned)
    <84>   DW_AT_name        : (indirect string, offset: 0x494cc): unsigned int
 <1><88>: Abbrev Number: 3 (DW_TAG_typedef)
    <89>   DW_AT_name        : (indirect string, offset: 0x6e27d): uint16_t
    <8d>   DW_AT_decl_file   : 3
    <8e>   DW_AT_decl_line   : 36
    <8f>   DW_AT_decl_column : 20
    <90>   DW_AT_type        : <0x3f>
 <1><94>: Abbrev Number: 3 (DW_TAG_typedef)
    <95>   DW_AT_name        : (indirect string, offset: 0x3b7cd): uint32_t
    <99>   DW_AT_decl_file   : 3
    <9a>   DW_AT_decl_line   : 48
    <9b>   DW_AT_decl_column : 20
    <9c>   DW_AT_type        : <0x59>
 <1><a0>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <a1>   DW_AT_type        : <0x94>
 <1><a5>: Abbrev Number: 9 (DW_TAG_array_type)
    <a6>   DW_AT_type        : <0x94>
    <aa>   DW_AT_sibling     : <0xb5>
 <2><ae>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <af>   DW_AT_type        : <0x81>
    <b3>   DW_AT_upper_bound : 0
 <2><b4>: Abbrev Number: 0
 <1><b5>: Abbrev Number: 9 (DW_TAG_array_type)
    <b6>   DW_AT_type        : <0x94>
    <ba>   DW_AT_sibling     : <0xc5>
 <2><be>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <bf>   DW_AT_type        : <0x81>
    <c3>   DW_AT_upper_bound : 1
 <2><c4>: Abbrev Number: 0
 <1><c5>: Abbrev Number: 12 (DW_TAG_structure_type)
    <c6>   DW_AT_byte_size   : 40
    <c7>   DW_AT_decl_file   : 4
    <c7>   DW_AT_decl_line   : 265
    <c9>   DW_AT_decl_column : 9
    <c9>   DW_AT_sibling     : <0x13a>
 <2><cd>: Abbrev Number: 1 (DW_TAG_member)
    <ce>   DW_AT_name        : (indirect string, offset: 0x672cf): MODER
    <d2>   DW_AT_decl_file   : 4
    <d2>   DW_AT_decl_line   : 267
    <d4>   DW_AT_decl_column : 17
    <d4>   DW_AT_type        : <0xa0>
    <d8>   DW_AT_data_member_location: 0
 <2><d9>: Abbrev Number: 1 (DW_TAG_member)
    <da>   DW_AT_name        : (indirect string, offset: 0x364ea): OTYPER
    <de>   DW_AT_decl_file   : 4
    <de>   DW_AT_decl_line   : 268
    <e0>   DW_AT_decl_column : 17
    <e0>   DW_AT_type        : <0xa0>
    <e4>   DW_AT_data_member_location: 4
 <2><e5>: Abbrev Number: 1 (DW_TAG_member)
    <e6>   DW_AT_name        : (indirect string, offset: 0x2b529): OSPEEDR
    <ea>   DW_AT_decl_file   : 4
    <ea>   DW_AT_decl_line   : 269
    <ec>   DW_AT_decl_column : 17
    <ec>   DW_AT_type        : <0xa0>
    <f0>   DW_AT_data_member_location: 8
 <2><f1>: Abbrev Number: 1 (DW_TAG_member)
    <f2>   DW_AT_name        : (indirect string, offset: 0x8776c): PUPDR
    <f6>   DW_AT_decl_file   : 4
    <f6>   DW_AT_decl_line   : 270
    <f8>   DW_AT_decl_column : 17
    <f8>   DW_AT_type        : <0xa0>
    <fc>   DW_AT_data_member_location: 12
 <2><fd>: Abbrev Number: 4 (DW_TAG_member)
    <fe>   DW_AT_name        : IDR
    <102>   DW_AT_decl_file   : 4
    <102>   DW_AT_decl_line   : 271
    <104>   DW_AT_decl_column : 17
    <104>   DW_AT_type        : <0xa0>
    <108>   DW_AT_data_member_location: 16
 <2><109>: Abbrev Number: 4 (DW_TAG_member)
    <10a>   DW_AT_name        : ODR
    <10e>   DW_AT_decl_file   : 4
    <10e>   DW_AT_decl_line   : 272
    <110>   DW_AT_decl_column : 17
    <110>   DW_AT_type        : <0xa0>
    <114>   DW_AT_data_member_location: 20
 <2><115>: Abbrev Number: 1 (DW_TAG_member)
    <116>   DW_AT_name        : (indirect string, offset: 0x6042b): BSRR
    <11a>   DW_AT_decl_file   : 4
    <11a>   DW_AT_decl_line   : 273
    <11c>   DW_AT_decl_column : 17
    <11c>   DW_AT_type        : <0xa0>
    <120>   DW_AT_data_member_location: 24
 <2><121>: Abbrev Number: 1 (DW_TAG_member)
    <122>   DW_AT_name        : (indirect string, offset: 0x244fa): LCKR
    <126>   DW_AT_decl_file   : 4
    <126>   DW_AT_decl_line   : 274
    <128>   DW_AT_decl_column : 17
    <128>   DW_AT_type        : <0xa0>
    <12c>   DW_AT_data_member_location: 28
 <2><12d>: Abbrev Number: 4 (DW_TAG_member)
    <12e>   DW_AT_name        : AFR
    <132>   DW_AT_decl_file   : 4
    <132>   DW_AT_decl_line   : 275
    <134>   DW_AT_decl_column : 17
    <134>   DW_AT_type        : <0x14a>
    <138>   DW_AT_data_member_location: 32
 <2><139>: Abbrev Number: 0
 <1><13a>: Abbrev Number: 9 (DW_TAG_array_type)
    <13b>   DW_AT_type        : <0xa0>
    <13f>   DW_AT_sibling     : <0x14a>
 <2><143>: Abbrev Number: 10 (DW_TAG_subrange_type)
    <144>   DW_AT_type        : <0x81>
    <148>   DW_AT_upper_bound : 1
 <2><149>: Abbrev Number: 0
 <1><14a>: Abbrev Number: 11 (DW_TAG_volatile_type)
    <14b>   DW_AT_type        : <0x13a>
 <1><14f>: Abbrev Number: 13 (DW_TAG_typedef)
    <150>   DW_AT_name        : (indirect string, offset: 0x70668): GPIO_TypeDef
    <154>   DW_AT_decl_file   : 4
    <154>   DW_AT_decl_line   : 276
    <156>   DW_AT_decl_column : 3
    <156>   DW_AT_type        : <0xc5>
 <1><15a>: Abbrev Number: 12 (DW_TAG_structure_type)
    <15b>   DW_AT_byte_size   : 144
    <15c>   DW_AT_decl_file   : 4
    <15c>   DW_AT_decl_line   : 336
    <15e>   DW_AT_decl_column : 9
    <15e>   DW_AT_sibling     : <0x2e2>
 <2><162>: Abbrev Number: 4 (DW_TAG_member)
    <163>   DW_AT_name        : CR
    <166>   DW_AT_decl_file   : 4
    <166>   DW_AT_decl_line   : 338
    <168>   DW_AT_decl_column : 17
    <168>   DW_AT_type        : <0xa0>
    <16c>   DW_AT_data_member_location: 0
 <2><16d>: Abbrev Number: 1 (DW_TAG_member)
    <16e>   DW_AT_name        : (indirect string, offset: 0x37c0b): PLLCFGR
    <172>   DW_AT_decl_file   : 4
    <172>   DW_AT_decl_line   : 339
    <174>   DW_AT_decl_column : 17
    <174>   DW_AT_type        : <0xa0>
    <178>   DW_AT_data_member_location: 4
 <2><179>: Abbrev Number: 1 (DW_TAG_member)
    <17a>   DW_AT_name        : (indirect string, offset: 0x6a373): CFGR
    <17e>   DW_AT_decl_file   : 4
    <17e>   DW_AT_decl_line   : 340
    <180>   DW_AT_decl_column : 17
    <180>   DW_AT_type        : <0xa0>
    <184>   DW_AT_data_member_location: 8
 <2><185>: Abbrev Number: 4 (DW_TAG_member)
    <186>   DW_AT_name        : CIR
    <18a>   DW_AT_decl_file   : 4
    <18a>   DW_AT_decl_line   : 341
    <18c>   DW_AT_decl_column : 17
    <18c>   DW_AT_type        : <0xa0>
    <190>   DW_AT_data_member_location: 12
 <2><191>: Abbrev Number: 1 (DW_TAG_member)
    <192>   DW_AT_name        : (indirect string, offset: 0x59a6c): AHB1RSTR
    <196>   DW_AT_decl_file   : 4
    <196>   DW_AT_decl_line   : 342
    <198>   DW_AT_decl_column : 17
    <198>   DW_AT_type        : <0xa0>
    <19c>   DW_AT_data_member_location: 16
 <2><19d>: Abbrev Number: 1 (DW_TAG_member)
    <19e>   DW_AT_name        : (indirect string, offset: 0x6f164): AHB2RSTR
    <1a2>   DW_AT_decl_file   : 4
    <1a2>   DW_AT_decl_line   : 343
    <1a4>   DW_AT_decl_column : 17
    <1a4>   DW_AT_type        : <0xa0>
    <1a8>   DW_AT_data_member_location: 20
 <2><1a9>: Abbrev Number: 1 (DW_TAG_member)
    <1aa>   DW_AT_name        : (indirect string, offset: 0x85075): AHB3RSTR
    <1ae>   DW_AT_decl_file   : 4
    <1ae>   DW_AT_decl_line   : 344
    <1b0>   DW_AT_decl_column : 17
    <1b0>   DW_AT_type        : <0xa0>
    <1b4>   DW_AT_data_member_location: 24
 <2><1b5>: Abbrev Number: 1 (DW_TAG_member)
    <1b6>   DW_AT_name        : (indirect string, offset: 0x102b0): RESERVED0
    <1ba>   DW_AT_decl_file   : 4
    <1ba>   DW_AT_decl_line   : 345
    <1bc>   DW_AT_decl_column : 17
    <1bc>   DW_AT_type        : <0x94>
    <1c0>   DW_AT_data_member_location: 28
 <2><1c1>: Abbrev Number: 1 (DW_TAG_member)
    <1c2>   DW_AT_name        : (indirect string, offset: 0x1aaae): APB1RSTR
    <1c6>   DW_AT_decl_file   : 4
    <1c6>   DW_AT_decl_line   : 346
    <1c8>   DW_AT_decl_column : 17
    <1c8>   DW_AT_type        : <0xa0>
    <1cc>   DW_AT_data_member_location: 32
 <2><1cd>: Abbrev Number: 1 (DW_TAG_member)
    <1ce>   DW_AT_name        : (indirect string, offset: 0xb1c0): APB2RSTR
    <1d2>   DW_AT_decl_file   : 4
    <1d2>   DW_AT_decl_line   : 347
    <1d4>   DW_AT_decl_column : 17
    <1d4>   DW_AT_type        : <0xa0>
    <1d8>   DW_AT_data_member_location: 36
 <2><1d9>: Abbrev Number: 1 (DW_TAG_member)
    <1da>   DW_AT_name        : (indirect string, offset: 0x10332): RESERVED1
    <1de>   DW_AT_decl_file   : 4
    <1de>   DW_AT_decl_line   : 348
    <1e0>   DW_AT_decl_column : 17
    <1e0>   DW_AT_type        : <0xb5>
    <1e4>   DW_AT_data_member_location: 40
 <2><1e5>: Abbrev Number: 1 (DW_TAG_member)
    <1e6>   DW_AT_name        : (indirect string, offset: 0x6d1a5): AHB1ENR
    <1ea>   DW_AT_decl_file   : 4
    <1ea>   DW_AT_decl_line   : 349
    <1ec>   DW_AT_decl_column : 17
    <1ec>   DW_AT_type        : <0xa0>
    <1f0>   DW_AT_data_member_location: 48
 <2><1f1>: Abbrev Number: 1 (DW_TAG_member)
    <1f2>   DW_AT_name        : (indirect string, offset: 0x17474): AHB2ENR
    <1f6>   DW_AT_decl_file   : 4
    <1f6>   DW_AT_decl_line   : 350
    <1f8>   DW_AT_decl_column : 17
    <1f8>   DW_AT_type        : <0xa0>
    <1fc>   DW_AT_data_member_location: 52
 <2><1fd>: Abbrev Number: 1 (DW_TAG_member)
    <1fe>   DW_AT_name        : (indirect string, offset: 0x1488): AHB3ENR
    <202>   DW_AT_decl_file   : 4
    <202>   DW_AT_decl_line   : 351
    <204>   DW_AT_decl_column : 17
    <204>   DW_AT_type        : <0xa0>
    <208>   DW_AT_data_member_location: 56
 <2><209>: Abbrev Number: 1 (DW_TAG_member)
    <20a>   DW_AT_name        : (indirect string, offset: 0x1033c): RESERVED2
    <20e>   DW_AT_decl_file   : 4
    <20e>   DW_AT_decl_line   : 352
    <210>   DW_AT_decl_column : 17
    <210>   DW_AT_type        : <0x94>
    <214>   DW_AT_data_member_location: 60
 <2><215>: Abbrev Number: 1 (DW_TAG_member)
    <216>   DW_AT_name        : (indirect string, offset: 0x27945): APB1ENR
    <21a>   DW_AT_decl_file   : 4
    <21a>   DW_AT_decl_line   : 353
    <21c>   DW_AT_decl_column : 17
    <21c>   DW_AT_type        : <0xa0>
    <220>   DW_AT_data_member_location: 64
 <2><221>: Abbrev Number: 1 (DW_TAG_member)
    <222>   DW_AT_name        : (indirect string, offset: 0x56d03): APB2ENR
    <226>   DW_AT_decl_file   : 4
    <226>   DW_AT_decl_line   : 354
    <228>   DW_AT_decl_column : 17
    <228>   DW_AT_type        : <0xa0>
    <22c>   DW_AT_data_member_location: 68
 <2><22d>: Abbrev Number: 1 (DW_TAG_member)
    <22e>   DW_AT_name        : (indirect string, offset: 0x55c12): RESERVED3
    <232>   DW_AT_decl_file   : 4
    <232>   DW_AT_decl_line   : 355
    <234>   DW_AT_decl_column : 17
    <234>   DW_AT_type        : <0xb5>
    <238>   DW_AT_data_member_location: 72
 <2><239>: Abbrev Number: 1 (DW_TAG_member)
    <23a>   DW_AT_name        : (indirect string, offset: 0x27525): AHB1LPENR
    <23e>   DW_AT_decl_file   : 4
    <23e>   DW_AT_decl_line   : 356
    <240>   DW_AT_decl_column : 17
    <240>   DW_AT_type        : <0xa0>
    <244>   DW_AT_data_member_location: 80
 <2><245>: Abbrev Number: 1 (DW_TAG_member)
    <246>   DW_AT_name        : (indirect string, offset: 0x5d53e): AHB2LPENR
    <24a>   DW_AT_decl_file   : 4
    <24a>   DW_AT_decl_line   : 357
    <24c>   DW_AT_decl_column : 17
    <24c>   DW_AT_type        : <0xa0>
    <250>   DW_AT_data_member_location: 84
 <2><251>: Abbrev Number: 1 (DW_TAG_member)
    <252>   DW_AT_name        : (indirect string, offset: 0x6b1f7): AHB3LPENR
    <256>   DW_AT_decl_file   : 4
    <256>   DW_AT_decl_line   : 358
    <258>   DW_AT_decl_column : 17
    <258>   DW_AT_type        : <0xa0>
    <25c>   DW_AT_data_member_location: 88
 <2><25d>: Abbrev Number: 1 (DW_TAG_member)
    <25e>   DW_AT_name        : (indirect string, offset: 0x55c1c): RESERVED4
    <262>   DW_AT_decl_file   : 4
    <262>   DW_AT_decl_line   : 359
    <264>   DW_AT_decl_column : 17
    <264>   DW_AT_type        : <0x94>
    <268>   DW_AT_data_member_location: 92
 <2><269>: Abbrev Number: 1 (DW_TAG_member)
    <26a>   DW_AT_name        : (indirect string, offset: 0x6c78d): APB1LPENR
    <26e>   DW_AT_decl_file   : 4
    <26e>   DW_AT_decl_line   : 360
    <270>   DW_AT_decl_column : 17
    <270>   DW_AT_type        : <0xa0>
    <274>   DW_AT_data_member_location: 96
 <2><275>: Abbrev Number: 1 (DW_TAG_member)
    <276>   DW_AT_name        : (indirect string, offset: 0x862db): APB2LPENR
    <27a>   DW_AT_decl_file   : 4
    <27a>   DW_AT_decl_line   : 361
    <27c>   DW_AT_decl_column : 17
    <27c>   DW_AT_type        : <0xa0>
    <280>   DW_AT_data_member_location: 100
 <2><281>: Abbrev Number: 1 (DW_TAG_member)
    <282>   DW_AT_name        : (indirect string, offset: 0x55c26): RESERVED5
    <286>   DW_AT_decl_file   : 4
    <286>   DW_AT_decl_line   : 362
    <288>   DW_AT_decl_column : 17
    <288>   DW_AT_type        : <0xb5>
    <28c>   DW_AT_data_member_location: 104
 <2><28d>: Abbrev Number: 1 (DW_TAG_member)
    <28e>   DW_AT_name        : (indirect string, offset: 0x8806b): BDCR
    <292>   DW_AT_decl_file   : 4
    <292>   DW_AT_decl_line   : 363
    <294>   DW_AT_decl_column : 17
    <294>   DW_AT_type        : <0xa0>
    <298>   DW_AT_data_member_location: 112
 <2><299>: Abbrev Number: 4 (DW_TAG_member)
    <29a>   DW_AT_name        : CSR
    <29e>   DW_AT_decl_file   : 4
    <29e>   DW_AT_decl_line   : 364
    <2a0>   DW_AT_decl_column : 17
    <2a0>   DW_AT_type        : <0xa0>
    <2a4>   DW_AT_data_member_location: 116
 <2><2a5>: Abbrev Number: 1 (DW_TAG_member)
    <2a6>   DW_AT_name        : (indirect string, offset: 0x4f701): RESERVED6
    <2aa>   DW_AT_decl_file   : 4
    <2aa>   DW_AT_decl_line   : 365
    <2ac>   DW_AT_decl_column : 17
    <2ac>   DW_AT_type        : <0xb5>
    <2b0>   DW_AT_data_member_location: 120
 <2><2b1>: Abbrev Number: 1 (DW_TAG_member)
    <2b2>   DW_AT_name        : (indirect string, offset: 0x738bb): SSCGR
    <2b6>   DW_AT_decl_file   : 4
    <2b6>   DW_AT_decl_line   : 366
    <2b8>   DW_AT_decl_column : 17
    <2b8>   DW_AT_type        : <0xa0>
    <2bc>   DW_AT_data_member_location: 128
 <2><2bd>: Abbrev Number: 1 (DW_TAG_member)
    <2be>   DW_AT_name        : (indirect string, offset: 0xdbaa): PLLI2SCFGR
    <2c2>   DW_AT_decl_file   : 4
    <2c2>   DW_AT_decl_line   : 367
    <2c4>   DW_AT_decl_column : 17
    <2c4>   DW_AT_type        : <0xa0>
    <2c8>   DW_AT_data_member_location: 132
 <2><2c9>: Abbrev Number: 1 (DW_TAG_member)
    <2ca>   DW_AT_name        : (indirect string, offset: 0x55c63): RESERVED7
    <2ce>   DW_AT_decl_file   : 4
    <2ce>   DW_AT_decl_line   : 368
    <2d0>   DW_AT_decl_column : 17
    <2d0>   DW_AT_type        : <0xa5>
    <2d4>   DW_AT_data_member_location: 136
 <2><2d5>: Abbrev Number: 1 (DW_TAG_member)
    <2d6>   DW_AT_name        : (indirect string, offset: 0x6a370): DCKCFGR
    <2da>   DW_AT_decl_file   : 4
    <2da>   DW_AT_decl_line   : 369
    <2dc>   DW_AT_decl_column : 17
    <2dc>   DW_AT_type        : <0xa0>
    <2e0>   DW_AT_data_member_location: 140
 <2><2e1>: Abbrev Number: 0
 <1><2e2>: Abbrev Number: 13 (DW_TAG_typedef)
    <2e3>   DW_AT_name        : (indirect string, offset: 0x1c2c1): RCC_TypeDef
    <2e7>   DW_AT_decl_file   : 4
    <2e7>   DW_AT_decl_line   : 370
    <2e9>   DW_AT_decl_column : 3
    <2e9>   DW_AT_type        : <0x15a>
 <1><2ed>: Abbrev Number: 2 (DW_TAG_base_type)
    <2ee>   DW_AT_byte_size   : 8
    <2ef>   DW_AT_encoding    : 4	(float)
    <2f0>   DW_AT_name        : (indirect string, offset: 0x8c5d2): long double
 <1><2f4>: Abbrev Number: 19 (DW_TAG_structure_type)
    <2f5>   DW_AT_byte_size   : 20
    <2f6>   DW_AT_decl_file   : 5
    <2f7>   DW_AT_decl_line   : 46
    <2f8>   DW_AT_decl_column : 9
    <2f9>   DW_AT_sibling     : <0x337>
 <2><2fd>: Abbrev Number: 20 (DW_TAG_member)
    <2fe>   DW_AT_name        : Pin
    <302>   DW_AT_decl_file   : 5
    <303>   DW_AT_decl_line   : 48
    <304>   DW_AT_decl_column : 12
    <305>   DW_AT_type        : <0x94>
    <309>   DW_AT_data_member_location: 0
 <2><30a>: Abbrev Number: 7 (DW_TAG_member)
    <30b>   DW_AT_name        : (indirect string, offset: 0x8fb2d): Mode
    <30f>   DW_AT_decl_file   : 5
    <30f>   DW_AT_decl_line   : 51
    <310>   DW_AT_decl_column : 12
    <310>   DW_AT_type        : <0x94>
    <314>   DW_AT_data_member_location: 4
 <2><315>: Abbrev Number: 7 (DW_TAG_member)
    <316>   DW_AT_name        : (indirect string, offset: 0x3c71b): Pull
    <31a>   DW_AT_decl_file   : 5
    <31a>   DW_AT_decl_line   : 54
    <31b>   DW_AT_decl_column : 12
    <31b>   DW_AT_type        : <0x94>
    <31f>   DW_AT_data_member_location: 8
 <2><320>: Abbrev Number: 7 (DW_TAG_member)
    <321>   DW_AT_name        : (indirect string, offset: 0x64adb): Speed
    <325>   DW_AT_decl_file   : 5
    <325>   DW_AT_decl_line   : 57
    <326>   DW_AT_decl_column : 12
    <326>   DW_AT_type        : <0x94>
    <32a>   DW_AT_data_member_location: 12
 <2><32b>: Abbrev Number: 7 (DW_TAG_member)
    <32c>   DW_AT_name        : (indirect string, offset: 0x23d68): Alternate
    <330>   DW_AT_decl_file   : 5
    <330>   DW_AT_decl_line   : 60
    <331>   DW_AT_decl_column : 12
    <331>   DW_AT_type        : <0x94>
    <335>   DW_AT_data_member_location: 16
 <2><336>: Abbrev Number: 0
 <1><337>: Abbrev Number: 3 (DW_TAG_typedef)
    <338>   DW_AT_name        : (indirect string, offset: 0x81f70): GPIO_InitTypeDef
    <33c>   DW_AT_decl_file   : 5
    <33d>   DW_AT_decl_line   : 62
    <33e>   DW_AT_decl_column : 2
    <33f>   DW_AT_type        : <0x2f4>
 <1><343>: Abbrev Number: 21 (DW_TAG_enumeration_type)
    <344>   DW_AT_encoding    : 7	(unsigned)
    <345>   DW_AT_byte_size   : 1
    <346>   DW_AT_type        : <0x31>
    <34a>   DW_AT_decl_file   : 5
    <34b>   DW_AT_decl_line   : 68
    <34c>   DW_AT_decl_column : 1
    <34d>   DW_AT_sibling     : <0x35e>
 <2><351>: Abbrev Number: 14 (DW_TAG_enumerator)
    <352>   DW_AT_name        : (indirect string, offset: 0x666bb): GPIO_PIN_RESET
    <356>   DW_AT_const_value : 0
 <2><357>: Abbrev Number: 14 (DW_TAG_enumerator)
    <358>   DW_AT_name        : (indirect string, offset: 0x26ccb): GPIO_PIN_SET
    <35c>   DW_AT_const_value : 1
 <2><35d>: Abbrev Number: 0
 <1><35e>: Abbrev Number: 3 (DW_TAG_typedef)
    <35f>   DW_AT_name        : (indirect string, offset: 0x4a03d): GPIO_PinState
    <363>   DW_AT_decl_file   : 5
    <364>   DW_AT_decl_line   : 71
    <365>   DW_AT_decl_column : 2
    <366>   DW_AT_type        : <0x343>
 <1><36a>: Abbrev Number: 15 (DW_TAG_subprogram)
    <36b>   DW_AT_external    : 1
    <36b>   DW_AT_name        : (indirect string, offset: 0x925f): HAL_GPIO_Init
    <36f>   DW_AT_decl_file   : 5
    <36f>   DW_AT_decl_line   : 224
    <370>   DW_AT_decl_column : 7
    <371>   DW_AT_prototyped  : 1
    <371>   DW_AT_declaration : 1
    <371>   DW_AT_sibling     : <0x380>
 <2><375>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <376>   DW_AT_type        : <0x380>
 <2><37a>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <37b>   DW_AT_type        : <0x385>
 <2><37f>: Abbrev Number: 0
 <1><380>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <381>   DW_AT_byte_size   : 4
    <381>   DW_AT_type        : <0x14f>
 <1><385>: Abbrev Number: 16 (DW_TAG_pointer_type)
    <386>   DW_AT_byte_size   : 4
    <386>   DW_AT_type        : <0x337>
 <1><38a>: Abbrev Number: 15 (DW_TAG_subprogram)
    <38b>   DW_AT_external    : 1
    <38b>   DW_AT_name        : (indirect string, offset: 0x73c5): HAL_GPIO_WritePin
    <38f>   DW_AT_decl_file   : 5
    <38f>   DW_AT_decl_line   : 235
    <390>   DW_AT_decl_column : 6
    <391>   DW_AT_prototyped  : 1
    <391>   DW_AT_declaration : 1
    <391>   DW_AT_sibling     : <0x3a5>
 <2><395>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <396>   DW_AT_type        : <0x380>
 <2><39a>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <39b>   DW_AT_type        : <0x88>
 <2><39f>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <3a0>   DW_AT_type        : <0x35e>
 <2><3a4>: Abbrev Number: 0
 <1><3a5>: Abbrev Number: 22 (DW_TAG_subprogram)
    <3a6>   DW_AT_external    : 1
    <3a6>   DW_AT_name        : (indirect string, offset: 0x78fa2): MX_GPIO_Init
    <3aa>   DW_AT_decl_file   : 1
    <3ab>   DW_AT_decl_line   : 44
    <3ac>   DW_AT_decl_column : 6
    <3ad>   DW_AT_prototyped  : 1
    <3ad>   DW_AT_low_pc      : 0x80004c8
    <3b1>   DW_AT_high_pc     : 0x164
    <3b5>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <3b7>   DW_AT_call_all_tail_calls: 1
 <2><3b7>: Abbrev Number: 5 (DW_TAG_variable)
    <3b8>   DW_AT_name        : (indirect string, offset: 0x28283): GPIO_InitStruct
    <3bc>   DW_AT_decl_file   : 1
    <3bc>   DW_AT_decl_line   : 47
    <3bd>   DW_AT_decl_column : 20
    <3be>   DW_AT_type        : <0x337>
    <3c2>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><3c5>: Abbrev Number: 8 (DW_TAG_lexical_block)
    <3c6>   DW_AT_low_pc      : 0x80004de
    <3ca>   DW_AT_high_pc     : 0x1c
    <3ce>   DW_AT_sibling     : <0x3e1>
 <3><3d2>: Abbrev Number: 5 (DW_TAG_variable)
    <3d3>   DW_AT_name        : (indirect string, offset: 0x6eeaa): tmpreg
    <3d7>   DW_AT_decl_file   : 1
    <3d7>   DW_AT_decl_line   : 50
    <3d8>   DW_AT_decl_column : 3
    <3d9>   DW_AT_type        : <0xa0>
    <3dd>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <3><3e0>: Abbrev Number: 0
 <2><3e1>: Abbrev Number: 8 (DW_TAG_lexical_block)
    <3e2>   DW_AT_low_pc      : 0x80004fa
    <3e6>   DW_AT_high_pc     : 0x1c
    <3ea>   DW_AT_sibling     : <0x3fd>
 <3><3ee>: Abbrev Number: 5 (DW_TAG_variable)
    <3ef>   DW_AT_name        : (indirect string, offset: 0x6eeaa): tmpreg
    <3f3>   DW_AT_decl_file   : 1
    <3f3>   DW_AT_decl_line   : 51
    <3f4>   DW_AT_decl_column : 3
    <3f5>   DW_AT_type        : <0xa0>
    <3f9>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <3><3fc>: Abbrev Number: 0
 <2><3fd>: Abbrev Number: 8 (DW_TAG_lexical_block)
    <3fe>   DW_AT_low_pc      : 0x8000516
    <402>   DW_AT_high_pc     : 0x1c
    <406>   DW_AT_sibling     : <0x419>
 <3><40a>: Abbrev Number: 5 (DW_TAG_variable)
    <40b>   DW_AT_name        : (indirect string, offset: 0x6eeaa): tmpreg
    <40f>   DW_AT_decl_file   : 1
    <40f>   DW_AT_decl_line   : 52
    <410>   DW_AT_decl_column : 3
    <411>   DW_AT_type        : <0xa0>
    <415>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <3><418>: Abbrev Number: 0
 <2><419>: Abbrev Number: 8 (DW_TAG_lexical_block)
    <41a>   DW_AT_low_pc      : 0x8000532
    <41e>   DW_AT_high_pc     : 0x1c
    <422>   DW_AT_sibling     : <0x435>
 <3><426>: Abbrev Number: 5 (DW_TAG_variable)
    <427>   DW_AT_name        : (indirect string, offset: 0x6eeaa): tmpreg
    <42b>   DW_AT_decl_file   : 1
    <42b>   DW_AT_decl_line   : 53
    <42c>   DW_AT_decl_column : 3
    <42d>   DW_AT_type        : <0xa0>
    <431>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <3><434>: Abbrev Number: 0
 <2><435>: Abbrev Number: 23 (DW_TAG_lexical_block)
    <436>   DW_AT_low_pc      : 0x800054e
    <43a>   DW_AT_high_pc     : 0x1c
 <3><43e>: Abbrev Number: 5 (DW_TAG_variable)
    <43f>   DW_AT_name        : (indirect string, offset: 0x6eeaa): tmpreg
    <443>   DW_AT_decl_file   : 1
    <443>   DW_AT_decl_line   : 54
    <444>   DW_AT_decl_column : 3
    <445>   DW_AT_type        : <0xa0>
    <449>   DW_AT_location    : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <3><44c>: Abbrev Number: 0
 <2><44d>: Abbrev Number: 0
 <1><44e>: Abbrev Number: 0
  Compilation Unit @ offset 0x44f:
   Length:        0x23fe (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x151
   Pointer Size:  4
 <0><45b>: Abbrev Number: 40 (DW_TAG_compile_unit)
    <45c>   DW_AT_producer    : (indirect string, offset: 0x87bec): GNU C11 12.3.1 20230626 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <460>   DW_AT_language    : 29	(C11)
    <461>   DW_AT_name        : (indirect string, offset: 0x8cb32): ../Core/Src/main.c
    <465>   DW_AT_comp_dir    : (indirect string, offset: 0x4a0d8): C:/Users/Daniel/Desktop/FG9322/EDAS - Electronic Data Acquisition System/EDAS_FBL/Debug
    <469>   DW_AT_ranges      : 0x20
    <46d>   DW_AT_low_pc      : 0
    <471>   DW_AT_stmt_list   : 0x890
    <475>   DW_AT_macros      : 0x14549
 <1><479>: Abbrev Number: 18 (DW_TAG_base_type)
    <47a>   DW_AT_byte_size   : 1
    <47b>   DW_AT_encoding    : 6	(signed char)
    <47c>   DW_AT_name        : (indirect string, offset: 0x661a5): signed char
 <1><480>: Abbrev Number: 6 (DW_TAG_typedef)
    <481>   DW_AT_name        : (indirect string, offset: 0x89984): __uint8_t
    <485>   DW_AT_decl_file   : 4
    <486>   DW_AT_decl_line   : 43
    <487>   DW_AT_decl_column : 24
    <488>   DW_AT_type        : <0x48c>
 <1><48c>: Abbrev Number: 18 (DW_TAG_base_type)
    <48d>   DW_AT_byte_size   : 1
    <48e>   DW_AT_encoding    : 8	(unsigned char)
    <48f>   DW_AT_name        : (indirect string, offset: 0x61e6f): unsigned char
 <1><493>: Abbrev Number: 18 (DW_TAG_base_type)
    <494>   DW_AT_byte_size   : 2
    <495>   DW_AT_encoding    : 5	(signed)
    <496>   DW_AT_name        : (indirect string, offset: 0x5215): short int
 <1><49a>: Abbrev Number: 6 (DW_TAG_typedef)
    <49b>   DW_AT_name        : (indirect string, offset: 0x6e27b): __uint16_t
    <49f>   DW_AT_decl_file   : 4
    <4a0>   DW_AT_decl_line   : 57
    <4a1>   DW_AT_decl_column : 25
    <4a2>   DW_AT_type        : <0x4a6>
 <1><4a6>: Abbrev Number: 18 (DW_TAG_base_type)
    <4a7>   DW_AT_byte_size   : 2
    <4a8>   DW_AT_encoding    : 7	(unsigned)
    <4a9>   DW_AT_name        : (indirect string, offset: 0x4403b): short unsigned int
 <1><4ad>: Abbrev Number: 18 (DW_TAG_base_type)
    <4ae>   DW_AT_byte_size   : 4
    <4af>   DW_AT_encoding    : 5	(signed)
    <4b0>   DW_AT_name        : (indirect string, offset: 0x1b474): long int
 <1><4b4>: Abbrev Number: 6 (DW_TAG_typedef)
    <4b5>   DW_AT_name        : (indirect string, offset: 0x3b7cb): __uint32_t
    <4b9>   DW_AT_decl_file   : 4
    <4ba>   DW_AT_decl_line   : 79
    <4bb>   DW_AT_decl_column : 25
    <4bc>   DW_AT_type        : <0x4c0>
 <1><4c0>: Abbrev Number: 18 (DW_TAG_base_type)
    <4c1>   DW_AT_byte_size   : 4
    <4c2>   DW_AT_encoding    : 7	(unsigned)
    <4c3>   DW_AT_name        : (indirect string, offset: 0x4fd87): long unsigned int
 <1><4c7>: Abbrev Number: 18 (DW_TAG_base_type)
    <4c8>   DW_AT_byte_size   : 8
    <4c9>   DW_AT_encoding    : 5	(signed)
    <4ca>   DW_AT_name        : (indirect string, offset: 0x35fa4): long long int
 <1><4ce>: Abbrev Number: 6 (DW_TAG_typedef)
    <4cf>   DW_AT_name        : (indirect string, offset: 0x8a77b): __uint64_t
    <4d3>   DW_AT_decl_file   : 4
    <4d4>   DW_AT_decl_line   : 105
    <4d5>   DW_AT_decl_column : 25
    <4d6>   DW_AT_type        : <0x4da>
 <1><4da>: Abbrev Number: 18 (DW_TAG_base_type)
    <4db>   DW_AT_byte_size   : 8
    <4dc>   DW_AT_encoding    : 7	(unsigned)
    <4dd>   DW_AT_name        : (indirect string, offset: 0x2e275): long long unsigned int
 <1><4e1>: Abbrev Number: 41 (DW_TAG_base_type)
    <4e2>   DW_AT_byte_size   : 4
    <4e3>   DW_AT_encoding    : 5	(signed)
    <4e4>   DW_AT_name        : int
 <1><4e8>: Abbrev Number: 18 (DW_TAG_base_type)
    <4e9>   DW_AT_byte_size   : 4
    <4ea>   DW_AT_encoding    : 7	(unsigned)
    <4eb>   DW_AT_name        : (indirect string, offset: 0x494cc): unsigned int
 <1><4ef>: Abbrev Number: 6 (DW_TAG_typedef)
    <4f0>   DW_AT_name        : (indirect string, offset: 0x89986): uint8_t
    <4f4>   DW_AT_decl_file   : 5
    <4f5>   DW_AT_decl_line   : 24
    <4f6>   DW_AT_decl_column : 19
    <4f7>   DW_AT_type        : <0x480>
 <1><4fb>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <4fc>   DW_AT_type        : <0x4ef>
 <1><500>: Abbrev Number: 6 (DW_TAG_typedef)
    <501>   DW_AT_name        : (indirect string, offset: 0x6e27d): uint16_t
    <505>   DW_AT_decl_file   : 5
    <506>   DW_AT_decl_line   : 36
    <507>   DW_AT_decl_column : 20
    <508>   DW_AT_type        : <0x49a>
 <1><50c>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <50d>   DW_AT_type        : <0x500>
 <1><511>: Abbrev Number: 6 (DW_TAG_typedef)
    <512>   DW_AT_name        : (indirect string, offset: 0x3b7cd): uint32_t
    <516>   DW_AT_decl_file   : 5
    <517>   DW_AT_decl_line   : 48
    <518>   DW_AT_decl_column : 20
    <519>   DW_AT_type        : <0x4b4>
 <1><51d>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <51e>   DW_AT_type        : <0x511>
 <1><522>: Abbrev Number: 28 (DW_TAG_const_type)
    <523>   DW_AT_type        : <0x51d>
 <1><527>: Abbrev Number: 6 (DW_TAG_typedef)
    <528>   DW_AT_name        : (indirect string, offset: 0x8a77d): uint64_t
    <52c>   DW_AT_decl_file   : 5
    <52d>   DW_AT_decl_line   : 60
    <52e>   DW_AT_decl_column : 20
    <52f>   DW_AT_type        : <0x4ce>
 <1><533>: Abbrev Number: 21 (DW_TAG_structure_type)
    <534>   DW_AT_byte_size   : 140
    <535>   DW_AT_decl_file   : 2
    <536>   DW_AT_decl_line   : 445
    <538>   DW_AT_decl_column : 9
    <538>   DW_AT_sibling     : <0x663>
 <2><53c>: Abbrev Number: 2 (DW_TAG_member)
    <53d>   DW_AT_name        : (indirect string, offset: 0x89bba): CPUID
    <541>   DW_AT_decl_file   : 2
    <542>   DW_AT_decl_line   : 447
    <544>   DW_AT_decl_column : 18
    <545>   DW_AT_type        : <0x522>
    <549>   DW_AT_data_member_location: 0
 <2><54a>: Abbrev Number: 2 (DW_TAG_member)
    <54b>   DW_AT_name        : (indirect string, offset: 0x89b5d): ICSR
    <54f>   DW_AT_decl_file   : 2
    <550>   DW_AT_decl_line   : 448
    <552>   DW_AT_decl_column : 18
    <553>   DW_AT_type        : <0x51d>
    <557>   DW_AT_data_member_location: 4
 <2><558>: Abbrev Number: 2 (DW_TAG_member)
    <559>   DW_AT_name        : (indirect string, offset: 0x88690): VTOR
    <55d>   DW_AT_decl_file   : 2
    <55e>   DW_AT_decl_line   : 449
    <560>   DW_AT_decl_column : 18
    <561>   DW_AT_type        : <0x51d>
    <565>   DW_AT_data_member_location: 8
 <2><566>: Abbrev Number: 2 (DW_TAG_member)
    <567>   DW_AT_name        : (indirect string, offset: 0x8d420): AIRCR
    <56b>   DW_AT_decl_file   : 2
    <56c>   DW_AT_decl_line   : 450
    <56e>   DW_AT_decl_column : 18
    <56f>   DW_AT_type        : <0x51d>
    <573>   DW_AT_data_member_location: 12
 <2><574>: Abbrev Number: 7 (DW_TAG_member)
    <575>   DW_AT_name        : SCR
    <579>   DW_AT_decl_file   : 2
    <57a>   DW_AT_decl_line   : 451
    <57c>   DW_AT_decl_column : 18
    <57d>   DW_AT_type        : <0x51d>
    <581>   DW_AT_data_member_location: 16
 <2><582>: Abbrev Number: 7 (DW_TAG_member)
    <583>   DW_AT_name        : CCR
    <587>   DW_AT_decl_file   : 2
    <588>   DW_AT_decl_line   : 452
    <58a>   DW_AT_decl_column : 18
    <58b>   DW_AT_type        : <0x51d>
    <58f>   DW_AT_data_member_location: 20
 <2><590>: Abbrev Number: 7 (DW_TAG_member)
    <591>   DW_AT_name        : SHP
    <595>   DW_AT_decl_file   : 2
    <596>   DW_AT_decl_line   : 453
    <598>   DW_AT_decl_column : 18
    <599>   DW_AT_type        : <0x673>
    <59d>   DW_AT_data_member_location: 24
 <2><59e>: Abbrev Number: 2 (DW_TAG_member)
    <59f>   DW_AT_name        : (indirect string, offset: 0x8ac87): SHCSR
    <5a3>   DW_AT_decl_file   : 2
    <5a4>   DW_AT_decl_line   : 454
    <5a6>   DW_AT_decl_column : 18
    <5a7>   DW_AT_type        : <0x51d>
    <5ab>   DW_AT_data_member_location: 36
 <2><5ac>: Abbrev Number: 2 (DW_TAG_member)
    <5ad>   DW_AT_name        : (indirect string, offset: 0x8966f): CFSR
    <5b1>   DW_AT_decl_file   : 2
    <5b2>   DW_AT_decl_line   : 455
    <5b4>   DW_AT_decl_column : 18
    <5b5>   DW_AT_type        : <0x51d>
    <5b9>   DW_AT_data_member_location: 40
 <2><5ba>: Abbrev Number: 2 (DW_TAG_member)
    <5bb>   DW_AT_name        : (indirect string, offset: 0x8adee): HFSR
    <5bf>   DW_AT_decl_file   : 2
    <5c0>   DW_AT_decl_line   : 456
    <5c2>   DW_AT_decl_column : 18
    <5c3>   DW_AT_type        : <0x51d>
    <5c7>   DW_AT_data_member_location: 44
 <2><5c8>: Abbrev Number: 2 (DW_TAG_member)
    <5c9>   DW_AT_name        : (indirect string, offset: 0x8a19f): DFSR
    <5cd>   DW_AT_decl_file   : 2
    <5ce>   DW_AT_decl_line   : 457
    <5d0>   DW_AT_decl_column : 18
    <5d1>   DW_AT_type        : <0x51d>
    <5d5>   DW_AT_data_member_location: 48
 <2><5d6>: Abbrev Number: 2 (DW_TAG_member)
    <5d7>   DW_AT_name        : (indirect string, offset: 0x8cfb1): MMFAR
    <5db>   DW_AT_decl_file   : 2
    <5dc>   DW_AT_decl_line   : 458
    <5de>   DW_AT_decl_column : 18
    <5df>   DW_AT_type        : <0x51d>
    <5e3>   DW_AT_data_member_location: 52
 <2><5e4>: Abbrev Number: 2 (DW_TAG_member)
    <5e5>   DW_AT_name        : (indirect string, offset: 0x8a1aa): BFAR
    <5e9>   DW_AT_decl_file   : 2
    <5ea>   DW_AT_decl_line   : 459
    <5ec>   DW_AT_decl_column : 18
    <5ed>   DW_AT_type        : <0x51d>
    <5f1>   DW_AT_data_member_location: 56
 <2><5f2>: Abbrev Number: 2 (DW_TAG_member)
    <5f3>   DW_AT_name        : (indirect string, offset: 0x897ae): AFSR
    <5f7>   DW_AT_decl_file   : 2
    <5f8>   DW_AT_decl_line   : 460
    <5fa>   DW_AT_decl_column : 18
    <5fb>   DW_AT_type        : <0x51d>
    <5ff>   DW_AT_data_member_location: 60
 <2><600>: Abbrev Number: 7 (DW_TAG_member)
    <601>   DW_AT_name        : PFR
    <605>   DW_AT_decl_file   : 2
    <606>   DW_AT_decl_line   : 461
    <608>   DW_AT_decl_column : 18
    <609>   DW_AT_type        : <0x68d>
    <60d>   DW_AT_data_member_location: 64
 <2><60e>: Abbrev Number: 7 (DW_TAG_member)
    <60f>   DW_AT_name        : DFR
    <613>   DW_AT_decl_file   : 2
    <614>   DW_AT_decl_line   : 462
    <616>   DW_AT_decl_column : 18
    <617>   DW_AT_type        : <0x522>
    <61b>   DW_AT_data_member_location: 72
 <2><61c>: Abbrev Number: 7 (DW_TAG_member)
    <61d>   DW_AT_name        : ADR
    <621>   DW_AT_decl_file   : 2
    <622>   DW_AT_decl_line   : 463
    <624>   DW_AT_decl_column : 18
    <625>   DW_AT_type        : <0x522>
    <629>   DW_AT_data_member_location: 76
 <2><62a>: Abbrev Number: 2 (DW_TAG_member)
    <62b>   DW_AT_name        : (indirect string, offset: 0x8a126): MMFR
    <62f>   DW_AT_decl_file   : 2
    <630>   DW_AT_decl_line   : 464
    <632>   DW_AT_decl_column : 18
    <633>   DW_AT_type        : <0x6a7>
    <637>   DW_AT_data_member_location: 80
 <2><638>: Abbrev Number: 2 (DW_TAG_member)
    <639>   DW_AT_name        : (indirect string, offset: 0x8a82f): ISAR
    <63d>   DW_AT_decl_file   : 2
    <63e>   DW_AT_decl_line   : 465
    <640>   DW_AT_decl_column : 18
    <641>   DW_AT_type        : <0x6c1>
    <645>   DW_AT_data_member_location: 96
 <2><646>: Abbrev Number: 2 (DW_TAG_member)
    <647>   DW_AT_name        : (indirect string, offset: 0x102b0): RESERVED0
    <64b>   DW_AT_decl_file   : 2
    <64c>   DW_AT_decl_line   : 466
    <64e>   DW_AT_decl_column : 18
    <64f>   DW_AT_type        : <0x6c6>
    <653>   DW_AT_data_member_location: 116
 <2><654>: Abbrev Number: 2 (DW_TAG_member)
    <655>   DW_AT_name        : (indirect string, offset: 0x8a1a4): CPACR
    <659>   DW_AT_decl_file   : 2
    <65a>   DW_AT_decl_line   : 467
    <65c>   DW_AT_decl_column : 18
    <65d>   DW_AT_type        : <0x51d>
    <661>   DW_AT_data_member_location: 136
 <2><662>: Abbrev Number: 0
 <1><663>: Abbrev Number: 16 (DW_TAG_array_type)
    <664>   DW_AT_type        : <0x4fb>
    <668>   DW_AT_sibling     : <0x673>
 <2><66c>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <66d>   DW_AT_type        : <0x4e8>
    <671>   DW_AT_upper_bound : 11
 <2><672>: Abbrev Number: 0
 <1><673>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <674>   DW_AT_type        : <0x663>
 <1><678>: Abbrev Number: 16 (DW_TAG_array_type)
    <679>   DW_AT_type        : <0x522>
    <67d>   DW_AT_sibling     : <0x688>
 <2><681>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <682>   DW_AT_type        : <0x4e8>
    <686>   DW_AT_upper_bound : 1
 <2><687>: Abbrev Number: 0
 <1><688>: Abbrev Number: 28 (DW_TAG_const_type)
    <689>   DW_AT_type        : <0x678>
 <1><68d>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <68e>   DW_AT_type        : <0x688>
 <1><692>: Abbrev Number: 16 (DW_TAG_array_type)
    <693>   DW_AT_type        : <0x522>
    <697>   DW_AT_sibling     : <0x6a2>
 <2><69b>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <69c>   DW_AT_type        : <0x4e8>
    <6a0>   DW_AT_upper_bound : 3
 <2><6a1>: Abbrev Number: 0
 <1><6a2>: Abbrev Number: 28 (DW_TAG_const_type)
    <6a3>   DW_AT_type        : <0x692>
 <1><6a7>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <6a8>   DW_AT_type        : <0x6a2>
 <1><6ac>: Abbrev Number: 16 (DW_TAG_array_type)
    <6ad>   DW_AT_type        : <0x522>
    <6b1>   DW_AT_sibling     : <0x6bc>
 <2><6b5>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <6b6>   DW_AT_type        : <0x4e8>
    <6ba>   DW_AT_upper_bound : 4
 <2><6bb>: Abbrev Number: 0
 <1><6bc>: Abbrev Number: 28 (DW_TAG_const_type)
    <6bd>   DW_AT_type        : <0x6ac>
 <1><6c1>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <6c2>   DW_AT_type        : <0x6bc>
 <1><6c6>: Abbrev Number: 16 (DW_TAG_array_type)
    <6c7>   DW_AT_type        : <0x511>
    <6cb>   DW_AT_sibling     : <0x6d6>
 <2><6cf>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <6d0>   DW_AT_type        : <0x4e8>
    <6d4>   DW_AT_upper_bound : 4
 <2><6d5>: Abbrev Number: 0
 <1><6d6>: Abbrev Number: 19 (DW_TAG_typedef)
    <6d7>   DW_AT_name        : (indirect string, offset: 0x8bf8c): SCB_Type
    <6db>   DW_AT_decl_file   : 2
    <6dc>   DW_AT_decl_line   : 468
    <6de>   DW_AT_decl_column : 3
    <6df>   DW_AT_type        : <0x533>
 <1><6e3>: Abbrev Number: 16 (DW_TAG_array_type)
    <6e4>   DW_AT_type        : <0x511>
    <6e8>   DW_AT_sibling     : <0x6f3>
 <2><6ec>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <6ed>   DW_AT_type        : <0x4e8>
    <6f1>   DW_AT_upper_bound : 0
 <2><6f2>: Abbrev Number: 0
 <1><6f3>: Abbrev Number: 16 (DW_TAG_array_type)
    <6f4>   DW_AT_type        : <0x511>
    <6f8>   DW_AT_sibling     : <0x703>
 <2><6fc>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <6fd>   DW_AT_type        : <0x4e8>
    <701>   DW_AT_upper_bound : 1
 <2><702>: Abbrev Number: 0
 <1><703>: Abbrev Number: 8 (DW_TAG_structure_type)
    <704>   DW_AT_byte_size   : 24
    <705>   DW_AT_decl_file   : 6
    <706>   DW_AT_decl_line   : 214
    <707>   DW_AT_decl_column : 9
    <708>   DW_AT_sibling     : <0x75a>
 <2><70c>: Abbrev Number: 22 (DW_TAG_member)
    <70d>   DW_AT_name        : CR
    <710>   DW_AT_decl_file   : 6
    <711>   DW_AT_decl_line   : 216
    <712>   DW_AT_decl_column : 17
    <713>   DW_AT_type        : <0x51d>
    <717>   DW_AT_data_member_location: 0
 <2><718>: Abbrev Number: 1 (DW_TAG_member)
    <719>   DW_AT_name        : (indirect string, offset: 0x8a8ec): NDTR
    <71d>   DW_AT_decl_file   : 6
    <71e>   DW_AT_decl_line   : 217
    <71f>   DW_AT_decl_column : 17
    <720>   DW_AT_type        : <0x51d>
    <724>   DW_AT_data_member_location: 4
 <2><725>: Abbrev Number: 22 (DW_TAG_member)
    <726>   DW_AT_name        : PAR
    <72a>   DW_AT_decl_file   : 6
    <72b>   DW_AT_decl_line   : 218
    <72c>   DW_AT_decl_column : 17
    <72d>   DW_AT_type        : <0x51d>
    <731>   DW_AT_data_member_location: 8
 <2><732>: Abbrev Number: 1 (DW_TAG_member)
    <733>   DW_AT_name        : (indirect string, offset: 0x8a26f): M0AR
    <737>   DW_AT_decl_file   : 6
    <738>   DW_AT_decl_line   : 219
    <739>   DW_AT_decl_column : 17
    <73a>   DW_AT_type        : <0x51d>
    <73e>   DW_AT_data_member_location: 12
 <2><73f>: Abbrev Number: 1 (DW_TAG_member)
    <740>   DW_AT_name        : (indirect string, offset: 0x88b66): M1AR
    <744>   DW_AT_decl_file   : 6
    <745>   DW_AT_decl_line   : 220
    <746>   DW_AT_decl_column : 17
    <747>   DW_AT_type        : <0x51d>
    <74b>   DW_AT_data_member_location: 16
 <2><74c>: Abbrev Number: 22 (DW_TAG_member)
    <74d>   DW_AT_name        : FCR
    <751>   DW_AT_decl_file   : 6
    <752>   DW_AT_decl_line   : 221
    <753>   DW_AT_decl_column : 17
    <754>   DW_AT_type        : <0x51d>
    <758>   DW_AT_data_member_location: 20
 <2><759>: Abbrev Number: 0
 <1><75a>: Abbrev Number: 6 (DW_TAG_typedef)
    <75b>   DW_AT_name        : (indirect string, offset: 0x8cfc0): DMA_Stream_TypeDef
    <75f>   DW_AT_decl_file   : 6
    <760>   DW_AT_decl_line   : 222
    <761>   DW_AT_decl_column : 3
    <762>   DW_AT_type        : <0x703>
 <1><766>: Abbrev Number: 21 (DW_TAG_structure_type)
    <767>   DW_AT_byte_size   : 40
    <768>   DW_AT_decl_file   : 6
    <769>   DW_AT_decl_line   : 265
    <76b>   DW_AT_decl_column : 9
    <76b>   DW_AT_sibling     : <0x7ee>
 <2><76f>: Abbrev Number: 2 (DW_TAG_member)
    <770>   DW_AT_name        : (indirect string, offset: 0x672cf): MODER
    <774>   DW_AT_decl_file   : 6
    <775>   DW_AT_decl_line   : 267
    <777>   DW_AT_decl_column : 17
    <778>   DW_AT_type        : <0x51d>
    <77c>   DW_AT_data_member_location: 0
 <2><77d>: Abbrev Number: 2 (DW_TAG_member)
    <77e>   DW_AT_name        : (indirect string, offset: 0x364ea): OTYPER
    <782>   DW_AT_decl_file   : 6
    <783>   DW_AT_decl_line   : 268
    <785>   DW_AT_decl_column : 17
    <786>   DW_AT_type        : <0x51d>
    <78a>   DW_AT_data_member_location: 4
 <2><78b>: Abbrev Number: 2 (DW_TAG_member)
    <78c>   DW_AT_name        : (indirect string, offset: 0x2b529): OSPEEDR
    <790>   DW_AT_decl_file   : 6
    <791>   DW_AT_decl_line   : 269
    <793>   DW_AT_decl_column : 17
    <794>   DW_AT_type        : <0x51d>
    <798>   DW_AT_data_member_location: 8
 <2><799>: Abbrev Number: 2 (DW_TAG_member)
    <79a>   DW_AT_name        : (indirect string, offset: 0x8776c): PUPDR
    <79e>   DW_AT_decl_file   : 6
    <79f>   DW_AT_decl_line   : 270
    <7a1>   DW_AT_decl_column : 17
    <7a2>   DW_AT_type        : <0x51d>
    <7a6>   DW_AT_data_member_location: 12
 <2><7a7>: Abbrev Number: 7 (DW_TAG_member)
    <7a8>   DW_AT_name        : IDR
    <7ac>   DW_AT_decl_file   : 6
    <7ad>   DW_AT_decl_line   : 271
    <7af>   DW_AT_decl_column : 17
    <7b0>   DW_AT_type        : <0x51d>
    <7b4>   DW_AT_data_member_location: 16
 <2><7b5>: Abbrev Number: 7 (DW_TAG_member)
    <7b6>   DW_AT_name        : ODR
    <7ba>   DW_AT_decl_file   : 6
    <7bb>   DW_AT_decl_line   : 272
    <7bd>   DW_AT_decl_column : 17
    <7be>   DW_AT_type        : <0x51d>
    <7c2>   DW_AT_data_member_location: 20
 <2><7c3>: Abbrev Number: 2 (DW_TAG_member)
    <7c4>   DW_AT_name        : (indirect string, offset: 0x6042b): BSRR
    <7c8>   DW_AT_decl_file   : 6
    <7c9>   DW_AT_decl_line   : 273
    <7cb>   DW_AT_decl_column : 17
    <7cc>   DW_AT_type        : <0x51d>
    <7d0>   DW_AT_data_member_location: 24
 <2><7d1>: Abbrev Number: 2 (DW_TAG_member)
    <7d2>   DW_AT_name        : (indirect string, offset: 0x244fa): LCKR
    <7d6>   DW_AT_decl_file   : 6
    <7d7>   DW_AT_decl_line   : 274
    <7d9>   DW_AT_decl_column : 17
    <7da>   DW_AT_type        : <0x51d>
    <7de>   DW_AT_data_member_location: 28
 <2><7df>: Abbrev Number: 7 (DW_TAG_member)
    <7e0>   DW_AT_name        : AFR
    <7e4>   DW_AT_decl_file   : 6
    <7e5>   DW_AT_decl_line   : 275
    <7e7>   DW_AT_decl_column : 17
    <7e8>   DW_AT_type        : <0x7fe>
    <7ec>   DW_AT_data_member_location: 32
 <2><7ed>: Abbrev Number: 0
 <1><7ee>: Abbrev Number: 16 (DW_TAG_array_type)
    <7ef>   DW_AT_type        : <0x51d>
    <7f3>   DW_AT_sibling     : <0x7fe>
 <2><7f7>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <7f8>   DW_AT_type        : <0x4e8>
    <7fc>   DW_AT_upper_bound : 1
 <2><7fd>: Abbrev Number: 0
 <1><7fe>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <7ff>   DW_AT_type        : <0x7ee>
 <1><803>: Abbrev Number: 19 (DW_TAG_typedef)
    <804>   DW_AT_name        : (indirect string, offset: 0x70668): GPIO_TypeDef
    <808>   DW_AT_decl_file   : 6
    <809>   DW_AT_decl_line   : 276
    <80b>   DW_AT_decl_column : 3
    <80c>   DW_AT_type        : <0x766>
 <1><810>: Abbrev Number: 21 (DW_TAG_structure_type)
    <811>   DW_AT_byte_size   : 8
    <812>   DW_AT_decl_file   : 6
    <813>   DW_AT_decl_line   : 326
    <815>   DW_AT_decl_column : 9
    <815>   DW_AT_sibling     : <0x835>
 <2><819>: Abbrev Number: 7 (DW_TAG_member)
    <81a>   DW_AT_name        : CR
    <81d>   DW_AT_decl_file   : 6
    <81e>   DW_AT_decl_line   : 328
    <820>   DW_AT_decl_column : 17
    <821>   DW_AT_type        : <0x51d>
    <825>   DW_AT_data_member_location: 0
 <2><826>: Abbrev Number: 7 (DW_TAG_member)
    <827>   DW_AT_name        : CSR
    <82b>   DW_AT_decl_file   : 6
    <82c>   DW_AT_decl_line   : 329
    <82e>   DW_AT_decl_column : 17
    <82f>   DW_AT_type        : <0x51d>
    <833>   DW_AT_data_member_location: 4
 <2><834>: Abbrev Number: 0
 <1><835>: Abbrev Number: 19 (DW_TAG_typedef)
    <836>   DW_AT_name        : (indirect string, offset: 0x8bf1f): PWR_TypeDef
    <83a>   DW_AT_decl_file   : 6
    <83b>   DW_AT_decl_line   : 330
    <83d>   DW_AT_decl_column : 3
    <83e>   DW_AT_type        : <0x810>
 <1><842>: Abbrev Number: 21 (DW_TAG_structure_type)
    <843>   DW_AT_byte_size   : 144
    <844>   DW_AT_decl_file   : 6
    <845>   DW_AT_decl_line   : 336
    <847>   DW_AT_decl_column : 9
    <847>   DW_AT_sibling     : <0xa0b>
 <2><84b>: Abbrev Number: 7 (DW_TAG_member)
    <84c>   DW_AT_name        : CR
    <84f>   DW_AT_decl_file   : 6
    <850>   DW_AT_decl_line   : 338
    <852>   DW_AT_decl_column : 17
    <853>   DW_AT_type        : <0x51d>
    <857>   DW_AT_data_member_location: 0
 <2><858>: Abbrev Number: 2 (DW_TAG_member)
    <859>   DW_AT_name        : (indirect string, offset: 0x37c0b): PLLCFGR
    <85d>   DW_AT_decl_file   : 6
    <85e>   DW_AT_decl_line   : 339
    <860>   DW_AT_decl_column : 17
    <861>   DW_AT_type        : <0x51d>
    <865>   DW_AT_data_member_location: 4
 <2><866>: Abbrev Number: 2 (DW_TAG_member)
    <867>   DW_AT_name        : (indirect string, offset: 0x6a373): CFGR
    <86b>   DW_AT_decl_file   : 6
    <86c>   DW_AT_decl_line   : 340
    <86e>   DW_AT_decl_column : 17
    <86f>   DW_AT_type        : <0x51d>
    <873>   DW_AT_data_member_location: 8
 <2><874>: Abbrev Number: 7 (DW_TAG_member)
    <875>   DW_AT_name        : CIR
    <879>   DW_AT_decl_file   : 6
    <87a>   DW_AT_decl_line   : 341
    <87c>   DW_AT_decl_column : 17
    <87d>   DW_AT_type        : <0x51d>
    <881>   DW_AT_data_member_location: 12
 <2><882>: Abbrev Number: 2 (DW_TAG_member)
    <883>   DW_AT_name        : (indirect string, offset: 0x59a6c): AHB1RSTR
    <887>   DW_AT_decl_file   : 6
    <888>   DW_AT_decl_line   : 342
    <88a>   DW_AT_decl_column : 17
    <88b>   DW_AT_type        : <0x51d>
    <88f>   DW_AT_data_member_location: 16
 <2><890>: Abbrev Number: 2 (DW_TAG_member)
    <891>   DW_AT_name        : (indirect string, offset: 0x6f164): AHB2RSTR
    <895>   DW_AT_decl_file   : 6
    <896>   DW_AT_decl_line   : 343
    <898>   DW_AT_decl_column : 17
    <899>   DW_AT_type        : <0x51d>
    <89d>   DW_AT_data_member_location: 20
 <2><89e>: Abbrev Number: 2 (DW_TAG_member)
    <89f>   DW_AT_name        : (indirect string, offset: 0x85075): AHB3RSTR
    <8a3>   DW_AT_decl_file   : 6
    <8a4>   DW_AT_decl_line   : 344
    <8a6>   DW_AT_decl_column : 17
    <8a7>   DW_AT_type        : <0x51d>
    <8ab>   DW_AT_data_member_location: 24
 <2><8ac>: Abbrev Number: 2 (DW_TAG_member)
    <8ad>   DW_AT_name        : (indirect string, offset: 0x102b0): RESERVED0
    <8b1>   DW_AT_decl_file   : 6
    <8b2>   DW_AT_decl_line   : 345
    <8b4>   DW_AT_decl_column : 17
    <8b5>   DW_AT_type        : <0x511>
    <8b9>   DW_AT_data_member_location: 28
 <2><8ba>: Abbrev Number: 2 (DW_TAG_member)
    <8bb>   DW_AT_name        : (indirect string, offset: 0x1aaae): APB1RSTR
    <8bf>   DW_AT_decl_file   : 6
    <8c0>   DW_AT_decl_line   : 346
    <8c2>   DW_AT_decl_column : 17
    <8c3>   DW_AT_type        : <0x51d>
    <8c7>   DW_AT_data_member_location: 32
 <2><8c8>: Abbrev Number: 2 (DW_TAG_member)
    <8c9>   DW_AT_name        : (indirect string, offset: 0xb1c0): APB2RSTR
    <8cd>   DW_AT_decl_file   : 6
    <8ce>   DW_AT_decl_line   : 347
    <8d0>   DW_AT_decl_column : 17
    <8d1>   DW_AT_type        : <0x51d>
    <8d5>   DW_AT_data_member_location: 36
 <2><8d6>: Abbrev Number: 2 (DW_TAG_member)
    <8d7>   DW_AT_name        : (indirect string, offset: 0x10332): RESERVED1
    <8db>   DW_AT_decl_file   : 6
    <8dc>   DW_AT_decl_line   : 348
    <8de>   DW_AT_decl_column : 17
    <8df>   DW_AT_type        : <0x6f3>
    <8e3>   DW_AT_data_member_location: 40
 <2><8e4>: Abbrev Number: 2 (DW_TAG_member)
    <8e5>   DW_AT_name        : (indirect string, offset: 0x6d1a5): AHB1ENR
    <8e9>   DW_AT_decl_file   : 6
    <8ea>   DW_AT_decl_line   : 349
    <8ec>   DW_AT_decl_column : 17
    <8ed>   DW_AT_type        : <0x51d>
    <8f1>   DW_AT_data_member_location: 48
 <2><8f2>: Abbrev Number: 2 (DW_TAG_member)
    <8f3>   DW_AT_name        : (indirect string, offset: 0x17474): AHB2ENR
    <8f7>   DW_AT_decl_file   : 6
    <8f8>   DW_AT_decl_line   : 350
    <8fa>   DW_AT_decl_column : 17
    <8fb>   DW_AT_type        : <0x51d>
    <8ff>   DW_AT_data_member_location: 52
 <2><900>: Abbrev Number: 2 (DW_TAG_member)
    <901>   DW_AT_name        : (indirect string, offset: 0x1488): AHB3ENR
    <905>   DW_AT_decl_file   : 6
    <906>   DW_AT_decl_line   : 351
    <908>   DW_AT_decl_column : 17
    <909>   DW_AT_type        : <0x51d>
    <90d>   DW_AT_data_member_location: 56
 <2><90e>: Abbrev Number: 2 (DW_TAG_member)
    <90f>   DW_AT_name        : (indirect string, offset: 0x1033c): RESERVED2
    <913>   DW_AT_decl_file   : 6
    <914>   DW_AT_decl_line   : 352
    <916>   DW_AT_decl_column : 17
    <917>   DW_AT_type        : <0x511>
    <91b>   DW_AT_data_member_location: 60
 <2><91c>: Abbrev Number: 2 (DW_TAG_member)
    <91d>   DW_AT_name        : (indirect string, offset: 0x27945): APB1ENR
    <921>   DW_AT_decl_file   : 6
    <922>   DW_AT_decl_line   : 353
    <924>   DW_AT_decl_column : 17
    <925>   DW_AT_type        : <0x51d>
    <929>   DW_AT_data_member_location: 64
 <2><92a>: Abbrev Number: 2 (DW_TAG_member)
    <92b>   DW_AT_name        : (indirect string, offset: 0x56d03): APB2ENR
    <92f>   DW_AT_decl_file   : 6
    <930>   DW_AT_decl_line   : 354
    <932>   DW_AT_decl_column : 17
    <933>   DW_AT_type        : <0x51d>
    <937>   DW_AT_data_member_location: 68
 <2><938>: Abbrev Number: 2 (DW_TAG_member)
    <939>   DW_AT_name        : (indirect string, offset: 0x55c12): RESERVED3
    <93d>   DW_AT_decl_file   : 6
    <93e>   DW_AT_decl_line   : 355
    <940>   DW_AT_decl_column : 17
    <941>   DW_AT_type        : <0x6f3>
    <945>   DW_AT_data_member_location: 72
 <2><946>: Abbrev Number: 2 (DW_TAG_member)
    <947>   DW_AT_name        : (indirect string, offset: 0x27525): AHB1LPENR
    <94b>   DW_AT_decl_file   : 6
    <94c>   DW_AT_decl_line   : 356
    <94e>   DW_AT_decl_column : 17
    <94f>   DW_AT_type        : <0x51d>
    <953>   DW_AT_data_member_location: 80
 <2><954>: Abbrev Number: 2 (DW_TAG_member)
    <955>   DW_AT_name        : (indirect string, offset: 0x5d53e): AHB2LPENR
    <959>   DW_AT_decl_file   : 6
    <95a>   DW_AT_decl_line   : 357
    <95c>   DW_AT_decl_column : 17
    <95d>   DW_AT_type        : <0x51d>
    <961>   DW_AT_data_member_location: 84
 <2><962>: Abbrev Number: 2 (DW_TAG_member)
    <963>   DW_AT_name        : (indirect string, offset: 0x6b1f7): AHB3LPENR
    <967>   DW_AT_decl_file   : 6
    <968>   DW_AT_decl_line   : 358
    <96a>   DW_AT_decl_column : 17
    <96b>   DW_AT_type        : <0x51d>
    <96f>   DW_AT_data_member_location: 88
 <2><970>: Abbrev Number: 2 (DW_TAG_member)
    <971>   DW_AT_name        : (indirect string, offset: 0x55c1c): RESERVED4
    <975>   DW_AT_decl_file   : 6
    <976>   DW_AT_decl_line   : 359
    <978>   DW_AT_decl_column : 17
    <979>   DW_AT_type        : <0x511>
    <97d>   DW_AT_data_member_location: 92
 <2><97e>: Abbrev Number: 2 (DW_TAG_member)
    <97f>   DW_AT_name        : (indirect string, offset: 0x6c78d): APB1LPENR
    <983>   DW_AT_decl_file   : 6
    <984>   DW_AT_decl_line   : 360
    <986>   DW_AT_decl_column : 17
    <987>   DW_AT_type        : <0x51d>
    <98b>   DW_AT_data_member_location: 96
 <2><98c>: Abbrev Number: 2 (DW_TAG_member)
    <98d>   DW_AT_name        : (indirect string, offset: 0x862db): APB2LPENR
    <991>   DW_AT_decl_file   : 6
    <992>   DW_AT_decl_line   : 361
    <994>   DW_AT_decl_column : 17
    <995>   DW_AT_type        : <0x51d>
    <999>   DW_AT_data_member_location: 100
 <2><99a>: Abbrev Number: 2 (DW_TAG_member)
    <99b>   DW_AT_name        : (indirect string, offset: 0x55c26): RESERVED5
    <99f>   DW_AT_decl_file   : 6
    <9a0>   DW_AT_decl_line   : 362
    <9a2>   DW_AT_decl_column : 17
    <9a3>   DW_AT_type        : <0x6f3>
    <9a7>   DW_AT_data_member_location: 104
 <2><9a8>: Abbrev Number: 2 (DW_TAG_member)
    <9a9>   DW_AT_name        : (indirect string, offset: 0x8806b): BDCR
    <9ad>   DW_AT_decl_file   : 6
    <9ae>   DW_AT_decl_line   : 363
    <9b0>   DW_AT_decl_column : 17
    <9b1>   DW_AT_type        : <0x51d>
    <9b5>   DW_AT_data_member_location: 112
 <2><9b6>: Abbrev Number: 7 (DW_TAG_member)
    <9b7>   DW_AT_name        : CSR
    <9bb>   DW_AT_decl_file   : 6
    <9bc>   DW_AT_decl_line   : 364
    <9be>   DW_AT_decl_column : 17
    <9bf>   DW_AT_type        : <0x51d>
    <9c3>   DW_AT_data_member_location: 116
 <2><9c4>: Abbrev Number: 2 (DW_TAG_member)
    <9c5>   DW_AT_name        : (indirect string, offset: 0x4f701): RESERVED6
    <9c9>   DW_AT_decl_file   : 6
    <9ca>   DW_AT_decl_line   : 365
    <9cc>   DW_AT_decl_column : 17
    <9cd>   DW_AT_type        : <0x6f3>
    <9d1>   DW_AT_data_member_location: 120
 <2><9d2>: Abbrev Number: 2 (DW_TAG_member)
    <9d3>   DW_AT_name        : (indirect string, offset: 0x738bb): SSCGR
    <9d7>   DW_AT_decl_file   : 6
    <9d8>   DW_AT_decl_line   : 366
    <9da>   DW_AT_decl_column : 17
    <9db>   DW_AT_type        : <0x51d>
    <9df>   DW_AT_data_member_location: 128
 <2><9e0>: Abbrev Number: 2 (DW_TAG_member)
    <9e1>   DW_AT_name        : (indirect string, offset: 0xdbaa): PLLI2SCFGR
    <9e5>   DW_AT_decl_file   : 6
    <9e6>   DW_AT_decl_line   : 367
    <9e8>   DW_AT_decl_column : 17
    <9e9>   DW_AT_type        : <0x51d>
    <9ed>   DW_AT_data_member_location: 132
 <2><9ee>: Abbrev Number: 2 (DW_TAG_member)
    <9ef>   DW_AT_name        : (indirect string, offset: 0x55c63): RESERVED7
    <9f3>   DW_AT_decl_file   : 6
    <9f4>   DW_AT_decl_line   : 368
    <9f6>   DW_AT_decl_column : 17
    <9f7>   DW_AT_type        : <0x6e3>
    <9fb>   DW_AT_data_member_location: 136
 <2><9fc>: Abbrev Number: 2 (DW_TAG_member)
    <9fd>   DW_AT_name        : (indirect string, offset: 0x6a370): DCKCFGR
    <a01>   DW_AT_decl_file   : 6
    <a02>   DW_AT_decl_line   : 369
    <a04>   DW_AT_decl_column : 17
    <a05>   DW_AT_type        : <0x51d>
    <a09>   DW_AT_data_member_location: 140
 <2><a0a>: Abbrev Number: 0
 <1><a0b>: Abbrev Number: 19 (DW_TAG_typedef)
    <a0c>   DW_AT_name        : (indirect string, offset: 0x1c2c1): RCC_TypeDef
    <a10>   DW_AT_decl_file   : 6
    <a11>   DW_AT_decl_line   : 370
    <a13>   DW_AT_decl_column : 3
    <a14>   DW_AT_type        : <0x842>
 <1><a18>: Abbrev Number: 21 (DW_TAG_structure_type)
    <a19>   DW_AT_byte_size   : 36
    <a1a>   DW_AT_decl_file   : 6
    <a1b>   DW_AT_decl_line   : 452
    <a1d>   DW_AT_decl_column : 9
    <a1d>   DW_AT_sibling     : <0xa9e>
 <2><a21>: Abbrev Number: 7 (DW_TAG_member)
    <a22>   DW_AT_name        : CR1
    <a26>   DW_AT_decl_file   : 6
    <a27>   DW_AT_decl_line   : 454
    <a29>   DW_AT_decl_column : 17
    <a2a>   DW_AT_type        : <0x51d>
    <a2e>   DW_AT_data_member_location: 0
 <2><a2f>: Abbrev Number: 7 (DW_TAG_member)
    <a30>   DW_AT_name        : CR2
    <a34>   DW_AT_decl_file   : 6
    <a35>   DW_AT_decl_line   : 455
    <a37>   DW_AT_decl_column : 17
    <a38>   DW_AT_type        : <0x51d>
    <a3c>   DW_AT_data_member_location: 4
 <2><a3d>: Abbrev Number: 7 (DW_TAG_member)
    <a3e>   DW_AT_name        : SR
    <a41>   DW_AT_decl_file   : 6
    <a42>   DW_AT_decl_line   : 456
    <a44>   DW_AT_decl_column : 17
    <a45>   DW_AT_type        : <0x51d>
    <a49>   DW_AT_data_member_location: 8
 <2><a4a>: Abbrev Number: 7 (DW_TAG_member)
    <a4b>   DW_AT_name        : DR
    <a4e>   DW_AT_decl_file   : 6
    <a4f>   DW_AT_decl_line   : 457
    <a51>   DW_AT_decl_column : 17
    <a52>   DW_AT_type        : <0x51d>
    <a56>   DW_AT_data_member_location: 12
 <2><a57>: Abbrev Number: 2 (DW_TAG_member)
    <a58>   DW_AT_name        : (indirect string, offset: 0x8963a): CRCPR
    <a5c>   DW_AT_decl_file   : 6
    <a5d>   DW_AT_decl_line   : 458
    <a5f>   DW_AT_decl_column : 17
    <a60>   DW_AT_type        : <0x51d>
    <a64>   DW_AT_data_member_location: 16
 <2><a65>: Abbrev Number: 2 (DW_TAG_member)
    <a66>   DW_AT_name        : (indirect string, offset: 0x8b16e): RXCRCR
    <a6a>   DW_AT_decl_file   : 6
    <a6b>   DW_AT_decl_line   : 459
    <a6d>   DW_AT_decl_column : 17
    <a6e>   DW_AT_type        : <0x51d>
    <a72>   DW_AT_data_member_location: 20
 <2><a73>: Abbrev Number: 2 (DW_TAG_member)
    <a74>   DW_AT_name        : (indirect string, offset: 0x8a9e3): TXCRCR
    <a78>   DW_AT_decl_file   : 6
    <a79>   DW_AT_decl_line   : 460
    <a7b>   DW_AT_decl_column : 17
    <a7c>   DW_AT_type        : <0x51d>
    <a80>   DW_AT_data_member_location: 24
 <2><a81>: Abbrev Number: 2 (DW_TAG_member)
    <a82>   DW_AT_name        : (indirect string, offset: 0xdbad): I2SCFGR
    <a86>   DW_AT_decl_file   : 6
    <a87>   DW_AT_decl_line   : 461
    <a89>   DW_AT_decl_column : 17
    <a8a>   DW_AT_type        : <0x51d>
    <a8e>   DW_AT_data_member_location: 28
 <2><a8f>: Abbrev Number: 2 (DW_TAG_member)
    <a90>   DW_AT_name        : (indirect string, offset: 0x89e22): I2SPR
    <a94>   DW_AT_decl_file   : 6
    <a95>   DW_AT_decl_line   : 462
    <a97>   DW_AT_decl_column : 17
    <a98>   DW_AT_type        : <0x51d>
    <a9c>   DW_AT_data_member_location: 32
 <2><a9d>: Abbrev Number: 0
 <1><a9e>: Abbrev Number: 19 (DW_TAG_typedef)
    <a9f>   DW_AT_name        : (indirect string, offset: 0x8957c): SPI_TypeDef
    <aa3>   DW_AT_decl_file   : 6
    <aa4>   DW_AT_decl_line   : 463
    <aa6>   DW_AT_decl_column : 3
    <aa7>   DW_AT_type        : <0xa18>
 <1><aab>: Abbrev Number: 21 (DW_TAG_structure_type)
    <aac>   DW_AT_byte_size   : 84
    <aad>   DW_AT_decl_file   : 6
    <aae>   DW_AT_decl_line   : 470
    <ab0>   DW_AT_decl_column : 9
    <ab0>   DW_AT_sibling     : <0xbd9>
 <2><ab4>: Abbrev Number: 7 (DW_TAG_member)
    <ab5>   DW_AT_name        : CR1
    <ab9>   DW_AT_decl_file   : 6
    <aba>   DW_AT_decl_line   : 472
    <abc>   DW_AT_decl_column : 17
    <abd>   DW_AT_type        : <0x51d>
    <ac1>   DW_AT_data_member_location: 0
 <2><ac2>: Abbrev Number: 7 (DW_TAG_member)
    <ac3>   DW_AT_name        : CR2
    <ac7>   DW_AT_decl_file   : 6
    <ac8>   DW_AT_decl_line   : 473
    <aca>   DW_AT_decl_column : 17
    <acb>   DW_AT_type        : <0x51d>
    <acf>   DW_AT_data_member_location: 4
 <2><ad0>: Abbrev Number: 2 (DW_TAG_member)
    <ad1>   DW_AT_name        : (indirect string, offset: 0x841f6): SMCR
    <ad5>   DW_AT_decl_file   : 6
    <ad6>   DW_AT_decl_line   : 474
    <ad8>   DW_AT_decl_column : 17
    <ad9>   DW_AT_type        : <0x51d>
    <add>   DW_AT_data_member_location: 8
 <2><ade>: Abbrev Number: 2 (DW_TAG_member)
    <adf>   DW_AT_name        : (indirect string, offset: 0x62de8): DIER
    <ae3>   DW_AT_decl_file   : 6
    <ae4>   DW_AT_decl_line   : 475
    <ae6>   DW_AT_decl_column : 17
    <ae7>   DW_AT_type        : <0x51d>
    <aeb>   DW_AT_data_member_location: 12
 <2><aec>: Abbrev Number: 7 (DW_TAG_member)
    <aed>   DW_AT_name        : SR
    <af0>   DW_AT_decl_file   : 6
    <af1>   DW_AT_decl_line   : 476
    <af3>   DW_AT_decl_column : 17
    <af4>   DW_AT_type        : <0x51d>
    <af8>   DW_AT_data_member_location: 16
 <2><af9>: Abbrev Number: 7 (DW_TAG_member)
    <afa>   DW_AT_name        : EGR
    <afe>   DW_AT_decl_file   : 6
    <aff>   DW_AT_decl_line   : 477
    <b01>   DW_AT_decl_column : 17
    <b02>   DW_AT_type        : <0x51d>
    <b06>   DW_AT_data_member_location: 20
 <2><b07>: Abbrev Number: 2 (DW_TAG_member)
    <b08>   DW_AT_name        : (indirect string, offset: 0x56836): CCMR1
    <b0c>   DW_AT_decl_file   : 6
    <b0d>   DW_AT_decl_line   : 478
    <b0f>   DW_AT_decl_column : 17
    <b10>   DW_AT_type        : <0x51d>
    <b14>   DW_AT_data_member_location: 24
 <2><b15>: Abbrev Number: 2 (DW_TAG_member)
    <b16>   DW_AT_name        : (indirect string, offset: 0x5c346): CCMR2
    <b1a>   DW_AT_decl_file   : 6
    <b1b>   DW_AT_decl_line   : 479
    <b1d>   DW_AT_decl_column : 17
    <b1e>   DW_AT_type        : <0x51d>
    <b22>   DW_AT_data_member_location: 28
 <2><b23>: Abbrev Number: 2 (DW_TAG_member)
    <b24>   DW_AT_name        : (indirect string, offset: 0x82891): CCER
    <b28>   DW_AT_decl_file   : 6
    <b29>   DW_AT_decl_line   : 480
    <b2b>   DW_AT_decl_column : 17
    <b2c>   DW_AT_type        : <0x51d>
    <b30>   DW_AT_data_member_location: 32
 <2><b31>: Abbrev Number: 7 (DW_TAG_member)
    <b32>   DW_AT_name        : CNT
    <b36>   DW_AT_decl_file   : 6
    <b37>   DW_AT_decl_line   : 481
    <b39>   DW_AT_decl_column : 17
    <b3a>   DW_AT_type        : <0x51d>
    <b3e>   DW_AT_data_member_location: 36
 <2><b3f>: Abbrev Number: 7 (DW_TAG_member)
    <b40>   DW_AT_name        : PSC
    <b44>   DW_AT_decl_file   : 6
    <b45>   DW_AT_decl_line   : 482
    <b47>   DW_AT_decl_column : 17
    <b48>   DW_AT_type        : <0x51d>
    <b4c>   DW_AT_data_member_location: 40
 <2><b4d>: Abbrev Number: 7 (DW_TAG_member)
    <b4e>   DW_AT_name        : ARR
    <b52>   DW_AT_decl_file   : 6
    <b53>   DW_AT_decl_line   : 483
    <b55>   DW_AT_decl_column : 17
    <b56>   DW_AT_type        : <0x51d>
    <b5a>   DW_AT_data_member_location: 44
 <2><b5b>: Abbrev Number: 7 (DW_TAG_member)
    <b5c>   DW_AT_name        : RCR
    <b60>   DW_AT_decl_file   : 6
    <b61>   DW_AT_decl_line   : 484
    <b63>   DW_AT_decl_column : 17
    <b64>   DW_AT_type        : <0x51d>
    <b68>   DW_AT_data_member_location: 48
 <2><b69>: Abbrev Number: 2 (DW_TAG_member)
    <b6a>   DW_AT_name        : (indirect string, offset: 0x7064c): CCR1
    <b6e>   DW_AT_decl_file   : 6
    <b6f>   DW_AT_decl_line   : 485
    <b71>   DW_AT_decl_column : 17
    <b72>   DW_AT_type        : <0x51d>
    <b76>   DW_AT_data_member_location: 52
 <2><b77>: Abbrev Number: 2 (DW_TAG_member)
    <b78>   DW_AT_name        : (indirect string, offset: 0x39b0b): CCR2
    <b7c>   DW_AT_decl_file   : 6
    <b7d>   DW_AT_decl_line   : 486
    <b7f>   DW_AT_decl_column : 17
    <b80>   DW_AT_type        : <0x51d>
    <b84>   DW_AT_data_member_location: 56
 <2><b85>: Abbrev Number: 2 (DW_TAG_member)
    <b86>   DW_AT_name        : (indirect string, offset: 0x35a07): CCR3
    <b8a>   DW_AT_decl_file   : 6
    <b8b>   DW_AT_decl_line   : 487
    <b8d>   DW_AT_decl_column : 17
    <b8e>   DW_AT_type        : <0x51d>
    <b92>   DW_AT_data_member_location: 60
 <2><b93>: Abbrev Number: 2 (DW_TAG_member)
    <b94>   DW_AT_name        : (indirect string, offset: 0xf747): CCR4
    <b98>   DW_AT_decl_file   : 6
    <b99>   DW_AT_decl_line   : 488
    <b9b>   DW_AT_decl_column : 17
    <b9c>   DW_AT_type        : <0x51d>
    <ba0>   DW_AT_data_member_location: 64
 <2><ba1>: Abbrev Number: 2 (DW_TAG_member)
    <ba2>   DW_AT_name        : (indirect string, offset: 0xa271): BDTR
    <ba6>   DW_AT_decl_file   : 6
    <ba7>   DW_AT_decl_line   : 489
    <ba9>   DW_AT_decl_column : 17
    <baa>   DW_AT_type        : <0x51d>
    <bae>   DW_AT_data_member_location: 68
 <2><baf>: Abbrev Number: 7 (DW_TAG_member)
    <bb0>   DW_AT_name        : DCR
    <bb4>   DW_AT_decl_file   : 6
    <bb5>   DW_AT_decl_line   : 490
    <bb7>   DW_AT_decl_column : 17
    <bb8>   DW_AT_type        : <0x51d>
    <bbc>   DW_AT_data_member_location: 72
 <2><bbd>: Abbrev Number: 2 (DW_TAG_member)
    <bbe>   DW_AT_name        : (indirect string, offset: 0x3c28): DMAR
    <bc2>   DW_AT_decl_file   : 6
    <bc3>   DW_AT_decl_line   : 491
    <bc5>   DW_AT_decl_column : 17
    <bc6>   DW_AT_type        : <0x51d>
    <bca>   DW_AT_data_member_location: 76
 <2><bcb>: Abbrev Number: 7 (DW_TAG_member)
    <bcc>   DW_AT_name        : OR
    <bcf>   DW_AT_decl_file   : 6
    <bd0>   DW_AT_decl_line   : 492
    <bd2>   DW_AT_decl_column : 17
    <bd3>   DW_AT_type        : <0x51d>
    <bd7>   DW_AT_data_member_location: 80
 <2><bd8>: Abbrev Number: 0
 <1><bd9>: Abbrev Number: 19 (DW_TAG_typedef)
    <bda>   DW_AT_name        : (indirect string, offset: 0x88684): TIM_TypeDef
    <bde>   DW_AT_decl_file   : 6
    <bdf>   DW_AT_decl_line   : 493
    <be1>   DW_AT_decl_column : 3
    <be2>   DW_AT_type        : <0xaab>
 <1><be6>: Abbrev Number: 18 (DW_TAG_base_type)
    <be7>   DW_AT_byte_size   : 8
    <be8>   DW_AT_encoding    : 4	(float)
    <be9>   DW_AT_name        : (indirect string, offset: 0x8c5d2): long double
 <1><bed>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <bee>   DW_AT_encoding    : 7	(unsigned)
    <bee>   DW_AT_byte_size   : 1
    <bee>   DW_AT_type        : <0x48c>
    <bf2>   DW_AT_decl_file   : 7
    <bf3>   DW_AT_decl_line   : 39
    <bf4>   DW_AT_decl_column : 1
    <bf4>   DW_AT_sibling     : <0xc11>
 <2><bf8>: Abbrev Number: 4 (DW_TAG_enumerator)
    <bf9>   DW_AT_name        : (indirect string, offset: 0x89c99): HAL_OK
    <bfd>   DW_AT_const_value : 0
 <2><bfe>: Abbrev Number: 4 (DW_TAG_enumerator)
    <bff>   DW_AT_name        : (indirect string, offset: 0x8b523): HAL_ERROR
    <c03>   DW_AT_const_value : 1
 <2><c04>: Abbrev Number: 4 (DW_TAG_enumerator)
    <c05>   DW_AT_name        : (indirect string, offset: 0x8c6cf): HAL_BUSY
    <c09>   DW_AT_const_value : 2
 <2><c0a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <c0b>   DW_AT_name        : (indirect string, offset: 0x8998e): HAL_TIMEOUT
    <c0f>   DW_AT_const_value : 3
 <2><c10>: Abbrev Number: 0
 <1><c11>: Abbrev Number: 6 (DW_TAG_typedef)
    <c12>   DW_AT_name        : (indirect string, offset: 0x884bd): HAL_StatusTypeDef
    <c16>   DW_AT_decl_file   : 7
    <c17>   DW_AT_decl_line   : 44
    <c18>   DW_AT_decl_column : 3
    <c19>   DW_AT_type        : <0xbed>
 <1><c1d>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <c1e>   DW_AT_encoding    : 7	(unsigned)
    <c1e>   DW_AT_byte_size   : 1
    <c1e>   DW_AT_type        : <0x48c>
    <c22>   DW_AT_decl_file   : 7
    <c23>   DW_AT_decl_line   : 50
    <c24>   DW_AT_decl_column : 1
    <c24>   DW_AT_sibling     : <0xc35>
 <2><c28>: Abbrev Number: 4 (DW_TAG_enumerator)
    <c29>   DW_AT_name        : (indirect string, offset: 0x8bfd9): HAL_UNLOCKED
    <c2d>   DW_AT_const_value : 0
 <2><c2e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <c2f>   DW_AT_name        : (indirect string, offset: 0x8d65b): HAL_LOCKED
    <c33>   DW_AT_const_value : 1
 <2><c34>: Abbrev Number: 0
 <1><c35>: Abbrev Number: 6 (DW_TAG_typedef)
    <c36>   DW_AT_name        : (indirect string, offset: 0x8b2a2): HAL_LockTypeDef
    <c3a>   DW_AT_decl_file   : 7
    <c3b>   DW_AT_decl_line   : 53
    <c3c>   DW_AT_decl_column : 3
    <c3d>   DW_AT_type        : <0xc1d>
 <1><c41>: Abbrev Number: 8 (DW_TAG_structure_type)
    <c42>   DW_AT_byte_size   : 24
    <c43>   DW_AT_decl_file   : 8
    <c44>   DW_AT_decl_line   : 45
    <c45>   DW_AT_decl_column : 9
    <c46>   DW_AT_sibling     : <0xc99>
 <2><c4a>: Abbrev Number: 1 (DW_TAG_member)
    <c4b>   DW_AT_name        : (indirect string, offset: 0x8b904): PLLState
    <c4f>   DW_AT_decl_file   : 8
    <c50>   DW_AT_decl_line   : 47
    <c51>   DW_AT_decl_column : 12
    <c52>   DW_AT_type        : <0x511>
    <c56>   DW_AT_data_member_location: 0
 <2><c57>: Abbrev Number: 1 (DW_TAG_member)
    <c58>   DW_AT_name        : (indirect string, offset: 0x8b9b7): PLLSource
    <c5c>   DW_AT_decl_file   : 8
    <c5d>   DW_AT_decl_line   : 50
    <c5e>   DW_AT_decl_column : 12
    <c5f>   DW_AT_type        : <0x511>
    <c63>   DW_AT_data_member_location: 4
 <2><c64>: Abbrev Number: 1 (DW_TAG_member)
    <c65>   DW_AT_name        : (indirect string, offset: 0x8c642): PLLM
    <c69>   DW_AT_decl_file   : 8
    <c6a>   DW_AT_decl_line   : 53
    <c6b>   DW_AT_decl_column : 12
    <c6c>   DW_AT_type        : <0x511>
    <c70>   DW_AT_data_member_location: 8
 <2><c71>: Abbrev Number: 1 (DW_TAG_member)
    <c72>   DW_AT_name        : (indirect string, offset: 0x8c647): PLLN
    <c76>   DW_AT_decl_file   : 8
    <c77>   DW_AT_decl_line   : 56
    <c78>   DW_AT_decl_column : 12
    <c79>   DW_AT_type        : <0x511>
    <c7d>   DW_AT_data_member_location: 12
 <2><c7e>: Abbrev Number: 1 (DW_TAG_member)
    <c7f>   DW_AT_name        : (indirect string, offset: 0x8a7a7): PLLP
    <c83>   DW_AT_decl_file   : 8
    <c84>   DW_AT_decl_line   : 60
    <c85>   DW_AT_decl_column : 12
    <c86>   DW_AT_type        : <0x511>
    <c8a>   DW_AT_data_member_location: 16
 <2><c8b>: Abbrev Number: 1 (DW_TAG_member)
    <c8c>   DW_AT_name        : (indirect string, offset: 0x762e3): PLLQ
    <c90>   DW_AT_decl_file   : 8
    <c91>   DW_AT_decl_line   : 63
    <c92>   DW_AT_decl_column : 12
    <c93>   DW_AT_type        : <0x511>
    <c97>   DW_AT_data_member_location: 20
 <2><c98>: Abbrev Number: 0
 <1><c99>: Abbrev Number: 6 (DW_TAG_typedef)
    <c9a>   DW_AT_name        : (indirect string, offset: 0x8d442): RCC_PLLInitTypeDef
    <c9e>   DW_AT_decl_file   : 8
    <c9f>   DW_AT_decl_line   : 73
    <ca0>   DW_AT_decl_column : 2
    <ca1>   DW_AT_type        : <0xc41>
 <1><ca5>: Abbrev Number: 8 (DW_TAG_structure_type)
    <ca6>   DW_AT_byte_size   : 48
    <ca7>   DW_AT_decl_file   : 9
    <ca8>   DW_AT_decl_line   : 49
    <ca9>   DW_AT_decl_column : 9
    <caa>   DW_AT_sibling     : <0xd0a>
 <2><cae>: Abbrev Number: 1 (DW_TAG_member)
    <caf>   DW_AT_name        : (indirect string, offset: 0x8c587): OscillatorType
    <cb3>   DW_AT_decl_file   : 9
    <cb4>   DW_AT_decl_line   : 51
    <cb5>   DW_AT_decl_column : 12
    <cb6>   DW_AT_type        : <0x511>
    <cba>   DW_AT_data_member_location: 0
 <2><cbb>: Abbrev Number: 1 (DW_TAG_member)
    <cbc>   DW_AT_name        : (indirect string, offset: 0x8b9ae): HSEState
    <cc0>   DW_AT_decl_file   : 9
    <cc1>   DW_AT_decl_line   : 54
    <cc2>   DW_AT_decl_column : 12
    <cc3>   DW_AT_type        : <0x511>
    <cc7>   DW_AT_data_member_location: 4
 <2><cc8>: Abbrev Number: 1 (DW_TAG_member)
    <cc9>   DW_AT_name        : (indirect string, offset: 0x8b550): LSEState
    <ccd>   DW_AT_decl_file   : 9
    <cce>   DW_AT_decl_line   : 57
    <ccf>   DW_AT_decl_column : 12
    <cd0>   DW_AT_type        : <0x511>
    <cd4>   DW_AT_data_member_location: 8
 <2><cd5>: Abbrev Number: 1 (DW_TAG_member)
    <cd6>   DW_AT_name        : (indirect string, offset: 0x8a5d1): HSIState
    <cda>   DW_AT_decl_file   : 9
    <cdb>   DW_AT_decl_line   : 60
    <cdc>   DW_AT_decl_column : 12
    <cdd>   DW_AT_type        : <0x511>
    <ce1>   DW_AT_data_member_location: 12
 <2><ce2>: Abbrev Number: 1 (DW_TAG_member)
    <ce3>   DW_AT_name        : (indirect string, offset: 0x8c8fe): HSICalibrationValue
    <ce7>   DW_AT_decl_file   : 9
    <ce8>   DW_AT_decl_line   : 63
    <ce9>   DW_AT_decl_column : 12
    <cea>   DW_AT_type        : <0x511>
    <cee>   DW_AT_data_member_location: 16
 <2><cef>: Abbrev Number: 1 (DW_TAG_member)
    <cf0>   DW_AT_name        : (indirect string, offset: 0x8cb57): LSIState
    <cf4>   DW_AT_decl_file   : 9
    <cf5>   DW_AT_decl_line   : 66
    <cf6>   DW_AT_decl_column : 12
    <cf7>   DW_AT_type        : <0x511>
    <cfb>   DW_AT_data_member_location: 20
 <2><cfc>: Abbrev Number: 22 (DW_TAG_member)
    <cfd>   DW_AT_name        : PLL
    <d01>   DW_AT_decl_file   : 9
    <d02>   DW_AT_decl_line   : 69
    <d03>   DW_AT_decl_column : 22
    <d04>   DW_AT_type        : <0xc99>
    <d08>   DW_AT_data_member_location: 24
 <2><d09>: Abbrev Number: 0
 <1><d0a>: Abbrev Number: 6 (DW_TAG_typedef)
    <d0b>   DW_AT_name        : (indirect string, offset: 0x8ac74): RCC_OscInitTypeDef
    <d0f>   DW_AT_decl_file   : 9
    <d10>   DW_AT_decl_line   : 70
    <d11>   DW_AT_decl_column : 2
    <d12>   DW_AT_type        : <0xca5>
 <1><d16>: Abbrev Number: 8 (DW_TAG_structure_type)
    <d17>   DW_AT_byte_size   : 20
    <d18>   DW_AT_decl_file   : 9
    <d19>   DW_AT_decl_line   : 75
    <d1a>   DW_AT_decl_column : 9
    <d1b>   DW_AT_sibling     : <0xd61>
 <2><d1f>: Abbrev Number: 1 (DW_TAG_member)
    <d20>   DW_AT_name        : (indirect string, offset: 0x89a4e): ClockType
    <d24>   DW_AT_decl_file   : 9
    <d25>   DW_AT_decl_line   : 77
    <d26>   DW_AT_decl_column : 12
    <d27>   DW_AT_type        : <0x511>
    <d2b>   DW_AT_data_member_location: 0
 <2><d2c>: Abbrev Number: 1 (DW_TAG_member)
    <d2d>   DW_AT_name        : (indirect string, offset: 0x8aa35): SYSCLKSource
    <d31>   DW_AT_decl_file   : 9
    <d32>   DW_AT_decl_line   : 80
    <d33>   DW_AT_decl_column : 12
    <d34>   DW_AT_type        : <0x511>
    <d38>   DW_AT_data_member_location: 4
 <2><d39>: Abbrev Number: 1 (DW_TAG_member)
    <d3a>   DW_AT_name        : (indirect string, offset: 0x8c611): AHBCLKDivider
    <d3e>   DW_AT_decl_file   : 9
    <d3f>   DW_AT_decl_line   : 83
    <d40>   DW_AT_decl_column : 12
    <d41>   DW_AT_type        : <0x511>
    <d45>   DW_AT_data_member_location: 8
 <2><d46>: Abbrev Number: 1 (DW_TAG_member)
    <d47>   DW_AT_name        : (indirect string, offset: 0x88722): APB1CLKDivider
    <d4b>   DW_AT_decl_file   : 9
    <d4c>   DW_AT_decl_line   : 86
    <d4d>   DW_AT_decl_column : 12
    <d4e>   DW_AT_type        : <0x511>
    <d52>   DW_AT_data_member_location: 12
 <2><d53>: Abbrev Number: 1 (DW_TAG_member)
    <d54>   DW_AT_name        : (indirect string, offset: 0x8a748): APB2CLKDivider
    <d58>   DW_AT_decl_file   : 9
    <d59>   DW_AT_decl_line   : 89
    <d5a>   DW_AT_decl_column : 12
    <d5b>   DW_AT_type        : <0x511>
    <d5f>   DW_AT_data_member_location: 16
 <2><d60>: Abbrev Number: 0
 <1><d61>: Abbrev Number: 6 (DW_TAG_typedef)
    <d62>   DW_AT_name        : (indirect string, offset: 0x8c2b3): RCC_ClkInitTypeDef
    <d66>   DW_AT_decl_file   : 9
    <d67>   DW_AT_decl_line   : 92
    <d68>   DW_AT_decl_column : 2
    <d69>   DW_AT_type        : <0xd16>
 <1><d6d>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <d6e>   DW_AT_encoding    : 7	(unsigned)
    <d6e>   DW_AT_byte_size   : 1
    <d6e>   DW_AT_type        : <0x48c>
    <d72>   DW_AT_decl_file   : 10
    <d73>   DW_AT_decl_line   : 68
    <d74>   DW_AT_decl_column : 1
    <d74>   DW_AT_sibling     : <0xd85>
 <2><d78>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d79>   DW_AT_name        : (indirect string, offset: 0x666bb): GPIO_PIN_RESET
    <d7d>   DW_AT_const_value : 0
 <2><d7e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <d7f>   DW_AT_name        : (indirect string, offset: 0x26ccb): GPIO_PIN_SET
    <d83>   DW_AT_const_value : 1
 <2><d84>: Abbrev Number: 0
 <1><d85>: Abbrev Number: 6 (DW_TAG_typedef)
    <d86>   DW_AT_name        : (indirect string, offset: 0x4a03d): GPIO_PinState
    <d8a>   DW_AT_decl_file   : 10
    <d8b>   DW_AT_decl_line   : 71
    <d8c>   DW_AT_decl_column : 2
    <d8d>   DW_AT_type        : <0xd6d>
 <1><d91>: Abbrev Number: 42 (DW_TAG_subroutine_type)
    <d92>   DW_AT_prototyped  : 1
 <1><d92>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <d93>   DW_AT_byte_size   : 4
    <d93>   DW_AT_type        : <0xd91>
 <1><d97>: Abbrev Number: 8 (DW_TAG_structure_type)
    <d98>   DW_AT_byte_size   : 48
    <d99>   DW_AT_decl_file   : 11
    <d9a>   DW_AT_decl_line   : 48
    <d9b>   DW_AT_decl_column : 9
    <d9c>   DW_AT_sibling     : <0xe3d>
 <2><da0>: Abbrev Number: 1 (DW_TAG_member)
    <da1>   DW_AT_name        : (indirect string, offset: 0x8aba2): Channel
    <da5>   DW_AT_decl_file   : 11
    <da6>   DW_AT_decl_line   : 50
    <da7>   DW_AT_decl_column : 12
    <da8>   DW_AT_type        : <0x511>
    <dac>   DW_AT_data_member_location: 0
 <2><dad>: Abbrev Number: 1 (DW_TAG_member)
    <dae>   DW_AT_name        : (indirect string, offset: 0x89f46): Direction
    <db2>   DW_AT_decl_file   : 11
    <db3>   DW_AT_decl_line   : 53
    <db4>   DW_AT_decl_column : 12
    <db5>   DW_AT_type        : <0x511>
    <db9>   DW_AT_data_member_location: 4
 <2><dba>: Abbrev Number: 1 (DW_TAG_member)
    <dbb>   DW_AT_name        : (indirect string, offset: 0x8898f): PeriphInc
    <dbf>   DW_AT_decl_file   : 11
    <dc0>   DW_AT_decl_line   : 57
    <dc1>   DW_AT_decl_column : 12
    <dc2>   DW_AT_type        : <0x511>
    <dc6>   DW_AT_data_member_location: 8
 <2><dc7>: Abbrev Number: 1 (DW_TAG_member)
    <dc8>   DW_AT_name        : (indirect string, offset: 0x88fce): MemInc
    <dcc>   DW_AT_decl_file   : 11
    <dcd>   DW_AT_decl_line   : 60
    <dce>   DW_AT_decl_column : 12
    <dcf>   DW_AT_type        : <0x511>
    <dd3>   DW_AT_data_member_location: 12
 <2><dd4>: Abbrev Number: 1 (DW_TAG_member)
    <dd5>   DW_AT_name        : (indirect string, offset: 0x8a9c4): PeriphDataAlignment
    <dd9>   DW_AT_decl_file   : 11
    <dda>   DW_AT_decl_line   : 63
    <ddb>   DW_AT_decl_column : 12
    <ddc>   DW_AT_type        : <0x511>
    <de0>   DW_AT_data_member_location: 16
 <2><de1>: Abbrev Number: 1 (DW_TAG_member)
    <de2>   DW_AT_name        : (indirect string, offset: 0x8cc45): MemDataAlignment
    <de6>   DW_AT_decl_file   : 11
    <de7>   DW_AT_decl_line   : 66
    <de8>   DW_AT_decl_column : 12
    <de9>   DW_AT_type        : <0x511>
    <ded>   DW_AT_data_member_location: 20
 <2><dee>: Abbrev Number: 1 (DW_TAG_member)
    <def>   DW_AT_name        : (indirect string, offset: 0x8fb2d): Mode
    <df3>   DW_AT_decl_file   : 11
    <df4>   DW_AT_decl_line   : 69
    <df5>   DW_AT_decl_column : 12
    <df6>   DW_AT_type        : <0x511>
    <dfa>   DW_AT_data_member_location: 24
 <2><dfb>: Abbrev Number: 1 (DW_TAG_member)
    <dfc>   DW_AT_name        : (indirect string, offset: 0x8e7a4): Priority
    <e00>   DW_AT_decl_file   : 11
    <e01>   DW_AT_decl_line   : 74
    <e02>   DW_AT_decl_column : 12
    <e03>   DW_AT_type        : <0x511>
    <e07>   DW_AT_data_member_location: 28
 <2><e08>: Abbrev Number: 1 (DW_TAG_member)
    <e09>   DW_AT_name        : (indirect string, offset: 0x8a46e): FIFOMode
    <e0d>   DW_AT_decl_file   : 11
    <e0e>   DW_AT_decl_line   : 77
    <e0f>   DW_AT_decl_column : 12
    <e10>   DW_AT_type        : <0x511>
    <e14>   DW_AT_data_member_location: 32
 <2><e15>: Abbrev Number: 1 (DW_TAG_member)
    <e16>   DW_AT_name        : (indirect string, offset: 0x8c190): FIFOThreshold
    <e1a>   DW_AT_decl_file   : 11
    <e1b>   DW_AT_decl_line   : 82
    <e1c>   DW_AT_decl_column : 12
    <e1d>   DW_AT_type        : <0x511>
    <e21>   DW_AT_data_member_location: 36
 <2><e22>: Abbrev Number: 1 (DW_TAG_member)
    <e23>   DW_AT_name        : (indirect string, offset: 0x8c0fe): MemBurst
    <e27>   DW_AT_decl_file   : 11
    <e28>   DW_AT_decl_line   : 85
    <e29>   DW_AT_decl_column : 12
    <e2a>   DW_AT_type        : <0x511>
    <e2e>   DW_AT_data_member_location: 40
 <2><e2f>: Abbrev Number: 1 (DW_TAG_member)
    <e30>   DW_AT_name        : (indirect string, offset: 0x89cda): PeriphBurst
    <e34>   DW_AT_decl_file   : 11
    <e35>   DW_AT_decl_line   : 91
    <e36>   DW_AT_decl_column : 12
    <e37>   DW_AT_type        : <0x511>
    <e3b>   DW_AT_data_member_location: 44
 <2><e3c>: Abbrev Number: 0
 <1><e3d>: Abbrev Number: 6 (DW_TAG_typedef)
    <e3e>   DW_AT_name        : (indirect string, offset: 0x897e6): DMA_InitTypeDef
    <e42>   DW_AT_decl_file   : 11
    <e43>   DW_AT_decl_line   : 96
    <e44>   DW_AT_decl_column : 2
    <e45>   DW_AT_type        : <0xd97>
 <1><e49>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <e4a>   DW_AT_encoding    : 7	(unsigned)
    <e4a>   DW_AT_byte_size   : 1
    <e4a>   DW_AT_type        : <0x48c>
    <e4e>   DW_AT_decl_file   : 11
    <e4f>   DW_AT_decl_line   : 103
    <e50>   DW_AT_decl_column : 1
    <e50>   DW_AT_sibling     : <0xe79>
 <2><e54>: Abbrev Number: 4 (DW_TAG_enumerator)
    <e55>   DW_AT_name        : (indirect string, offset: 0x8c039): HAL_DMA_STATE_RESET
    <e59>   DW_AT_const_value : 0
 <2><e5a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <e5b>   DW_AT_name        : (indirect string, offset: 0x89860): HAL_DMA_STATE_READY
    <e5f>   DW_AT_const_value : 1
 <2><e60>: Abbrev Number: 4 (DW_TAG_enumerator)
    <e61>   DW_AT_name        : (indirect string, offset: 0x8bb60): HAL_DMA_STATE_BUSY
    <e65>   DW_AT_const_value : 2
 <2><e66>: Abbrev Number: 4 (DW_TAG_enumerator)
    <e67>   DW_AT_name        : (indirect string, offset: 0x8d4b8): HAL_DMA_STATE_TIMEOUT
    <e6b>   DW_AT_const_value : 3
 <2><e6c>: Abbrev Number: 4 (DW_TAG_enumerator)
    <e6d>   DW_AT_name        : (indirect string, offset: 0x8c88f): HAL_DMA_STATE_ERROR
    <e71>   DW_AT_const_value : 4
 <2><e72>: Abbrev Number: 4 (DW_TAG_enumerator)
    <e73>   DW_AT_name        : (indirect string, offset: 0x8949d): HAL_DMA_STATE_ABORT
    <e77>   DW_AT_const_value : 5
 <2><e78>: Abbrev Number: 0
 <1><e79>: Abbrev Number: 6 (DW_TAG_typedef)
    <e7a>   DW_AT_name        : (indirect string, offset: 0x8b857): HAL_DMA_StateTypeDef
    <e7e>   DW_AT_decl_file   : 11
    <e7f>   DW_AT_decl_line   : 110
    <e80>   DW_AT_decl_column : 2
    <e81>   DW_AT_type        : <0xe49>
 <1><e85>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <e86>   DW_AT_type        : <0xe79>
 <1><e8a>: Abbrev Number: 37 (DW_TAG_structure_type)
    <e8b>   DW_AT_name        : (indirect string, offset: 0x8c839): __DMA_HandleTypeDef
    <e8f>   DW_AT_byte_size   : 96
    <e90>   DW_AT_decl_file   : 11
    <e91>   DW_AT_decl_line   : 138
    <e92>   DW_AT_decl_column : 16
    <e92>   DW_AT_sibling     : <0xf4d>
 <2><e96>: Abbrev Number: 1 (DW_TAG_member)
    <e97>   DW_AT_name        : (indirect string, offset: 0x8a0ec): Instance
    <e9b>   DW_AT_decl_file   : 11
    <e9c>   DW_AT_decl_line   : 140
    <e9d>   DW_AT_decl_column : 31
    <e9e>   DW_AT_type        : <0xf4d>
    <ea2>   DW_AT_data_member_location: 0
 <2><ea3>: Abbrev Number: 1 (DW_TAG_member)
    <ea4>   DW_AT_name        : (indirect string, offset: 0x8ed65): Init
    <ea8>   DW_AT_decl_file   : 11
    <ea9>   DW_AT_decl_line   : 142
    <eaa>   DW_AT_decl_column : 30
    <eab>   DW_AT_type        : <0xe3d>
    <eaf>   DW_AT_data_member_location: 4
 <2><eb0>: Abbrev Number: 1 (DW_TAG_member)
    <eb1>   DW_AT_name        : (indirect string, offset: 0x8eaae): Lock
    <eb5>   DW_AT_decl_file   : 11
    <eb6>   DW_AT_decl_line   : 144
    <eb7>   DW_AT_decl_column : 30
    <eb8>   DW_AT_type        : <0xc35>
    <ebc>   DW_AT_data_member_location: 52
 <2><ebd>: Abbrev Number: 1 (DW_TAG_member)
    <ebe>   DW_AT_name        : (indirect string, offset: 0x8b9b1): State
    <ec2>   DW_AT_decl_file   : 11
    <ec3>   DW_AT_decl_line   : 146
    <ec4>   DW_AT_decl_column : 30
    <ec5>   DW_AT_type        : <0xe85>
    <ec9>   DW_AT_data_member_location: 53
 <2><eca>: Abbrev Number: 1 (DW_TAG_member)
    <ecb>   DW_AT_name        : (indirect string, offset: 0x8d2fa): Parent
    <ecf>   DW_AT_decl_file   : 11
    <ed0>   DW_AT_decl_line   : 148
    <ed1>   DW_AT_decl_column : 31
    <ed2>   DW_AT_type        : <0xf52>
    <ed6>   DW_AT_data_member_location: 56
 <2><ed7>: Abbrev Number: 1 (DW_TAG_member)
    <ed8>   DW_AT_name        : (indirect string, offset: 0x8d616): XferCpltCallback
    <edc>   DW_AT_decl_file   : 11
    <edd>   DW_AT_decl_line   : 150
    <ede>   DW_AT_decl_column : 33
    <edf>   DW_AT_type        : <0xf64>
    <ee3>   DW_AT_data_member_location: 60
 <2><ee4>: Abbrev Number: 1 (DW_TAG_member)
    <ee5>   DW_AT_name        : (indirect string, offset: 0x8c30d): XferHalfCpltCallback
    <ee9>   DW_AT_decl_file   : 11
    <eea>   DW_AT_decl_line   : 152
    <eeb>   DW_AT_decl_column : 33
    <eec>   DW_AT_type        : <0xf64>
    <ef0>   DW_AT_data_member_location: 64
 <2><ef1>: Abbrev Number: 1 (DW_TAG_member)
    <ef2>   DW_AT_name        : (indirect string, offset: 0x8961f): XferM1CpltCallback
    <ef6>   DW_AT_decl_file   : 11
    <ef7>   DW_AT_decl_line   : 154
    <ef8>   DW_AT_decl_column : 33
    <ef9>   DW_AT_type        : <0xf64>
    <efd>   DW_AT_data_member_location: 68
 <2><efe>: Abbrev Number: 1 (DW_TAG_member)
    <eff>   DW_AT_name        : (indirect string, offset: 0x8ae2d): XferM1HalfCpltCallback
    <f03>   DW_AT_decl_file   : 11
    <f04>   DW_AT_decl_line   : 156
    <f05>   DW_AT_decl_column : 33
    <f06>   DW_AT_type        : <0xf64>
    <f0a>   DW_AT_data_member_location: 72
 <2><f0b>: Abbrev Number: 1 (DW_TAG_member)
    <f0c>   DW_AT_name        : (indirect string, offset: 0x88e57): XferErrorCallback
    <f10>   DW_AT_decl_file   : 11
    <f11>   DW_AT_decl_line   : 158
    <f12>   DW_AT_decl_column : 33
    <f13>   DW_AT_type        : <0xf64>
    <f17>   DW_AT_data_member_location: 76
 <2><f18>: Abbrev Number: 1 (DW_TAG_member)
    <f19>   DW_AT_name        : (indirect string, offset: 0x8d22b): XferAbortCallback
    <f1d>   DW_AT_decl_file   : 11
    <f1e>   DW_AT_decl_line   : 160
    <f1f>   DW_AT_decl_column : 33
    <f20>   DW_AT_type        : <0xf64>
    <f24>   DW_AT_data_member_location: 80
 <2><f25>: Abbrev Number: 1 (DW_TAG_member)
    <f26>   DW_AT_name        : (indirect string, offset: 0x8e955): ErrorCode
    <f2a>   DW_AT_decl_file   : 11
    <f2b>   DW_AT_decl_line   : 162
    <f2c>   DW_AT_decl_column : 30
    <f2d>   DW_AT_type        : <0x51d>
    <f31>   DW_AT_data_member_location: 84
 <2><f32>: Abbrev Number: 1 (DW_TAG_member)
    <f33>   DW_AT_name        : (indirect string, offset: 0x8c141): StreamBaseAddress
    <f37>   DW_AT_decl_file   : 11
    <f38>   DW_AT_decl_line   : 164
    <f39>   DW_AT_decl_column : 30
    <f3a>   DW_AT_type        : <0x511>
    <f3e>   DW_AT_data_member_location: 88
 <2><f3f>: Abbrev Number: 1 (DW_TAG_member)
    <f40>   DW_AT_name        : (indirect string, offset: 0x8c715): StreamIndex
    <f44>   DW_AT_decl_file   : 11
    <f45>   DW_AT_decl_line   : 166
    <f46>   DW_AT_decl_column : 30
    <f47>   DW_AT_type        : <0x511>
    <f4b>   DW_AT_data_member_location: 92
 <2><f4c>: Abbrev Number: 0
 <1><f4d>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <f4e>   DW_AT_byte_size   : 4
    <f4e>   DW_AT_type        : <0x75a>
 <1><f52>: Abbrev Number: 43 (DW_TAG_pointer_type)
    <f53>   DW_AT_byte_size   : 4
 <1><f54>: Abbrev Number: 38 (DW_TAG_subroutine_type)
    <f55>   DW_AT_prototyped  : 1
    <f55>   DW_AT_sibling     : <0xf5f>
 <2><f59>: Abbrev Number: 9 (DW_TAG_formal_parameter)
    <f5a>   DW_AT_type        : <0xf5f>
 <2><f5e>: Abbrev Number: 0
 <1><f5f>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <f60>   DW_AT_byte_size   : 4
    <f60>   DW_AT_type        : <0xe8a>
 <1><f64>: Abbrev Number: 10 (DW_TAG_pointer_type)
    <f65>   DW_AT_byte_size   : 4
    <f65>   DW_AT_type        : <0xf54>
 <1><f69>: Abbrev Number: 6 (DW_TAG_typedef)
    <f6a>   DW_AT_name        : (indirect string, offset: 0x8c83b): DMA_HandleTypeDef
    <f6e>   DW_AT_decl_file   : 11
    <f6f>   DW_AT_decl_line   : 168
    <f70>   DW_AT_decl_column : 2
    <f71>   DW_AT_type        : <0xe8a>
 <1><f75>: Abbrev Number: 8 (DW_TAG_structure_type)
    <f76>   DW_AT_byte_size   : 20
    <f77>   DW_AT_decl_file   : 12
    <f78>   DW_AT_decl_line   : 45
    <f79>   DW_AT_decl_column : 9
    <f7a>   DW_AT_sibling     : <0xfc0>
 <2><f7e>: Abbrev Number: 1 (DW_TAG_member)
    <f7f>   DW_AT_name        : (indirect string, offset: 0x8b559): TypeErase
    <f83>   DW_AT_decl_file   : 12
    <f84>   DW_AT_decl_line   : 47
    <f85>   DW_AT_decl_column : 12
    <f86>   DW_AT_type        : <0x511>
    <f8a>   DW_AT_data_member_location: 0
 <2><f8b>: Abbrev Number: 1 (DW_TAG_member)
    <f8c>   DW_AT_name        : (indirect string, offset: 0x8b58b): Banks
    <f90>   DW_AT_decl_file   : 12
    <f91>   DW_AT_decl_line   : 50
    <f92>   DW_AT_decl_column : 12
    <f93>   DW_AT_type        : <0x511>
    <f97>   DW_AT_data_member_location: 4
 <2><f98>: Abbrev Number: 1 (DW_TAG_member)
    <f99>   DW_AT_name        : (indirect string, offset: 0x8ec30): Sector
    <f9d>   DW_AT_decl_file   : 12
    <f9e>   DW_AT_decl_line   : 53
    <f9f>   DW_AT_decl_column : 12
    <fa0>   DW_AT_type        : <0x511>
    <fa4>   DW_AT_data_member_location: 8
 <2><fa5>: Abbrev Number: 1 (DW_TAG_member)
    <fa6>   DW_AT_name        : (indirect string, offset: 0x88f4b): NbSectors
    <faa>   DW_AT_decl_file   : 12
    <fab>   DW_AT_decl_line   : 56
    <fac>   DW_AT_decl_column : 12
    <fad>   DW_AT_type        : <0x511>
    <fb1>   DW_AT_data_member_location: 12
 <2><fb2>: Abbrev Number: 1 (DW_TAG_member)
    <fb3>   DW_AT_name        : (indirect string, offset: 0x88ff7): VoltageRange
    <fb7>   DW_AT_decl_file   : 12
    <fb8>   DW_AT_decl_line   : 59
    <fb9>   DW_AT_decl_column : 12
    <fba>   DW_AT_type        : <0x511>
    <fbe>   DW_AT_data_member_location: 16
 <2><fbf>: Abbrev Number: 0
 <1><fc0>: Abbrev Number: 6 (DW_TAG_typedef)
    <fc1>   DW_AT_name        : (indirect string, offset: 0x8ac32): FLASH_EraseInitTypeDef
    <fc5>   DW_AT_decl_file   : 12
    <fc6>   DW_AT_decl_line   : 62
    <fc7>   DW_AT_decl_column : 3
    <fc8>   DW_AT_type        : <0xf75>
 <1><fcc>: Abbrev Number: 8 (DW_TAG_structure_type)
    <fcd>   DW_AT_byte_size   : 44
    <fce>   DW_AT_decl_file   : 13
    <fcf>   DW_AT_decl_line   : 46
    <fd0>   DW_AT_decl_column : 9
    <fd1>   DW_AT_sibling     : <0x1065>
 <2><fd5>: Abbrev Number: 1 (DW_TAG_member)
    <fd6>   DW_AT_name        : (indirect string, offset: 0x8fb2d): Mode
    <fda>   DW_AT_decl_file   : 13
    <fdb>   DW_AT_decl_line   : 48
    <fdc>   DW_AT_decl_column : 12
    <fdd>   DW_AT_type        : <0x511>
    <fe1>   DW_AT_data_member_location: 0
 <2><fe2>: Abbrev Number: 1 (DW_TAG_member)
    <fe3>   DW_AT_name        : (indirect string, offset: 0x89f46): Direction
    <fe7>   DW_AT_decl_file   : 13
    <fe8>   DW_AT_decl_line   : 51
    <fe9>   DW_AT_decl_column : 12
    <fea>   DW_AT_type        : <0x511>
    <fee>   DW_AT_data_member_location: 4
 <2><fef>: Abbrev Number: 1 (DW_TAG_member)
    <ff0>   DW_AT_name        : (indirect string, offset: 0x8c246): DataSize
    <ff4>   DW_AT_decl_file   : 13
    <ff5>   DW_AT_decl_line   : 54
    <ff6>   DW_AT_decl_column : 12
    <ff7>   DW_AT_type        : <0x511>
    <ffb>   DW_AT_data_member_location: 8
 <2><ffc>: Abbrev Number: 1 (DW_TAG_member)
    <ffd>   DW_AT_name        : (indirect string, offset: 0x88748): CLKPolarity
    <1001>   DW_AT_decl_file   : 13
    <1002>   DW_AT_decl_line   : 57
    <1003>   DW_AT_decl_column : 12
    <1004>   DW_AT_type        : <0x511>
    <1008>   DW_AT_data_member_location: 12
 <2><1009>: Abbrev Number: 1 (DW_TAG_member)
    <100a>   DW_AT_name        : (indirect string, offset: 0x8b922): CLKPhase
    <100e>   DW_AT_decl_file   : 13
    <100f>   DW_AT_decl_line   : 60
    <1010>   DW_AT_decl_column : 12
    <1011>   DW_AT_type        : <0x511>
    <1015>   DW_AT_data_member_location: 16
 <2><1016>: Abbrev Number: 22 (DW_TAG_member)
    <1017>   DW_AT_name        : NSS
    <101b>   DW_AT_decl_file   : 13
    <101c>   DW_AT_decl_line   : 63
    <101d>   DW_AT_decl_column : 12
    <101e>   DW_AT_type        : <0x511>
    <1022>   DW_AT_data_member_location: 20
 <2><1023>: Abbrev Number: 1 (DW_TAG_member)
    <1024>   DW_AT_name        : (indirect string, offset: 0x89b4b): BaudRatePrescaler
    <1028>   DW_AT_decl_file   : 13
    <1029>   DW_AT_decl_line   : 67
    <102a>   DW_AT_decl_column : 12
    <102b>   DW_AT_type        : <0x511>
    <102f>   DW_AT_data_member_location: 24
 <2><1030>: Abbrev Number: 1 (DW_TAG_member)
    <1031>   DW_AT_name        : (indirect string, offset: 0x8b6c7): FirstBit
    <1035>   DW_AT_decl_file   : 13
    <1036>   DW_AT_decl_line   : 73
    <1037>   DW_AT_decl_column : 12
    <1038>   DW_AT_type        : <0x511>
    <103c>   DW_AT_data_member_location: 28
 <2><103d>: Abbrev Number: 1 (DW_TAG_member)
    <103e>   DW_AT_name        : (indirect string, offset: 0x8b065): TIMode
    <1042>   DW_AT_decl_file   : 13
    <1043>   DW_AT_decl_line   : 76
    <1044>   DW_AT_decl_column : 12
    <1045>   DW_AT_type        : <0x511>
    <1049>   DW_AT_data_member_location: 32
 <2><104a>: Abbrev Number: 1 (DW_TAG_member)
    <104b>   DW_AT_name        : (indirect string, offset: 0x8bedf): CRCCalculation
    <104f>   DW_AT_decl_file   : 13
    <1050>   DW_AT_decl_line   : 79
    <1051>   DW_AT_decl_column : 12
    <1052>   DW_AT_type        : <0x511>
    <1056>   DW_AT_data_member_location: 36
 <2><1057>: Abbrev Number: 1 (DW_TAG_member)
    <1058>   DW_AT_name        : (indirect string, offset: 0x8acd6): CRCPolynomial
    <105c>   DW_AT_decl_file   : 13
    <105d>   DW_AT_decl_line   : 82
    <105e>   DW_AT_decl_column : 12
    <105f>   DW_AT_type        : <0x511>
    <1063>   DW_AT_data_member_location: 40
 <2><1064>: Abbrev Number: 0
 <1><1065>: Abbrev Number: 6 (DW_TAG_typedef)
    <1066>   DW_AT_name        : (indirect string, offset: 0x891a1): SPI_InitTypeDef
    <106a>   DW_AT_decl_file   : 13
    <106b>   DW_AT_decl_line   : 84
    <106c>   DW_AT_decl_column : 3
    <106d>   DW_AT_type        : <0xfcc>
 <1><1071>: Abbrev Number: 25 (DW_TAG_enumeration_type)
    <1072>   DW_AT_encoding    : 7	(unsigned)
    <1072>   DW_AT_byte_size   : 1
    <1072>   DW_AT_type        : <0x48c>
    <1076>   DW_AT_decl_file   : 13
    <1077>   DW_AT_decl_line   : 90
    <1078>   DW_AT_decl_column : 1
    <1078>   DW_AT_sibling     : <0x10ad>
 <2><107c>: Abbrev Number: 4 (DW_TAG_enumerator)
    <107d>   DW_AT_name        : (indirect string, offset: 0x8b809): HAL_SPI_STATE_RESET
    <1081>   DW_AT_const_value : 0
 <2><1082>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1083>   DW_AT_name        : (indirect string, offset: 0x891cd): HAL_SPI_STATE_READY
    <1087>   DW_AT_const_value : 1
 <2><1088>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1089>   DW_AT_name        : (indirect string, offset: 0x8c754): HAL_SPI_STATE_BUSY
    <108d>   DW_AT_const_value : 2
 <2><108e>: Abbrev Number: 4 (DW_TAG_enumerator)
    <108f>   DW_AT_name        : (indirect string, offset: 0x8ad07): HAL_SPI_STATE_BUSY_TX
    <1093>   DW_AT_const_value : 3
 <2><1094>: Abbrev Number: 4 (DW_TAG_enumerator)
    <1095>   DW_AT_name        : (indirect string, offset: 0x8acc0): HAL_SPI_STATE_BUSY_RX
    <1099>   DW_AT_const_value : 4
 <2><109a>: Abbrev Number: 4 (DW_TAG_enumerator)
    <109b>   DW_AT_name        : (indirect string, offset: 0x8a239): HAL_SPI_STATE_BUSY_TX_RX
    <109f>   DW_AT_const_value : 5
 <2><10a0>: Abbrev Number: 4 (DW_TAG_enumerator)
    <10a1>   DW_AT_name        : (indirect string, offset: 0x8c2d0): HAL_SPI_STATE_ERROR
    <10a5>   DW_AT_const_value : 6
 <2><10a6>: Abbrev Number: 4 (DW_TAG_enumerator)
    <10a7>   DW_AT_name        : (indirect string, offset: 0x88e69): HAL_SPI_STATE_ABORT
    <10ab>   DW_AT_const_value : 7
 <2><10ac>: Abbrev Number: 0
 <1><10ad>: Abbrev Number: 6 (DW_TAG_typedef)
    <10ae>   DW_AT_name        : (indirect string, offset: 0x8cc26): HAL_SPI_StateTypeDef
    <10b2>   DW_AT_decl_file   : 13
    <10b3>   DW_AT_decl_line   : 99
    <10b4>   DW_AT_decl_column : 3
    <10b5>   DW_AT_type        : <0x1071>
 <1><10b9>: Abbrev Number: 14 (DW_TAG_volatile_type)
    <10ba>   DW_AT_type        : <0x10ad>
 <1><10be>: Abbrev Number: 37 (DW_TAG_structure_type)
    <10bf>   DW_AT_name        : (indirect string, offset: 0x8cb1e): __SPI_HandleTypeDef
    <10c3>   DW_AT_byte_size   : 128
    <10c4>   DW_AT_decl_file   : 13
    <10c5>   DW_AT_decl_line   : 104
    <10c6>   DW_AT_decl_column : 16
    <10c6>   DW_AT_sibling     : <0x1210>
 <2><10ca>: Abbrev Number: 1 (DW_TAG_member)
    <10cb>   DW_AT_name        : (indirect string, offset: 0x8a0ec): Instance
    <10cf>   DW_AT_decl_file   : 13
    <10d0>   DW_AT_decl_line   : 106
    <10d1>   DW_AT_decl_column : 31
    <10d2>   DW_AT_type        : <0x1210>
    <10d6>   DW_AT_data_member_location: 0
 <2><10d7>: Abbrev Number: 1 (DW_TAG_member)
    <10d8>   DW_AT_name        : (indirect string, offset: 0x8ed65): Init
    <10dc>   DW_AT_decl_file   : 13
    <10dd>   DW_AT_decl_line   : 108
    <10de>   DW_AT_decl_column : 30
    <10df>   DW_AT_type        : <0x1065>
    <10e3>   DW_AT_data_member_location: 4
 <2><10e4>: Abbrev Number: 1 (DW_TAG_member)
    <10e5>   DW_AT_name        : (indirect string, offset: 0x8a824): pTxBuffPtr
    <10e9>   DW_AT_decl_file   : 13
    <10ea>   DW_AT_decl_line   : 110
    <10eb>   DW_AT_decl_column : 31
